[
"ለካ ጭብል ለበሰ ፕሮፌሰር ፎቶ ለጥፈክ አለ አለ ባዳ ነክ ፈር ትንሽ",
"ይሄው ነው አይደል እውቀት ጥግበሰሚ ሰማ ተናገረ ምን ታሪክ አታነቢምደሞ ራስ ገመተ",
"ዛሬ ጁመዓ ወሎ ኮንቦልቻ የተደረካ ከባድ መልክት አለ የቃውሞ ሰልፍ ብልጽግና ፓርቲ ብልጽግና አየ",
"አማራ ክልል ፈላ ልክ ገባ ነው ሙስሊም ጠላ ሙስሊም ኖረ ኦሮምያ ጋረ ግንኙነት አትሰበው",
"ጥበበኛ ፍቅር ማረ ቴዲ አፈረ",
"ጽድቅ ኩነኔ ኖረ ኖረ ክፋት ደግነት ተሻለ ቀረ",
"ድሮ ዘመነ ኮዳክ ፎቶ ቤት ፍላሹ አለ አይን ጨፈነ ወጣ የምንቸክለውን ነገር እውስ ምን ሆነ ነው ግን ኋላ አለ ቴዲ ሁሉ ፊት ዞረ እኮ",
"ገገማ",
"ሀገር ችግር አወቀ እና መፍትሄ መጣ ትክክል ሀገር ሰው ነው ይቺ ወጣ እንጀራ ጋገረ ፈለገ አብሲት ለየ ቀለለ ዘዴ ተዘጋጀ እናት ውለታ ዋለ ሰይፍ በኢቢኤስ",
"ጠለቀ ያህል ወሰነ ነገር ፈለገ ልያታይ ጥስው ዶረበ ጽርቅ ድንአ ምን ተነሳ ሉቃብጠይ ንዱንአ ንችታለሁከ ይአ",
"ሀይማኖት መራ ክርስትና እምነት ተከታይ የእንኳን ደረሰ መልእክት አለፈ",
"ሰው አንገት ደፋ መልክ ዝም አለ ሙድ መያዝስልህ ሰው ምን ሳያጠፋተቀባብሎ ተሳለቀ",
"ጀመረ ቃል ብቻ ነበረ፤ ቃል ቀለም ተቀናበረ፤ ቃል ቀለም ተግባር ኖረ፤ መዕራፉን ጨረሰ ቋጠረ",
"ቤት ውስጥ ጥቃት ያለሰሚ ያለተመልካች",
"ኤርትራዊ ስነ ጥበበኛታት ንናይ ጎደና ስነጥበብ ክንደፍኣሉ ይግባእ ንዘሎና ሀብታም አራ ብቕርጻ፡ ብቕብኣን ስነ ጽሁፍ ክንትርኾ ኣሎና ነፍሲ ወከፍ ጎደና አራ ክንስንደሉ ዝኽእል",
"ሀገር ቀፈፈ ብሄራዊ ሴት ሰላም ምክር ቤት ተቋቋመ",
"ሰአት የቴሌቭዥን መርሐግብሩ ተጀምሯልከዮድ አቢሲንያ ብስር ዝግጅት አለ",
"ይህ አይነት ወር ረገበ ነው",
"አንተ የበታችነት ስሜት ነው፣ ማን ክርር ሰከረ መጣ መስጂድህን ሲያቃጥልብህ፣ እኛ ተናገረ አንተ መለሰ እኛ ምን አገባቹ ትላለህያንተን አይነት",
"በላ ራስ ጀዋርን እንደ ጠቀመ አረገ ይህ ሁሉ ተጠያቂዉ በላ ነዉ",
"ጥንብ ዘረኛ ጠፋ ይህ መርዝ",
"ወያኔን ጣለ ምን ድርሻ ነበረ ወደቀ ኋላ ጉራ ነዛ በቀር",
"",
"እኔ ሞተ ጌታ ሆይ ኧረ",
"ኦሮሞ ምን ተማረ ከብት ነዉ አያስተዉልም ጥንብ ዘረኛ ናቸዉ",
"አምላከ ቅዱስ ዑራኤል መልአክ ቀን የተበረከና ቀደሰ ያድርግልን፡፡ ሰላም አደረ ሰላም ያውለን፡፡ አገር ኢትዮጵያ ዳር ሰአት መሀል ገነት ተደረገ ይጠብቅልን፡፡ አሜን",
"ጠራ ጊዜ፣በተለይ ቆመ ተንቦገቦገ አለ",
"መልካም እሴት አደገ ችግር ሰላም ፈታ ሁሉ ዜጋ አበረ ቆመ አለበት፡ ሀይማኖት አባት",
"ኢትዮጵያ ደከመ ጊዜ ግፍ ወሰደ ባህር በር ጊዜ ጉዳይ ነው እንጂ አስመለሰ ቀረ ቻለ እና ቦሊቪያ ብዙ ተማረ ገባ",
"ቲሽ ጨለምተኛ ዱቄት ላይ ቆመ እንዴ ጊዜ ነጐደ ነው አሉባልታ ቀቀለ አለ ልደት መጣ ነው",
"እኛ ቁልጭ ኰራ ነው እኮ",
"ያንች ነጻነት አማራ ህዝብ ነው ወሬኛ",
"ወደደ ነበረ ዛሬ ጠላ እንደ ሰፌድ ቆሎ አመመ አመመ ዘገነሽ፧ ወይ ጉድ",
"ታብሌት ኮምፒውተሮቹ ስጦታ ተገኘ ነው ወይሥ ህዝብ ገንዘብ የተገዙየከተማ አደረ በጀት ያዘ ነበርወይሥ ወዘፈቀደ",
"መልካም አረጋ ነው ተጫወተ",
"ኖረ ወደደ ተነሳ ዱለት ሲኒ ተቀመጠ ቀረበ አለፈ በቆርኪ ቀረበ ጊዜ ሩቅ ነው",
"ሁል ጊዜ ጌታ ደስ አለ",
"ይህ ንግግር ሺ ጊዜ አሜን አለ ደከመ ለሁላችንም መታ ሁላችንንም እኩል አየ ሀገር ጋራ ገነባ",
"እርግጠኛ ሆነ ፈለገ እና ለመደ ውሸት ተናገረ ነው",
"ቈሸሸ ሞተ ደበቀ ያ ቆመ አወቀ",
"ምእራብ ኦሮሚያ ተገኘ ሁለት ወለጋ ዞን ምስራቅ ወለጋ ሆሮ ጉዱሩ ወለጋ ዞን ኢንተርኔት እና ስልክ አገልግሎት ቈረጠ አካባቢ ነዋሪዎች",
"ጥር በኮሮና ቫይረስ ተጠረጠረ ተጨማሪ የላብራቶሪ ምርመራ ወደ ደቡብ አፍሪካ ላከ ነበረ ዜጋ ናሙና ቫይረስ ነጻ ሆነ ጤና ሚኒስቴር ሚንስትር",
"ምርጫ ጊዜ ሰሌዳ ተመለከተ ቦርድ ሰበሰበ ወ/ሪት ብርትኳን ሚዴቅሳ ቀረበ ገለጻ፡ ምርጫ ቀን ወሰነ ሕገመንግስቱን መሰረት ተደረገ መልክ ነው፡፡",
"አንዳንድ ሰው ኢንሻላህ ኢራን አሜሪካ ተሸነፈ ረገጠ ሲበጠረቁ እያዬሁ ነው ሀይማኖት ጎሰኝነትኮ ሀቅ ደፈነ ተወዳዳሪ አለ",
"ደግ ተደረገ ምን አለ አፍ ከፈተ ነው",
"አትሌት ሀይል ጣም ጠቀመ ነገር ሀገር ሰራ ነው እጅግ ደነቀ ገባ እስቲ እኔ ሀይል መቶ ሜትር ሮጠ ተሸነፈ አንድ መኪና እኔ ጀባ አለ",
"መንግስት ስለ ዲሞክራሲ ቀደደ ሰማ ተደረገ ነገር ደንብ ተከታተለ ያኔ አላማ ይገለጥልሃል ሀሳብ ነጻነት ከለከለ መንግስት ስለ ብልጽግና ተወራ",
"እጅግ ጣም የሚስደስት ነው እውነት ቡዙዎች መነጽር ብያስተካክሉ መልካም ነው",
"አቀደ ላይ ገታ ፈታ ሆነ እቅድ ይሠናሠል ዘንድ አንዳንድ መለሰ ለአጋቾቹ ሰጠ ወይዘሮ ንጉስ ጥላሁን",
"ጉዳይ አገር ሰላም አለ ተቀመጠ ህዝብ በቀል እና የርስበርስ ጦርነት ቀሰቀሰ ነው",
"ያየሰው ሺመልስ ላይ ደረሰ ነገር አዘነ ቃል አማረ ላይ በኮ/ን ሀላፊ ንጉስ ጥላሁ እኩል ግድያ",
"ተገኘ መታ",
"እኛ ንክ አየ ብዙ ነገር ቀየረ መልካም አዲስ አመት ፍፄ",
"ጉዳይ ስለ ሙስና ነው አንዳንድ ሰው ሙስና ጠየቀ አለ ነው አንተ ደረሰ ለም ተባለ",
"''ብልፅግና ፓርቲ አዲስ ፓርቲ እንጂ የኢሕአዴግ ውህድ አይደለም'' ኦቦ በቀለ ገርባ ኤም ኤን ሰጠ አየ",
"እኛ አካል ጠራ የንተ ተደሰተ ተጠረጠረ አረገ",
"«ባሐሩን ደፈረሰ መሰለ አሞራ አወቀ እና ለውንብዳናዋ ላቀ ባህር ላይ ሸና እንጂ እሷ ሽንት ላቀ ባህር ደፈረሰ አቅም የለውም» አቦ ማ መገርሳ ሰላም አሜሪካ ገባ",
"ትክክል ለአዲስአበቤዎች ቆመ ፖርቲ ባልደራስ እውነተኛ ዲሞክራሲ ድል ዲሞክራሲ ድል ኢትዮጵያ",
"አለ መራ ፓርቲ ከበበ ዋጠ መራ ፓርቲ እንደ ልጥ ዋጠ ነው ያኔ ኧረ ጀዌ ከበበ ፓርቲ ዋጠ አለ መስሚያ ወይን መራ ስም መራ",
"እኮ እኔ ኧረ ምን ቈረጠ ግን ተቀየመ በቃ ምክንያት አለ አለ አመነ",
"ትግራይ ህወሓት ለየ አየ ይሻላል፡ ደሞ ይሄንን ጉዳይ ክልል ተጠቃ ነው ተስማማ አለ ሆነ ሰማ ሌላ ቀጣይ ምርጫ ሚፈታው",
"አንተ እስከ ቤተሰቦችሁ ወደቃሌቲ አረመ ቤት",
"በግ ዘረፈ አገር አንፎጋገር",
"አየ ሳሙኤል እቃ በላ መፖሰት አስተማረ ጠረገ በላ መጣ",
"ይህ ሁሉ አወቀ ሰወች እስልምና መሰለ ጭራሽ አለ ይህ ሰይጣናዊ ዛር አለያም እንደ አየ ጭፋ አታላይ ነው",
"ሰላም ፍትህ እንኳን ሀገር ልማት ግለሰብ ወሰነ ነውመንግሥት ለዲሞክራስ መሰረት ሆነ ዲሞክራሲ ወለደ ደግፉው ህይወት መጣ ያዘ ቀና",
"ረጋ ሀገር ምርጫ ፈለገ",
"አሜን፣ በረከት ደረሰ",
"አሁን አለ ያ ነው አከከ ምን ተቀየረ፥ መራ አለ አሜን አለ ቀጠለ ካድሬ ነው መራ ደገመ እኔ ላይ አወቀ አለ ቱልቱላ ነው",
"ከሳ ፒፕሉ ሲያሽቋልጥ ነው ባለፈውሳምንት ፍትህ ቀይ ቀለም እሲኪያስብል ቀይ ለበሰ ህዝብ ሶሻል ሚዲያ ተጨነቀ ደሞ አሁን ይሄ ምነው ሸዋ",
"ፍትህ አለ ሀገር ደሞክራሲ አለ አለ ህዝብ ዋሸ ነው፤ ኢትዮጵያ ውስጥ ቀበሌ ሊቀመንበር እስከ ምንስቴር አለ መራ ቅናተኛና ቅመኛ ነው፤ ፍትህ ለስዳማ ምሁር ወር ሙሉ ያለጥፋታቸው አሰረ",
"ደደብ እና አረፋ ኢትዮጵያ ጠ/ሚ በላ ከኤርትራው ኣያቶላህ ኢሰያስ ወሰደ ምክር እየተጋለጠ ነው ጀዝባና አረፋ በላ አለም ማ/ሰብን ተታለለ",
"እንደዚ አይነት ተረት ተረት እስከ አሁን አለ እንዴ ኢትዮጵያ አፈረ ጣም",
"ሰላም ይብዛልን፡፡",
"ብዙ ነገር ሀቅ ጠበቀ አወቀ ሆነ ነገር ግን ጣም ቸገረ የአላህን ሀቅ ጠበቀ አወቀ ነው",
"ኢትዮጵያ በራ ቀን ደጋጓቹ ጸጋ ዘአብ እና እግዚኃርያ ወንጌል ገበሬ ጻድቅ ፣ንጹሕ ፣የጠራ ፣የተፈተነ ተጋድሎ ማረ ፍሬ አለም በረከተ ልዩ ቀን",
"ሆይ እውነተኛ ሆነ ነገር ሁሉ ጭምትነት አለ ነገር ሁሉ ጽድቅ ሆነ ነገር ሁሉ ንጹህ ሆነ ነገር ሁሉ ፍቅር አለ ነገር ሁሉ መልካም ወር አለ ነገር ሁሉ",
"ሰው ልጅ የመስከንን ጥቅም ቡና ተማረ አለ",
"ምክትል ከንቲባ ታከለ ኡማ ቢሮ ተዘጋጀ ቤት ስር ሆነ ተቋም ተጠሪነት ወደ ራስ ዞረ ነው አለም ባንክ ከተማ ልማት ቤት ሚኒስቴር ድርጊት ተቃወመ",
"ሊቢያ ጦር ሰለጠነ ተቋም ላይ ደረሰ ጥቃት ሰው ተገደሉ፡፡",
"ድርጅት ቆመ አላማ ወጣ ተንቀሳቀሰ ነው አለ ዜና ንዴት እኝህ የምያክል ጉመት ፖለቲከኛና ኢትዮጵያዊ ህዝብ ወደደ ከነፍሰበላው",
"ለየ እኮ እግዚአብሄር አንተ ኢትዮጵያ ጠቀለለ ሚኒስትር ድርግ",
"ውጭ አለ ሀበሻ ልጅ",
"ዘገየ ጋሼ ሃሃሃ ተደረገ ቀረ ተቃጠለ አበረ በቃ ነው ነገር ላይ ጣም ተመሰገነ ሙስሊም እና ጠንካራ ተደረገ",
"ከዩንቨርስቲዎቻችን ጋረ ጀመረ ዎርክሾፖችና ዌብናሮችን አበረ ጠነከረ ጨበጠ ውጤት በእምርታ እንቀዳጃለን፡፡",
"እንደሱማ ሆነ እናንተ ቦታ ኖረ ነው",
"ላቀ ሶስተኛ አለም ጦርነት እራስሽን አዘጋጅ ሰማ አለ",
"በዚ ዘመን ሰው ከገንክ ሚቆመዉ ፎቶ ቢቻ ነዉ ተገኘ ከጎንክ ሚቆመዉም ስንት አንድ ነዉ",
"ግል ሆነ ኖረ ግን ደረደረ ወጣ ዋጋ ሸጠ ነበር",
"እግዚአብሄር ሰጠ መልካም በአል",
"ሙስሊም ጉዳይ አብይ አህመድ አቋም ይህ ቀጠለ ፣እመኑኝ ወያኔ ገባ ቅርቃር ውስጥ ገባ ቀረ ነው",
"ታከለ ኡማ አዲስ አበባ መሬት ራስ ፍቃድ ቦታ ተገኘ እጅ ስልክ ባለ ሀብት ሰጠ ችግር ፈጠረ ከጥታ እሳቸው ብቻ ደወለ ተደረገ ሰራ ሆነ",
"ደመረ ተንፈረጠጠ ሀሳብ ነው ፕሮፌሰር መስፍን ወልደማርያም",
"አባት ተመሰገነ",
"አንተ አለ ጋዜጠኛ ስም ሸረሞጠ ሴሌክቲቭ አታካቸውን ተመለከተ አገር ሆነ ጥቅም አሽከርነት የቆማቹ ህሊናቢስ እንደሆናቹ ረዳ እዚያዉ",
"ሺ ስድብ ቀረ እና ተነጋገረ",
"ድል ዴሞክራሲያ",
"መልካም ዜና ወደ ደቡብ አፍሪካ ተጨማሪ የላብራቶሪ ምርመራ ላከ አራት ተጠረጠረ ውጤት ከኖቭል ኮሮና ቫይረስ ነጻ ሆነ ረገጠ",
"ራስ የማግሰፍ ስልት ልክ ስያልፍ ዉሸት ሆነ ይታወቃልእኔ ብቻ ነው ላቀ ሀሳብ ያለው አለ ራስ አምባገንነት ነዉየሚያገዳድልም መንግስት ጀሌ",
"አንድ አገር ውስጥ ተነሳ ብሄር ድርጅት ብቻ ሆነ በህብረ ብሄር ድርጅት መልስ ተገኘ ቻለ አብዛኛው ብሄር ድርጅት ግን ጥያቄ መለሰ ላቀ ጥያቄ ነገደ ቀና",
"ወ/ሮ ሰናይት ነውረኛ ሴት ተማረ ትውልድ ገደለ ሆነ ፈጠረ ተሻለ ነበር አንቺ ግን ወለደ ዘር ተካ ሰው ልጅ ዘር ተካ ጠፋ ሰራ አለ ወንጀል ፈጠረ ስራ ሰጠ",
"እኛ ሰው እውቀት ነጻ ነው ሀገር መራ ሰው ጀመረ ማጂ ግል ከelemanitary እሰከ ደረሰ አንደሚያውቃት ሰው",
"ጣም ልክ ነው ያ ክልል ዞን ምናምን አለ አድገውኮ ነው ዩኒቨርሲቲ ሄደ ችግር",
"አመት ሞላ ሰው ነው ዲሞክራሲያዊ መብት ጠቀመ እምቡር እምቡር አለ መብት ነዉ",
"ተሰለፈ አርብ ኦሮሚያ ክልል ቄለም ወለጋ ዞን ሰዮ ወረዳ ጉቴ ሰዮማ ቀበሌ ኖረ አማራ ወለደ ላይ ታጠቀ ሰው ገደለ ሸሽስተው ወደ ደንቢዶሎ",
"ፍላጎታችንኮ ገደብ አጣ ለእግዜርም አልተመቸን",
"ይህ አማርኛ ነው እባክዎ እኔ ጋረ ተስማማ",
"ተከተል አይቀርማ እስከ ጨረሰ ነው",
"አመነ ጌታ ብርታት ይስጥህ፣ ጠበቀ መልካም በዓል፡፡",
"አለ ታድያ ኢትዮጵያ ሰላም አለ ተባለ የት አለ",
"ሰራ ሁሉ ክፋት መስሪ ምን አይነት ስይጣን ነው የተጠናዉታችሁ ገዛ ወገን ገደለ ቀን ሌት የምትባዝኑት እኔ አበረ አደገ ትግራዬች",
"ባህር ዳር ከተማ ወሳኝ ተጫዋች ጉዳት አጣ ነው",
"እኔ ሴት ነው እኔ ልጅ እናት ነው እኔ እናት ልጅ ነው እኔ አባት ተስፋ ነው እኔ ወንድም እህት ነው እኔ በአል ሚስት ነው እኔ ሀገር ዜጋ ነው መንግስት ህዝብ ነው የተታፈኑት ሴት እኔ ተመለከተ",
"ልክ ነው ሚሰማ ሰው ነው",
"እትም ይህ ተደራጀ ነው",
"ኧረ አምላክ ምንድ ነው ነገር ልጅ አለቀ ዛሬ ማረ መኪና አደጋ በነውጠኞች ህይወትቅቸውን አጣ ማረ",
"አማራ ክልል ላይ እስልምና ጥላቻ ልብ እንዲጋልብ ባዶ ሜዳ ለቀቀ ባለስልጣን ድጋፍ ተደረገ ፍዳ ከፈለ ሙስሊም አማራ ወለደ ነው ገዛ ልጅ ቀረጠፈ በላ",
"እስርቤት አለ አንድ ምሁር ስለ ሲሳይ ተናገረ ጠቀሰ ወደደ ሲሳይ ተገደደ ደነቀ ሰው ነው አንዱአለም አራጌ ዲሲ ላይ ተደረገ የእራት",
"መልካም እሁድ",
"ውይ ጆኒዬ እኔ ወደደ እኔ ከበረ እዛ መለሰ አየ መሰለ እኮ ነው አፍ አለ",
"ፀረ ህዝብ ስለሆንክክርስቲያንም ሙስሊም አትወክልምበቃ ፀረ ህዝብ ነሀ ምንምማድረግ አይቻልምየሰዎች ሁሉ ጠላት የሰውሰይጣንነህስለዚህ ክርስትያኑ",
"ጠራ ውሳኔ ነው ብድር ተጨነቀ አርፍው ተማረ አሁን ምግብ ኖረ ሳበ ገደለ ግዜ ተገኘ ሌላ አፍሪካ ሀገር ማረ ዩኒቨርቲ ማረ",
"መልካም ስራ ውጭ ጠረቀመ ሸቀጥ ወደደ ወደደ ወገን ምን ያህል በዛ ጠቀመ ቀን እውስ አላህ",
"አረ ምንሼ አዲስ አበባ 'ወጣት' ጠላ ወጣ አለ ላይ ሆነ እንዴ አወቀ ሚሊኒየም አዳራሽ ውስጥ ዛሬ ጎልማሳ ስብሰባ ነበር ተባለ ቀለለ",
"ጥላቻ ረካ እና ፍቅር ዳበረ በጎ አድራጎት እህት የአሴሲ ቅዱስ ፍራንሲስ",
"ደህና አሁን ተኛ",
"መኪና አደጋ ነፍጠኛ ሰራ አገራዊ አፍራሽነትን ደበቀ አይችልም፤ ይህ ማህበረሰብ ሄደ መኪና አደጋ ተወራ ጆሮ",
"ገባ ተጽእኖ አደረ ነው ኢትዮጵያ ብሮድካስቲንግ ኮርፖሬሽን አደረ በትግራኛ ቋንቋ ክፍል ላይ ገባ ተጽእኖ አደረ ነው አለ የትግራኛ ክፍል",
"ግብር ከፈለ ቀና ምን ይህ ገባ ነው ተመለከተ ሁሉ ማን ተናገረ",
"ፈረንጅ ራስ ችግር ተወራ አፍ ብቻ ሆነ ሌላ ችግር የምንሰማበትት ጆሮ ሰጠ ምን ምኞት ነው መልካም አዲስ አመት",
"ማረ ፖለቲካ ጨዋታ ሰለባ ተደረገ የትኛው መልክ ተቀባይነት አለ መንግስት የታገቱ ማረ ጉዳይ ምን ሰራ ሆነ ግልጽ ረዳ ሰጠ ገባ",
"ጣት ቈረጠመ ምግብ ሆነ ጥርግርግ ነው",
"አለም ካቶሊክ መራ ተሣሥቼለሁ ይቅርታ ረጋ አለ አፍሪካ መራ ሳተ ሰው ሆነ ነው አረመ ሰው ሆነ ነው አለ ነው",
"ማንኛውም ስራ ሰራ ሀላፊነት ተጠያቂነት ነው ውሸት ነው አለ አካል ከሰሰ ቻለ ይህ ረዳ ወጣ አካል ኢትዮጵያ ቢሮ አለ መዘገበ አወቀ ድርጅት ነው",
"ሞጣ ፈጸመ መስጊድ ተቃጠለ አስነዋሪ ድርጊት ጤነኛ ሆነ ሰው ሁሉ ውግዝ አሁን ህዝብ ቻለ ተደረገ ሞጣ ሙስሊም ወንድም ጎን ቆመ ጥሪየን ቀረበ",
"ህይወት ይህ አይነት ደነዝ አለም ላይ ኖረ ብየ ፍጹም አመነ ነበር ሆነ ግን እኛ ኢትዮጵያዊ አይወክልም፣ እንዴውም እንደ እኔ ሆነ ለውጥ አደናቃፊ",
"እኔ አመነ ኧረ ቅሌት",
"ወገኛ አየ አንተ አይነት መርዝ አንደኛ ቦልኬ ክብር ሰጠ ልክ ስትቦልከኝ ደንብ እንዳስነቀልኩክ ረገጠ ሆነ ነቀለ ራስ",
"ደራ ደራ አለ አማራ ሰራ ላይ ተኰሰ ከጋ ጋረ ጦርነት ነው ምንፈልገው አለ ሸለለ እየፎከሮ ኦሮሞውን ወጣ ገባ አጣ ነው ኦሮሞ ህዝብ ሁሉ አቅጣጫ",
"ተስፋ ተደረገ",
"ግድ የበታችነት ስሜት ሰማ ነው እሱ ማንነት የሚያቅ ኰራ ኢትዮጵያዊ ነው አንተ አላህ ረዳ ይህ ደረሰ በደል ለቀቀ ጠቀመ ሆነ",
"መልካምነት ከፈለ ግን ልጅ እስካዋቂ፣ ምሁር እስከ ጋዜጠኛ፣ ተማረ እስከ ሀይማኖት መራ 'መልካምነት ይከፍላል፣ ማንበብ ሙሉ ሰው ያደርጋል፣ ፍቅር",
"ወይን ቁጠባ ልምድ መለዎወጫ",
"አገር ሙስሊም ራስ ምህዋር ራስ አገር እኛ እይታ ጠቀሰ ታሪክ ኖረ ገባ ያኔ አመት ዘባ ታሪክ እኛ አመት ታሪክ ለኢትዮጲያ ታሪክ መዋጮ ሆነ",
"ጠቀለለ ሚኒስትር አቢይ አህመድ ቦረና ዞን ያቤሎ ከተማ ገባ ጠቀለለ ሚኒስትር ያቤሎ ደረሰ አካባቢ ሀገር ሽማግሌ ነዋሪዎች ደማቅ አቀባበል አድርገውላቸዋል፡፡",
"እውነት አፈረ ሶስተኛ ክፍል ተማሬ ይሄን አቀደ አለመ ተሳካ አለ ድርቅ",
"በሙስልሙ ህብረተሰብ ጥላቻ ታወረ ፔጆችን ብሎክ ተደረገ ጊዜ አሁን ነው አዲስ አበቤበሚል ጠራ ፔጅ ጀመረ ሰማ",
"አወቀ ኬንያ ቴሌቪዥን ጣቢያ ሲቲዝን ቴቪ ኢትዮጵያ ላም ፕሮጀክት ተሳካ አለ ቁርጠኘነት ተከተለ ዘገበ",
"እንዲህ አለ ነጣ ውሸት ቴሌቪዥን ቀረበ ተወራ ድፍረት የት መጣ",
"ሀገር ሽማግሌ ህግ በላይነት አገዘ አነሰ የስርአተአልበኞች ተጠቃ ሲሀኑ አየ ነው አዛውንት ወጠጤ ጡጫ እርግጫ",
"ለፋ ብሄራዊ ቴአትር አካባቢ ተገኘ ሸክም ቀለለ ተበላሸ ቆመ መኪና አንድ ሰጠ በረታ ነበር ዛሬ አዲስ ተስፋ ስራ ጀመረ እና ችግር ተሻገረ አየ ደስ አለ ወደቀ ቀረ",
"ሉቃስ ማርያም እንዲህ ነፍስ ጌታ ታከብረዋለች፥ መንፈስ አምላክ መድሀኒት ሀሴት ታደርጋለች፤ የባሪያይቱን ውርደት ተመለከተ እነሆም፥",
"ረገጠ ዜና ምእራብ ወለጋ ሸመቀ ነበረ የሸኔ/ኦነግ ወጋ ያህሉ መሳሪያ ፈታ እጅ ሰጠ አሁን ሰአት ጫካ ቀረ ጥቂት ቁጥር አለ ነው ወጣ ይኸው ነው",
"ጥበብ",
"አንተ ደገመ ቶሎ ከፋ ፀባይ አሁን ተሻለ",
"ስንት ነው አለፈ ሁለት አመት ብቻ መላ አገር መስጊድ ቀጠለ አወቀ ቀጠለ መስጊድ ቀጠለ አንድ ክልል አማራ ብሄራዊ ክልል ሆነ",
"ይሄም ገብረ ክርስቶስ ደስታ ልዮ ግጥም ነው ግዜ ተገኘ እይው",
"አሜን ሰላም በራ ሳምንት",
"እኔ ጥያቄ ነው እኮ ወይስ አንድላይ ኖረ ለየ ሁሉ አፈር ድሜ በላ ኖረ ሀገር ላይ ስለ አንድ ብሄር ብቻ አነሳ ሳበ ሆነ እስኪ ይህ",
"አንተ ነገረኛ",
"ቢኒ እኔ ደንበኝነቴን ለማጽናት ቃል ገባ ነው፥ አንተ",
"ማን ፈቀደ ህዝብ ተወያይቶበታል ቢሊዮን ቈጠረ መሬት ህዝብ ገንዘብ ዘረፈ ፎቶ ህዝብ ሰበሰበ ገንዘብ ማን ፈቀደ ምርጫ አለ",
"እንኬው ክንደብርቱ ሰው፣ በረታ ተሸነፈ እርግጠኛ ነው",
"ህዝብ ሁሉ ሆነ ታላቅ ደስታ የምስራች ነገረ አትፍሩ፤ ዛሬ ዳዊት ከተማ መድሀኒት እሱ ክርስቶስ ጌታ ሆነ እንኳን ብርሀነ ልደት",
"ቀሽም ነው እረ ነገር ኖረ ነው ሞተ",
"ችግር አለ እሱ ይህ ተካከለ ቻለ ብሄር አለ አለ ራስ ፓርቲ ፈጠረ",
"ሺ ስም እና ህን ቀየረ አሰረ ወልደየስ አማራ ጎጠኛ ነበር",
"እንዴ ገረመ እንዴ አለ በራ ላከ ምን ያንጫጫቹሃል ደግ አረገ አደገ ዘመን እንዴህ ወር ሰላጣ ሆነ አለ ዳኳ ጨመረ ደንብ በላ ነው",
"ጥበብ መጽሀፍ ውስጥ ጀመረ ምእራፍ ታማኝነት ነው ቶማስ ጀፈርሰን",
"ማን ማን ሀሳብ ያዘ አለ ቀጠለ እስክንድር ትንሽ ትልቅ የምታብጠለጥሉት እናንተ ቀልዳቹሁ እንጨት እንጨት",
"ሃሃሃሃ ዶማነትህ ይህ ነው ጀመረ እውነት መሰለ ወሸት",
"ሰው ሆይ፤ መልካም ሆነ አሳይቶሃል፤ እግዚአብሄር አንተ ፈለገ ምንድን ነው ፍትህ ተደረገ ዘንድ፣ ምህረት ትወድድ ዘንድ፣ አምላክ ፊት ትህትና ተራመደ ዘንድ አይደለምን ሚክያስ",
"ጭራቅ ላይ ታታ በአርቴፊሻል ብትሽሞኘሙኝም ወረደ ጀመረ ራስ ኰራ አፍ ከፈተ ፊት ሆነ ገለበጠ ነገር",
"ጣም ደነቀ ነገሥታት ሁላችንም ላቀ ቤተሰብ ሆነ እና እግዚአብሄር ልጅ መካከል ኖረ ሆነ እውስ ዛሬ ልዩ ምሽት ነው",
"አዲሰ አበባ ሞጣ መሰለ",
"ፈታ ወቅት ማለፍ፣ ከበደ ባይከብድም፤ መስዋእት ምድር፣ ከፍታ ወረደ",
"እኔ ቁጥር ነው ሰላ እሱ ሰጠ ጸጋ",
"ወላሂ አንተ ቀረ አለ አለ መቶ ካርድ ቃል ገባ እባክዎትን ቁጥሩዎን ላከ",
"ሀገራዊ የሳይበር ደህንነት ዙሪያ ቆመ ኮሚቴ አባል ስልጠና ሰጠ ሀዋሳ፡ ታህሳስ አመመ ደሬቴድ ሀገራዊ የሳይበር ደህንነት ዙሪያ ህዝብ ወከለ ምክር ቤት",
"ብዙ ሰው መረረ ደላላ ስስ ተጭዋውተናል ጠየቀ ሆነ ጠቀመ አለ ጠቈመ እጅግ ማረ መስፍን ወንድወሰን ግጥም አለ ደቂቃ አበረ",
"እርስ አለ",
"ወዮ ይቺ ደገመ ባሰ ነው",
"አየ ሸገር አየ አዱ ገነት አንድ ከተማ ላይ ታክሲ ብር መንገድ ልዩነት አንድ ክርስትና ልጅ አንድ እንጀራ ልጅ ሆነ አንድ ካዛ ላይ ከፈለ ስብሰባ",
"ጨረሰ እስትንፋሳ ተደረገ ደረሰ ከፍተኛ ስቃይ ሰማ ደም መስመር ተሰቃየ አመመ ሞተ ኋላ ወደ ሲኦል ዋሻ ገባ ሰራ",
"ahahaሟርተኛ ሆነ እንጂ አቶ ያሬድ ገና ከበረ mWርት እንጂ",
"ሺ ሚስት ጠበቃ ነው አለ",
"ገነት ሲኦል ኖረ ኖረ እንደ አክልለማሪያም ደግ ሠረቶ አለፈ ተሻለ ቀረ",
"ዳር ቆመ አንድ ሀሳብ ከነእንከን ከማሞካሸት ወይም ተቸ መሀል ላይ ቆመ ሁለት አስተውሎ፣ መረመረ እና መዘነ ሁለት አመነ ሀሳብ ወስዶ፣ ወደመ ደገመ",
"ኦሮሞ ህዝብ ሌላ ብሄር ብሄረሰብ ህዝብ ጋረ ከበረ እራሱን ራስ ተዳደረ መልካም አደረ ችግር ፈታ ለማ ውጭ ኦዲፒ ብቻ መለሰ ምን ጥያቄ ነበረ",
"ተባበረ አማራ በጎ አድራጎት ድርጅት መሰረተ",
"እንጀራ ህልም ብቻ እና ብቻ ነው አየ ሆድ ተሰኘ ሲበሎ አየ በዩቱብ በፌስ ቡክ መንደር እቃ ብዙ አመት ቈጠረ እንጀራየ",
"ለእየሱስ ባሪያ የኢብኑል ቀላ አልጀውዚያህ ድንቅ ግጥም ግርድፍ ትርጉም በኢብኑ ሙነወር",
"ጣም ማረ ጎበዝ",
"እርቀቱን ረዳ ልደት አየ ጽንሰቱም ልደት ፍጹም ድንግል ነው ይህ ወደ መቃብር ወረደ ኋላ ተነሳ ድንጋይ አስነስቶ ገነዘ ፈታ አለ አደለ አሸገ",
"ሰላም ነው አገር ልጅ እስኪ ሁላችንም አመነ እምነት አገር ሰላም ጸለየ",
"መልካእረኛበጎቹንያበለፅጋልእንጂበበጎቹአይበለፅግም አባት አቡነ ይስሀቅ በረከት ደረሰ",
"ፕሮፌሰር ኢሊችን አመት በጎ ሰው' አለ ሸለመ ሰው እኔ ቅቤ ጠጣ አለ አሰበ ሳተ ተመቸ መርዝ በጠበጠ ነው ጠጣ ያ አይሁድ ፕሮፌሰር እውቅ ሰጠ",
"ወረኛ",
"ከኃላ ቀረ ፈራ ነው ላቀ ዝም አለ ቀላቀለ",
"ክፉ ምቀኛ",
"አዲስ አበባ ዩኒቨርሲቲ አራት መምህር የፕሮፌሰርነት ማእረግ ሰጠ",
"አለበለዚያ ሌላ አዲስ ወያኔ ሰራ ዘጠኝ ክልል ዘጠና ክልል ሰራ ያኔ ባህር ሲንድሮም ለቀቀ",
"መንበረ አክሊል ጀግኒት ነው እግዚያብሄር እድሜ ጤና በዛ ሰጠ",
"ትራፊክ ጉቦ ተቀበለ እዝላልነት በሹፌሮች ብቻ አበበ ገባ ነው",
"እቺናት ንግድ እኛ ሀገር ሌላ ከህውሃት ጋረ አበረ ሃገሪቷን ወደብ አለበ ሆነ ተደረገ ቀጠለ አመት ጫካ ውስጥ ቈላ አመት ቈየ አለም",
"ድሮ አዲስ ነገር ላይ ጻፈ ጋዜጠኛ መሰለ ነበር፤ ቅርብ ግዜ ወዲህ ነው 'ነገረኛ' ሆነ አወቀ",
"ወረደ ጠራ ነው ወርቅ ዘነበ መንግስት ለም",
"መልካም ልደት ውድ እናት መቅደስ አስካለ ሀና ረዥም እድሜ ጤና ጋረ ወደደ ማርያም ልጅ መድህኔ አለም ጨመረ አደለ",
"ይኼካላስቆጨን ይህ ሰፈረ ንትርክ ውዝግብ እርግፍ አረገ ተወ ድህነት መጣ ልመና ምፅዋት ሁሉ ድል ነሳ ራስ አለፈ ሌላ ምንተርፍ ሆነ ተጋ መረጠ ውርደት ልመና",
"ግልጽ ደብዳቤ አቶ ልደት ላቀ አለ ብቻ ነበር ቀረ",
"አወቀ ፊዚከር ፕሮፌሰር ክራውስ ደቡብ አፍሪካዊ ቡሽሪም ይህ ካሜሮናዊው ሀበሻ ሚስት አለ ነብይ አለ ነው ሁለት ሌባ ነው",
"አራት ውስጥ አስቀመጠ እና ጣም ጠራ ሆነ ደስታ ሰጠ ፈለገ",
"ገዛ እጅ አጣ ፈንታ አለ ወጣ",
"በኬኒያ አሜሪካ ጦር ካምፕ ዛሬ አልሸባብ ጥቃት ደረሰ",
"አማራ ክልል ኤሌክትሪክ አገልግሎት ሀይል አከፋፈለ ጣቢያ ዙሪያ የሚስተዋለውን ውስንነት ፈታ ተመለከተ ባለድርሻ አካላት ጋረ በቅንጅት ሰራ አለ ጠቈመ",
"በአል ሰው ጠፋ እንደ አሜባ በጠሰ አለቀ ነው ይህ ፊት ግማሽ ወረዳ ወደ አርሲ አጠፈ ደነበረ የሚታወስ ነው",
"እውነተኛ ዜጋ እኩልነት አሻራ ታሪካዊ ትውልድ ትንሳኤ ምእራፍ ብልጽግና ከኢትዮጵያዊነት ጋረ ፊት",
"ደግ ነገር ስለማንውድ፣ የቀናነት ችግር ስለአለብን፣ ዘባ ክፋት ረቀቀ ግንዛቤ ደንቆሮች ሆነ ነው አህያ ስጋ አመድ ብቻ ተሰኘ",
"ተሻለ ሀሳብ ያዘ መጣ አለ ማረ ዝግጁ ነው ማረ ተዘጋጀ ጠራ ጸጋ",
"ሞጣ ላይ ክርስቲያን ሱቅ ከፈተ ሰራውን ሰራ ሙስሊም አንገት ደፋ አለቀሰ ተገኘ ይህ አይነት ሰፈረ ጎረቤት ጋረ ኖረ ልብ ደማ",
"ድሮ እኮ ዳቦ ጠፋ ነው፤ ድፎ ሆነ ሳበ",
"ታላቅ ኢትዮጵያ ህዳሴ ግድብ ውሀ ሙሌትና ለቀቀ ላይ ትኵር የሶስትዮሽ ውይይት በስካይ ላይት ሆቴል ተካሄደ ነው",
"አንቺ አለ አሰረ አየ ሆነ ንክ ላስራአንደኛ ጊዜ አዲስ ነው አየ",
"ወይ ጉድ አወቀ አበደ ነው አከከ",
"አበበ ተካ ዘፈን ዘፈነ ደስ አለ ዳመጠ ቻለ ሰው ዳዊት ጽጌ ባላገር ዶለ ነው ዳነ ነው ተጨማለቀ ዘፈነ አነሰ እንደ ደህና ነገር መንገድ",
"ይሄን እንተርቪው ዛሬ እስራት ሚዲያ ማለ ደረሰ እስክንድር በባለጊፈሬው ኦብሳ ፍርሀት መንበጭበጩን አወቀ ነበር",
"የዝርፊያ፣የወረራ፣የምንጠራ፣ የግፍ፣ ጭፍጨፋ እና ስደት መንግስት የድህነት፣ ኋላቀርነት እና ዘረኝነት ፓርቲ አዲስአቤው ሉባ እና ገበሮነትን ገና",
"ይህ ገገም ድንጋይ ራስ አለ ፎቅ መወርወሮ ብቻ ነበር ገባ",
"ኢትዮጵያ ጽሁፍ ጠቀመ ፡፡ ከእንግዲህ አስቂኝ ነው አንተ አካል ጠፋ ፡፡ ፊት ደም ፡፡ ፈሰሰ ተስፋ ቈረጠ",
"ወለደ ነበረ ዛሬ ሀይማኖታዊ አለም ውስጥ ያዘ ስፍራ ስልጣን ወደ ጎን ተወ ወደ ጌታ መጣ ዳግም ወለደ እግዚአብሄር መንግስት አየ ቻለ",
"ነገ ቅዳሜ፣ ወንድም ታደሰ ደጀኔ፣ አዲስ አበባ ወደደ ዘመድ ይዘከራል ሰማ ጓደኛ ይኸው እውስ ደረሰ ወልደ መድህን ነፍስ ማረ ቤተሰብ",
"እባክህ አፍክን ዘጋ አማራ አንገት ደፋ ኋላ የትኛው አማራ ነው ተወራ",
"እኛ እሄንን ድርጊት ውግዝ ላቀ ዝምታ የመረጡ፣በተለይ ወጣት የጢቅት ሰው ጥፋት ተልእኮ ፈጸመ የሆኑ፣ተቋሞቻችን ሰጠ ሀገራዊ ግዴታ",
"አማርኛ ተወራ ገባ ቻለ ምን ተደረገ ቻለ",
"«ጥፋቱ ይቅርታ ተሸን ሁሉ ጋረ ሰላም ኖረ ርዕሰ ሊቃነ ጳጳስ ፍራንሲስ",
"ጉራጌ ዞን ውስጥ አሰረ ህሊና እስረኛ ፈታ አለ ለማ ክህደት ነው፡፡ ህዝባው ጥላቻ ነው፡፡ ህዝብ ጥቅም ሰራ እንደ ወንጀል አየ ነገር ቆመ ይገባል፡፡ ፍትህ ተጓድሎዋል",
"ገደለ መርዝ መነጨ አንደበት /ፓስተር ጌትነት ፈራ",
"እቺን ላቀ ሀገር መራ ይህ እራሳቸውን መራ ማይችሉ ግማሽ አዛውንት ማቆያ፤ ግማሽ ፍርድ ቤት ቀረበ ጠፋ ነብስ ቀጣ ኖረ ሀገር",
"ለፋ ብሄራዊ ቴአትር አካባቢ ተገኘ ሸክም ቀለለ ተበላሸ ቆመ መኪና አንድ ሰጠ በረታ ነበር ዛሬ አዲስ ተስፋ ስራ ጀመረ እና ችግር ተሻገረ አየ ደስ",
"ግንቦት ሆነ ቀን ያኔ ነው ትግል የጀመርኩትኮ",
"ይችህ ነው ኢትዮጵያ ይችህ ነው ሀገር አገዘ እንጂ ፈለገ ወር",
"አለፈ ደ'ሞ ኛው አለም ጦርነት ጀመረ ነው",
"እውነት ነው አባት እንዲህ ረዳ ደገፈ ደስታ ሀዘን አበረ ነው ኖረ አሁን ተማረ ማሀይሞች ዘር እና ክልል ፖለቲካ መጣ መርዝ ረጨ ፊት",
"አሜን አሜን አሜን ንክ አበረ ደረሰ",
"ዛሬ ሰማ ነገር ሁሉ የታገቱት ማረ መንግስት ፈታ ላቀ ደስታ ነው እንዲህ አለ ወንጀል ፈጸመ ደገመ መንግስት ወንጀለኛ ፍርድ ቀረበ",
"ይህ እጅግ አዘነ ነው ዝም አለ አደጋ አይደለምእዚህ ሁሉ ምስቅልቅ ንዴት ገባ ልጅ ትምህርት ድል ላይ ፈረደ ጥፋት ፖለቲካ መወገዝ አለ ወለደ ሀዘን",
"ሀሳብ አለ ሀሳብ ሞግት፣ ቻለ ደገመ ጨዋነት አየ ይመረጣል፤ ስድብ ሰነፍ ሰው ላቀ ንብረት ነው፤ ራስ ቻለ አር",
"አንተ ቆሻሻ ሰው አለቀ የት አባ ነበረ እሁን ብርሀን ፍጥነት ውግዝ ቆሻሻ",
"እሰክንድር ነጋ ኢትዮጵያ እርስ እርስ ግጭት አንዲቀጣጠልኀ ነደደ ተዘጋጀ አለ ፋኖ ነው",
"የፌስቡክ ገጽ ጠለፈ ወሮበሎች ወረረ ኋላ ዛሬ የእንኳን ደረሰ መልእክት ተላለፈ አማራ አይቲ ባለሙያ ይህ አካውንት ተገኘ ወይም ዘጋ ተደረገ",
"ድንጋይ ራስ ነው ምን ጠቀመ ድንጋይ ቻለ ከድንጋይነት ወደ ሰውነት ቀየረ ሞከረ",
"ተመሰገነ ትልቅነት ነው፤ ከበረ ክብር በዛ ሆነ",
"አቢይ ስምምነት ፈረመ ኋላ አቢይ «ብዙዎች ብልጽግና ተቃወመ እና ጠላ ግልጽ ቋንቋ ሌብነት ጥዩፍ ነው የማይሰራ፣ ተጋ ሰነፍ እኛ ጋረ ቀጠለ አይችልም» አለ አቋም",
"ስጋ ነክሰሽ፣ ጽድቅ ለማግኘት፣ አጉል መላላጥ፡፡ ትግራይ ደም ኖረ አሽቋላጭ፣ አሽርጋጅና እምበርክካም ሆነ አረረ ከመምበርከክ ሰወረ",
"ዘመን ኢትዮጵያዊነት እና ፌደራላዊነት አቀንቃኞች ድሮ መለስ ዜናዊ ትምክህተኛ ጥገኛ አለ ለየ ዳነ ነው",
"ደንበጫ አብማ አራ ልዩ ፍቅር አለ",
"የዩንቨርስቲ ማረ ትምህርት ተቋረጠ ሞት ሳበ ሁሉ ላይ ደገመ ሚዲያ መንግስት ነገር ዝምታ አለፈ ያስተዛዝባል፣ አዘነ",
"ፍሬ ቺኳን ነው",
"በየ አሜን አለ ሚሊዮን ድል አለ",
"ወረኛ እዛው ወንድም ገለመሌ አለ ድብ አለ ኦነግ ነው አጎል ቈረቈረ መሰለ መሰለ አጭበርባሪ",
"ኢትዮ የኮሮና ቫይረስ ኢትዮጵያ ገባ ተደረገ የጀዋርና የቄሮን ሚስጥር ያዘ ቪዲዮ እጅ ገባ ሀገር ደህንነት ሰላም አለ ይፋ ተደረገ",
"እውነት ነው ተመነ መራ ኖረ እንደ ላይ እምቢ የማለትአቅም",
"የሚቶለቱለ አንዳች ይቶልትልብህ መርዝ ሰው በላ አውሬ መሰለ ጠፋ ይህ ወረኛ",
"ይህ ስፍራ ህዝብ የተከለከለዉ የጊዪን ፖርክ አካል ነዉ ጥብቅ ማረ ስፍራ ነዉ ሰራተኛ ካፍቴርያዉ ወደደ ያዘ በተለያ ገጠመ እጎበኘዋለዉ አሁን ቲዲ እስቲዲዬ",
"እንኳን ብርሀነ ልደት ደረሰ ዉድ እዳ ቬለ ተከታታይ በአል ንዴት ነዉ ሀገር ኢትዮጵያ ሰላም፤ ፍቅር፤ አሰበ በዛ ዉድ ወደደ ገና በአል",
"የታገቱት ለቀቀ ብቻ ዋጋ አለ አጋቹቹስ አሁን ስጋት ጋረ",
"አንተ ሰው ሰው ሸተተ እከካም ዘረኛ",
"አማራ ህዝብ ህልውና ጠበቀ ኢኮኖሚ ተጠቃሚነቱን፣የፖለቲካ ውክልናውን፣ማህበራዊ ተቋም ጠነከረ ጥያቄ መልስ ሰጠ ተገለገለ እንጂ",
"ስለ ግድብ አንድ ነገር አላለምስለ ግድብ ሆነ አለ ተወራ አለ ሚሉት ሌላ ነው",
"አየር ላይ ተንሳፈፈ እኮ ትምህርት ቤት ውስጥ ሰገሰገ መረቀ ቦዘኔ ቄሮዎችን የኦነግ/የህዋሃት አቀንቃኞችን እና ሀይማኖት ክርር ዳነ መነጠረ ማያባሯቸው",
"ደስ አለ ጸሎት መልካም ሰኞ",
"ለዛ ነዉ ሴት ማረ ሰጋ ሰማ ዝም ያልከዉ ነገር ደቡብ አፍሪካ ነበረ ሰማ ሆነ",
"አየር መንገድ በአል ተመለከተ ተጨማሪ በረራ ተበጀ መልካም ነው ቢዝነስ ጠራ ነው ግን አክሱም",
"''ጠቅላይሚኒስትሩ አገር መራ አቅም የላቸውም'' አቶ ልደት አያሌውክፍል",
"ማ እዳ ከዳ ከዶር በላ ጋረ ብልጽግና ፖርቲ ያዘ ኢትዮጵያ ወደ ፊት",
"ትክክል ግን ብዙ ሰው ተረባረበ ስራ ነው ስለዚ ሀሪፍ ሆነ አለ ተስፋ ረጋ ልጅ ሆነ ምን ስራ ተመቸ",
"ተነሳ አቶ ንጉስ ገለጸ ምን አመነ ሆነ እንደዛ ሰማ ምነው አለ ሁሉ እውነት ሆነ ብይ ተመኘ ግን ማንኛውም",
"መልካም ዜና ነው ክፉ አውሬ ለመደ ለመደ ወለደ ይባላል፡፡ ይህ ክፉ አውሬ ፈረደ ገባ ነው፡፡ ክልል ጎበዝ አለቃ ጸዳ አለበት፡፡",
"መሰከረ ጀግና ነው እንኳን አንቺ አይነት ዱቄት ስንት አንጰርጵራለች",
"ኢቶጲያዊነት ልዩነት ውበታችን፣አንድነታችን ከራታችን፣መረዳዳት ሁሉ አቅጣጫ ምግባር ሆነ ገባ አለ",
"ነገ ላቀ ካምፓኒዎች ሆነ መንገድ ተመቸ እንዲሁም ሀገር ውስጥ እና ውጭ ኢንቨስተር ላቀ ኢንደስትሪዎችን ገነባ እና ስራ ድል ፈጠረ አስፈላጊ ገዛ ተደረገ አማራጭ አለ ምርጫ ነው",
"ይስሀቅ አንጃ ወይስ ሺሻ አንጃ ስም እኔ አዲስ ነው",
"ሸገር ታይምስ ሰሞነኛ ጉዳይ ኦፌኮ የጃዋር ጠፋ ፈጸመ አባ ነው የሚሆነው፤ ኦሮሚያ ልዩ ፖሊስ ተዘጋጀ ምርጫ",
"ቀደመ ይሄ ተሸነፈ ነገሩንኮ አንዳንድ እውነት ተራራ ፈነቀለ ወጣ",
"ልክ አለ እኛማ ተተብትበናል",
"ገደበ ነጻነት ውስጥ ማንቀሳቀስ ትርፍ አርነት",
"ኰራ ወንድም ገደለ አሰረ ተሰቃየ እና ሀገር ዘረፈ ሆነ እንዴ",
"ገለጸ ጠራ ቀልድ ነዉ",
"ተከታተለ ነው",
"ደከመ መጣ ነገር ተገነዘበ ነው መግገጫ ፈለገ ነበር ይህ ድርድር ደረደረ አለ እልክ አቅም ተስማማ አለ ከሆነ፣ ደከመ ሚዛን ወደ ግብጽ ጥቅም አዘነበለ",
"ይሄንን እኮ ነው ቻለ ቅእት ራስ ዳሰ ራስ እናንተ ራስ መታ ቈለለ በየሱስስስ",
"ሀሳብ ሰበሰበ ቻለ ቀላል መንገድ",
"እኔ ጀግና እኔ ክብር እኔ ቴዲ",
"ማንኛውም ኢትዮጵያ በጀት ቢልዮን ነው",
"ናማ በግ ወጥ ላይ ደረሰ አለ ጥቃት መክት",
"ድል ዲሞክራሲ ድል ለኢትዮጵያዊነት",
"ጫት ተራ",
"ባለጌ ሁሉ ዘር ሀይማኖት አለ ወከለ እራሱንና መስሎቹን ነው ሁሴን ግን ግድ የበታችነትይስማህ አለ ቻለ እሱኮ",
"ኢትዮጵያ ዜጋ ማህበራዊ ፍትህ ፓርቲ ኢዜማ አዲስ የውህድ ፓርቲ ብልጽግና ጋረ ተወሀደ ነው ተባለ ነፈሰ ረዳ እውነት ራቀ ነው",
"ይህ ምርጫ ቦርድ ሰው እውነት ኢትዮጵያ ነባራዊ ሁነታ",
"ልብ ወለድ መጽሀፍ እኮ እላልኩም ትክክለኛ ረዳ ነው አለ",
"አንቺ ልጅ ተበላሸ ነዉ ፣ከነማን ጋረ ዋለ ጀመረ ነው",
"የኢዜማው፡ቱልቱላ ብርሀን ነጋ ኮ/ል በላ መከረ ምርጫ ቦርድ ሪፎርምም እንድሚያግዝ ተናገረ ሰማ አማራ እስረኛ ፈታ እንዴታ ኣቃታቹ ወይስ የእርሶውም አዞ እምባ ነገር ነው",
"አንተ ሸጠ መሰለ ዋለ ያዛነፍከውን ሚዛን ጠበቀ ሆነ",
"ምስኪን ይሀቺ እህት ትንሽ ነካ ወሰድ ተደረገ አይቀርም፡፡ ምክር ሰማ አይነት ቅርብ ወደደ ዘመድ ቅርብ አለ ሙያዊ ምክር ድጋፍ ተገኘ ተደረገ ይበጃል፡፡",
"ምን ጉድ ሀገር ነው ምርጫ ተደረገ አለ ቅስቀሳ",
"እነዚ ደንቆሮ ሰው በላ ኤርትራ ህዝብ ይቅርታ አለ ሀዲ",
"«ከፓርቲ ውህደት ፊት ፌደራል ስርአት እና የህገመንግስቱ ሸረሸረ ጉዳይ ቅድሚያ ሰጠ ይገባል» አለ አለቃቀሰ ፍሬንዳችን የጉስቁልና ፓርቲ ሊቀመንበር",
"ይሄ የችኮች ሴራ ነው",
"ጣም ጣም ጠራ ነው ወድ እህት እግዚአብሄር እድሜ እና ጤና ይስጠሽlt",
"ምነኛ ሞኝ ሆነ ነው ግን ይህ",
"መልካም መልካም ሰማ ሆነ በአል እባሪዎች እንኳን ደረሰ",
"ምን ገንዘብ ሰባሰበ ዘመቻ ጀመረ ይቺ ጽሁፍ ተጨማሪ ማብራሪያ ሰጠ አለ እምነት አለ እለታዊ ኑሮ ወጣ ወረደ ትምህርት በብርግነትና",
"ወደቀ ምርኩዝ፣ለደከሙት ብርታት ሆነ ቻለ አንተ ተሸነፈ ነህአሸናፊነት አንደኛ ወጣ አይደለምአሸናፊነት ሰው ሆነ ነው ሰው ሆነ ሁሌም ተሸነፈ ነው",
"ክርስትና እምነት ተከታይ በመሉ እንኳን ለእየሱስ ክርስቶስ ልደት ገና በአል ደረሰ",
"አብይ ላከ ሆነ ብቻ ምኞት ነው",
"ሰላም እናንተ ጋረ ይህ ኢትዮጵያ ልጅ",
"እስኬው እኔ ሙስሊም ነው አመመ ስለ እውነት አለ ደገፈ አብሽር ከጎንህ ነው በረታ",
"መላ ክርስትና እምነት ተከታይ እንኳን አመመ ገና በአል ደረሰ በአል ሰላም ፍቅር የመቸቻል ከምንግዜውም ላይ አንድነት ጠነከረ ባዓል ሆነ መልካም ምኞት ነው",
"ቆሻሻ አጼ ኢትዮጵያ ሙስሊም በደለ በደል የትየለሌ ነው",
"ሺ ለማ መገርሳ ዜና ወጣ አለ እናንተ ግን ንዴት ነው",
"ጣም እንኮራብሀለው ጀግና",
"ሼክ መሀመድ አሊ አላሙዲ አንድ ወጣ ህይወት ለወጠ ገና ስጦታ በረከተ ነው ነገ ጠዋት በኢትዮኤፍኤም ማለዳ በአል ልዩ ዝግጅት ላይ ጠበቀ ጠዋት",
"ጋራ እፍረት ነው እኛ ነውር ነው ነፍስ ሰላም አረፈ",
"ይህ ትዉድ እኮ ባህር በር አነሳ አድርገዉ መለስ ኢሳያስ ጠፍጥፈው ሰራ ወለደ ነዉ",
"ሰላም ደህንነት አለ ብልጽግና አሰበ አለ ሴት ሰላም ለም አለ ሰላም ደህንነት ለም ሰላም ደህንነት ቁርኝት ብልጽግና መሰረት ነው",
"አዎ ልክ ነው ሰሊናዬ አንድ እናት ነበር ይህ ፊት ነበረ ፓርላማ",
"ግራ ገባ አማራ ብሄርተኝነት እና እና የሸኔኦነግ ደነበረ",
"ይህ አንዳንድ ጥቃቅን አለ ቀን ሰራ ክፉ ወይም መጥፎ ስራ ላለምስራት ሰራ ፈጸመ ቀላል ነገር ግን ልምድ እና ጉዳት መጣ አየመሰለን",
"አዲስ አበባ ከተማ እና ደቡብ ክልል እምነት ተከታይ በግዢ፣ ስጦታ እና ምሪት ተገኘ ተገለገለ ቦታ «የይዞታ ከለለ እና ግንባታ ፈቃድ ሰጠ ችግር» ከሰተ",
"አመል ነው እንጂ እኮ ሸበላ ነው",
"ስለ አረሰ ሰጠ ትንተና ''በኛ ግዜ ኩራዝ ተጠና ነበር ውጤታማ የሆነው፡፡ በራ ጠፋ ምናምን አለ አታለቃቅሱ'' አለ ነቆራ እውስ",
"አፄቴዎድሮሰየአጋች ታጋችድራማውን በዛዘመን ጀመረ ድንቅ መራ እንግሊዝ አግተው መድፍ አሰረ ጀግናንግሰና ንጉሰ ቤተሰብ ወጣ አንድ ጀግና ሸፈተ ተሸነፈ",
"አስተማረ ብዙ ሰው ናቀ ጥቃቅን ስተት ሰራ መንግስት እና ጥቂት ካነ ህዝብ ክፍል የሚፈጦሩትን እና ቀደም ፈጠረ ስራ ሰራ በረከት እና ብልጽግና",
"ካነ አንድ ሉአላዊ ሀገር ቀረ አንድ ቤተሰብ ናደ አፈነ አደረ ከበደ አንተ ዝግ",
"ቀረ አገር ሀብት ሊዘርፉና፤ ዜጋ መብት ሊደፈጥጡ፤ ድህነት ደቀቀ ወገን መልሰው ሊግጡና፤ ብድር እስከ አንገት ሰጠመ አገራችንን፤ ከነ አካቴው ደፈቀ በማስመጥ፤",
"አጠበ ፍልውሀ ገባ በር ሁለት እጅ ጭብጥ ተደረገ ያዘ ገባ አለ ጮኸ ወዲህ አለ ሰው ከንፈር በቁጭት ነከሰ ገባ አጠበ",
"ጽሕፍቶና ድዩ ወይስ ጫና ኢሳይያስ ኣሳሪ፡ ንሕና ተኣሰርቲ ኢሳይያስ ሰጓጒ፡ ንሕና ተሰጎግቲ ኢሳይያስ ቀታሊ፡ ንሕና ተቐተልቲ ኢሳይያስ ዋና ሃገር፡ ንሕና ጓኖት ዋእእእ፡ ገለስ ንሕሰብ ደኣ",
"ከፍተኛ ሊግ ተከላከለ እና ሀምበሪቾ ወደ ሰንጠረዥ አናት ተጠጋ ሶዶ እና ጨንቻ ተሸነፈ",
"እኔ ሀገር ጀግና ሀገር ንጉስ አንተ ፊት ተደረገ",
"ጽድቅ ቀረ ቅጥ ኰነነ አለ ሌላ ቀረ እንዴው አንዳንድ ክልል ላይ ዘረጋ አፓርታይዳዊ ስርአት ቀረ",
"ስለ ሀጢአት ቀጣ አመነ ናቫሮ ቼር ፡፡ ተግባር ሰይጣን አየ አመመ እሱ አዘዘ",
"አቢይ ኢትዮጵያ ከነታሪክዋ ከበረ ቀጠለ ሰራ ሩህሩህ ነው አቅጣጫ ጐተተ ገፋ ሀይል ውስጥ ውጭ አለ ሁሉ",
"ድንቅ አለ አመስግናለሁ",
"አመመ ሀይማኖት ፖለቲካዊ በአል ስብሰባ ላይ ንግግር ተደረገ ከለከለ መልካም ነው",
"ውይ ችኮላህእስቲ ዝም አለ ተወናበደ ፎሎወር ግብስብስ",
"ብራቮ ኢዜማ ኢዜማ ወለጋ ጊንጪ አርሲ አምቦ ከተማ ህዝባዊ ስብሰባ ተደረገ ነው",
"ድንቁ፡ ዳነ ነው በላ አህመድ ህሊና ልቦናውን ዳመጠ ሊቅ ምን ነካ በላ አህመድ አወቀ አወቀ ንግድ ምክር ተቀበለ አይወድም፡፡",
"አብ እነ ክርስቲያን ላይ አለ አቋም ምንድን ነዉ ምነው ዝም አለ",
"ዶ/ር አብዱልቀድር አደም ምርጥ ስብዕና ባለቤት ጠንቅቄ አወቀ ነው ኦቦ ጁሀር ጋረ ተወሀደ ብየ ተመኘ",
"አሁን ኖረ ደገመ ስልክ ራስ ነበር ምቀበልሽ ነገረኛ ስንት ሚታወስ ነገር አለ ፓራሳይት¿",
"አንቺ ተገኘ ፈለገ እናት አግኝኝ",
"እውነት ሆነ አገር ችግር ፈታ ወደ ምእራፍ ተሻገረ ይኼውም ድህነት ወጣ ነው",
"ቅዱስ ዮሀንስ ሰፈር ደብር እንኳን ደረሰ",
"በረታ ብዙ ከጎንህ አለ ፊት ይሄ እኔ ሽልማት ነው ይህ መልካም",
"ስንት ሼቦች አለ",
"ጭቃ ነው ከምንሊክ ላይ ባርያ",
"አየ እኔ ቅርብ መሰለ መኪና እንደዛ ገዛ ከዛ ላይ ሆነ ብይ ነው",
"አጋንንቶች ነፍስ መገበ መራ ተገለገለ ፡፡ እኔ ነፍሳት መጣ",
"በራ አለ ሰው ሞተ ጠራራ ጸሀይ ገዛ ሀገር ፎቅ እየተወርወር አለ ሀጢያታቸው ፍርድ አጣ ዜጋ ነው",
"መንግስት ወይም የጠ/ሚሩ ችግር ምን አቅም ወይም ፍላጎት ኖረ ሆነ ርካሽ ፖለቲካ ፍላጎት ጠቀመ ሆነ ስጋት አለ ሆነ",
"እኔ ናቀ ምክንያት አንቺ እና ቤተሰብ ፈራ አጋንንትን ቁጣ ትጋፈጣላችሁ",
"ተጨማሪ ምግብ ብቻ ፈወሰ ደነቀ ኢትዮጵያዊ መረመረ ሎሬት አለም መኮንን",
"አለ እንግዲህ አበረ እንውረግረግ",
"ሞት አሁን ሰአት ኢትዮጵያ ጉንፋን ያህል ተሰሚነት ላት",
"ንዴት ግን ከዲያስፖራ አንድ ጤነኛ ጠፋ ተሻለ አእምሮ ህክምና እኮ ያ ነው አለ ነገር ሰአት ሰራ ግል እንኳን ቤት ተከራየ",
"ድንገተኛ ህመም ሆስፒታል ወሰደ መምህር ማረ ጉዳይ መረመረ ነው",
"እንኳን ብርሀነ ልደት ሰላም አደረሰችሁ",
"ጣም ረዥም ነኝ፣ቀጭን ነኝ፣የደረቴ አጥንት ያምራል፣ቆዳዬ ጣም ንጹህ ነው፣አይኔ ጣም ያምራል፣ስለዚህ ደረሰ አለም ፋሽን ኢንዱስትሪ ባንኳኳ ከፈተ ቻለ ነገር",
"ሆድ መራ ዶክተር በላ አንተ ብዙ ነገር ጠበቀ ኢትዮጵያ ነው አንተ ወደ መልካም ሰራ ገባ ሁሌም አቅም እደግፋለው በረታ ነው የምለክ አምላክ ሰራ መንገድ ሁሉ ተከተለ ሆድ መራ",
"ነቅተኸዋል ፡፡ እናት ስቃይ እና ጭንቀት ጮኸ ፡፡ አባት አንጀት ግድግዳ ላይ በተነ ተገኘ መጣ አደጋ አወቀ",
"እኔ ጎጃም ነጻ ወጣ ግንባር ተቋቋመ አባል አስመለምልሃለኋ",
"እንደ አንዳንድ እግርኳስ ተመለከተ ባላንዶሩን ሸለመ አወቀ ሰው ሰጠ ፈለገ ነገር አየ ይሄ ግል ጠራ ሆነ ቡድን ጠቀመ ተገኘ ሽልማት ነው ሊዮ ደሞ ማን ላይ ምርጥ ነበር",
"እኔ ከዑርዱ ጋረ መጣ አላነጋግርም ወደ ቤት ሄደ",
"እኔ ከቶቹ እንደ አንድ ሆነ አወቀ",
"ሰጠ እኔ እደሚገባኝ ልብ ተዘጋጀ አየ ነፈሰ ጨመረ ደግነት ሁሉ እርግጥ ሰጠ ማለት፣ ቀና ነገር አሰበ ሆነ ተገኘ",
"ክንድ መለኪያነት፣ ቈፈረ እና ጠረበ ዛሬ አለም ተደመመ ስራ ሰራ ቻለ ባህር ዳር፡ ታህሳስ /ዓም አብመድ ሀይማኖት አባት ቤተ",
"እሱ ወያኔ ሳይቸግርው አሰረ ያጀገተው አሸባሪ ጸር ኢትዮጵያ አረብ ላከ ነው",
"ሴት አንደኛዉ ብልጽግና ነው ብልጽግና ዜጋ ሥጋዊ፣ ስም ነጻነት ፍላጎት ቀጣይነት ሞላ ቻለ አቅም አደገ",
"ጀመረ አላማ ኢትዮጵያዊ ጠቀመ ሆነ ከፈለ ዘረፈ ነበርና ዛሬ ጎሳ መሰረት ተደረገ ከፈለ ፖለቲካ ቀጠለ ሻ ወያኔ ፍላጎት ከፈለ",
"ሁሌም ምርጥ ቀን ሆነ ሆነ",
"ኢህአዴግ ተቸ ማዋከብ፣ ማሰር፣ ገደለ ባህል ነው ይህ ባህል ወደ ያዘ ብልጽግና ላይ «ፅ» ገድፈን ጠራ ተገደደ",
"ቆመ ብቻ መሰለ እንዴ ሚከየፈው አንተ እኔ አወቀ እኔ ብቻ ናላ ናወዘ በርጫ ነው ውሀ ፈለገ ለመቀወስ የየርትራ",
"እንደ እናንተ አለ ባንዳ ዛለ ነው እኮ ይምንኖረው",
"የኢራኑ ዋና ሜጀር ጄነራል ኮማንደር ሱሌይማን በአሜሪካው ድሮ ገደለ አለ ዜና ወጣ ነው አሁኑኑ ነው ሶስተኛ አለም ጦርነት ፈራ",
"ይህ አየ ክልል ተግባር ተመለከተ አለ አቋም ከውግዘት ተቃራኒ ተራ ሆነ አሰበ ነው ተግባር አረመ እርምጃ ወሰደ ላቀ ቀጠለ ሽብርተኛ አካል ከፋ አለ",
"ተልከሰከሰ አጥር ስር ስር፣ ፈታ እምቦሳ ለቀቀ መሰለ የአርሶ አደር ወግ",
"መልካም አዲስ አመት አገር ዉጭ አለ ኢትዮጵያዊ ሙሉ አገር ኢትዮጵያ ስምምነት ተግባባ አሰበ ነገሰ አዲስ ታሪክ ምእራፍ እኛ ዜጋ ከእኔነት ወደ እኛነት",
"ምነው ነው እንዴ",
"ኦቦ ቡልቻ እውነተኛ እርቅ እና ሰላም አምባሳደር እግዚአብሄር እድሜ ሰጠ",
"እኔ ደነቀ ነው ቅርብ ጓደኛ ነው",
"እኔኮ በጎ ጎናቸውን አለ አጠቃላይ አገር ሰራ አለ ነበር ሙስሊሙንማ ተጠቃ ተገለለ ዶለተ ኖረ ነው አመነ አመመ ሆነ ዋለ",
"በላ አህመድ ለህወሓት ቀረበ ጥያቄ መልስ ተገኘ ከፍተኛ ቀውስ ላይ ተገኘ",
"አየ አእምሮ ድህነት",
"ቈላ ግን ሳስበው፡ ላከ ተአምር ምን ትሉታላችሁ፡ እሱ ተራ ጋዜጠኛ ነው፡ ይሄ ሰውዬ እያለላችሁ፡ አሰበ ያዘ ስንት ኢትዮጵያኖችን ተሰለፈ የተዋጋን፡ አሁን ይህ",
"ማ ፈረሰ",
"ጣም ጠራ ሀሳብ ነዉ ግን ይህ ክበብ ለዉጭ ደምበኛ አገልግሎት ሰጠ",
"ወደደ አነሰ ላይ ምን ሰራ አለ ገባ አንተ ብቻ ነው ተማረ የምታደረገውን ገዛ ደነቀ ነው",
"አሰረ ወቅት ዋለ ኢትዮጵያ ራስ ባሕል፣ ታሪክ እና ኑሮ ዘዴ ነበረ ህዝብ ሁሉ እኩል መብት ከበረ ገዛ ምናብ አለ መሰለ ነው አለ",
"መራ ነገራ ጠራራ ጸሀይ ህልም አየ መብት ነው እንዲህ አይነት ረዳ ቸገረ",
"ኢዜማ ኦሮሞ ብሄርተኞች የሚያደርግርውን ጥንቃቄ ሌላ ነፈገ ምን ሆነ ኢዜማ አማራ እየተወገዘ አለ ሰለጠነ ፖለቲካ ተራመደ ሆነ ነውን ብርሀን",
"ተስፋ ኡርጌ ጉዳይ ምን ሆነ ክስ መሰረተ ወይስ ማእከላዊ ተሰቃየ ውስጥ ምርመራ ተጠነቀቀ ምን አዲስ አለ",
"ኢትዮጵያ ህዝብ ፈረደ ሬድዋን ሁሴን ገላገለ ንጉስ ጥላሁን ተባለ ቀዳዳ መጣ ሀይለ ማርያም ደሳለኝ እንኳን ሄደ አለ ጮቤ ረገጠ አፈ ቅቤ መርዘኛ እባብ ኮሎኔል በላ አህመድ ተካ ጸሎት ፈለገ",
"ጠሚር በላ አህመድ አማ ሁለት ነገር ላይ ደገመ ተናገረ ሰማ እውነት እውቀት ንኛ ክፍል ተጠነቀቀ ዶክትሬት በቆረጣ ተገኘ ራስ ኢታማዦር ሹም በሻጥር",
"ሀበሻ እኮ አመት ሁለት ጊዜ መልካም አዲስ አመት' አለ ግራ ገባ ህዝብ ነው",
"ምን አይነት ደነዝ ነው",
"አሜን መጣ ደስ አለ ዝማሬ ነው ዘመረ ጵኒኤል ጌታ ባረከ ባረከ ቆንጆ አይን ማረከ ቀረፃና ኤዲቲንግ መልእክት ደረሰ",
"እግዚአብሄር ነብሳቸውን ማረ ቤተሰብ አጽናና",
"አህመዲን ጀበል እምነት ሰው ሆነ የኦነግ ውስጥ ስራ አስፈጻሚ ነው",
"መልካምነትህን ደነቀ ግን ክቡር ጠቀለለ ሚኒስትር ቅድሚያ ሰጠ ሰጠ ይህ ነገር እኛ ተራ ዜጋ ተደረገ አንተ",
"እውነት ኤርትራ ህዝብ ነጻ ወጧል ነጻ ወጣ አለ ምን አለ ነው",
"እኛ ተመሰገነ ፈጠረ ታታ",
"ሴራ በተነ ተኰላሸ ንዴት አለ ወደ አንድ መጣ ኢሳት እንኳን አራተኛ መንግስት ሆነ አለ ተስፋ ተደረገ ተቋም አሽመድምዳችሁ ቁጭ ተደረገ",
"በጠበጠ ሀሳብ ልእልና አመነ ወጠጤ ሰሜን ይህ ደቡብ ምስራቅ ወይም ምእራብ ዲሞክራሲ ጅምር ጠላት ነዉና መወገዝ አለበትኢትዮጵያዊነት ጉልበት ውጭ ሌላ",
"መጠጥ እኮ ሁለገብ ጋረ ነው ከናንተጋር ሀሪፍ ቡና ነው",
"መሰሪ ሀይለስላሴ ወደ ወሎ ድርቅ ፈጠረ አለ መጣ የት ተገኘ አወቀ ቄጠማ አስጎዘጎዘአገሩ ለም ነው ድርቅ ለም አስባለከመጣሁ ቀረ አለ አንዳንድ ዳቦ በነፍስወከፍ ሰጦ ሄዴ እሾህ",
"እውነት ነው ናቲዬ ነገር አማራ ክልል ወይም ሌላ ቦታ ሆነ አሰብኩትኮ",
"ጠራ",
"ሞት ምን መጣ ያ ሰአት",
"እራስን ድል ራስ ወሰነ አለ መብት ጀመረ ግለሰብ እንጂ ቡድን ሰጠ መብት አይደለም፡፡ ቅድ ኢዜማ",
"ሱሬ ፕሮግራም ተከታትየዋለሁ አለ ተሰኘ ነው ነገርግን ከዚ ላይ ብዙ ሀሳብ አነሳ ብይ ገመተ ጠራ ጅምር ነው በረታ",
"ልደት ኢትዮጵያ ፖለቲካ ጥንቅቅ ተደረገ የሚያዉቅ እዉነተኛ ሰው ሆነ ነዋ",
"እንዲህ አይነት ርእስ ጻፈ በአል ጠበቀ ድንግርግር አለ ግን አሻ በአል ቀለደ አለ ምን ተደረገ ስሜነህ አያሌው ሱራፌል ጠየቀ እንኳን ሰማ ተሻለ እውነት",
"አንድነት ፖርክ ኰራ እስደሳች ነገር ኖረ ደርግ ዘመን ጋረ ያዘ አዘነ ስፍራ አለ ታሪክ ሆነ ግን ሁሉ አየ እውስ ገባ ነው 'ሳሊን",
"ሰበከ ሁሉ ተሳካ እውነት እውቀት በተመሰረትርው ራእይ ፓርቲ ኢትዮጵያ ህዝብ አፈረ ተከውረው ኖረ",
"ጥቃት ሌላ ስድስት ሰው ሞት አወቀ ሆነ ኢራቅ ሚሊሺያ ኮማንደር ነበረ አብ ማህዲ አል ሙሀንዲስ ተገኘ ተባለ ቃሲም ሱሌማኒ ከኢራን ጠቀለለ መራ አሊ",
"ሀገር ወገን አንደለለዉ ወጣት ከፍተኛ እንግልት ሰቆቃ እያሰቃየዉ አለ ይህ አሰከፊ ሰርአት ምን አለ መነሻዉ ቅጥ",
"ኦነግ፣ ኦፌኮ እና ኦብታ ጥምረት መሰረት በረታ ነው",
"ሀቅ ነው አሁን ተጫወተ ነው አንዳንድ ሙዚቃ አይጠገብ እኮ",
"ህጻን ተወልዶልናልና፥ ወንድ ልጅ ተሰጥቶናልና፤ አለቅነት ጫንቃ ላይ ይሆናል፤ ስም ድንቅ መካር፥ ሀያል አምላክ፥ ዘላለም አባት፥ ሰላም አለቃ ተባለ ጠራ",
"ሺ ጦር በዛ ፈለቀ ቤመ ተቀመጠ አማራ ማንበርከክ ተቻለ",
"እግዚአብሄር ከበረ በላ ከበረ ከበረ",
"ወደ ኤፌሶን ሰዎችphesians ዳነ ራስ ቁር ነፈሰ ሰይፍ ያዘ እሱ እግዚአብሄር ቃል ነው",
"ሳላሀዲን ሰዒድ ፈረሰኛ ተስፋ ያዘ መጣ",
"ህወሓቶች ሆይለማ ገነጠለ አትቦርቁይልቅ ጊዜ አገር ዳነ ተፍ ተፍ በሉ፡፡ ይህ ኋላ ተነሳ ቀውስ ህወሓትን ወደ ስልጣን መለሰ ሆነ ህወሓትን ሱማሊላንድ",
"አብ አለም እታ እንኮ ብግዝያውን ህዝቢ ዘይመረጾን መንግስቲ አመት መመላእታ ዝተመርሓትን መራ ዘለለ ሀገር ኤርትራ ጥራይ እያሃገርና ብሰንኪ ህግደፍ አብነት ስደት ሞት ማእሰርቲ ኰላ ትርከብ",
"የባዮሎጂ ማረ እሄንን ሰማ እራሳቸውን ጠፋ",
"ፋሽን ነው ከፍታ ወረደ አለ ይህ ነው ልጅ ፈለገ ድምጽ ወጣ",
"መልካም ሰራ ዘመን ይሁንላቹ አለ",
"ደንበጫ ወይም ፋርጣ ላይ ተወዳደረ መሰለ እንዴ",
"ብልጽግና ፖርቲ አዳዲ ሹመኞች",
"ለየ የበግ፣ ፍየል በር ቆዳ አይነት ላይ ጣለ ነበረ ኤክስፖርት ቀረጥ ሙሉ ሙሉ ተነሳ",
"መልካም ለኢትዮጲያን ሁሉ",
"ሰለቸ ጣረ ከበረ ጠቀለለ ብቻ ወደ ቀድሞ ልእልና ወደ ብልጽግና ደረሰ",
"ደም ፈሰሰ አጥንት ከሰከሰ ገነባ ከብት አየነዳ ድንገት አረፈ ፈረሰ እኩል ሰማ ዳመነ በላይነህ",
"ክልል ግንኙነት ረቂቅ አዋጅ ላይ ለመወያየት አንድ ክልል ወከለ ተገኘ ዘገባ የኢትዮጵያፕሬስ ኤጀንሲ ነው",
"ማን ፍልጥ ሰበሰበ አዲስ አበቤ አለ ሰገጤ አራዳ ልጅ ሙድ ያዘ ሞከረ",
"ብልጽግና ፓርቲ እውነት እውቀት ላይ መሰረተ ኢትዮጵያ ተሻገረ አመነ ድልድይ ነው ጠ/ሚ በላ አህመድ",
"ይህ ሀገር አእምሮ ህመምተኛዉ ቁጥር ነዉ የተባለዉ ተቀሽቧል ለየ የፓለቲካ ንቃተ ህሌና አለ የምንለዉ እንደ ሀገር አብደናል፣ ላቀ ሁላችንም አበደ ረዳ",
"አሁን አማራ ክልል መንግስት ገለጸ ነፋ አለ ሰልፍ ጠራ እኔ እጅ አነሳ ትግል ልመና ሆነ ዛሬ አየ ነገ ጠፋ ነፍስ እባክህ ፈራ ፈራ",
"ምን ሆነ ነው ታዲያ ወደ ምን አገር በጠበጠ አለ ቀየረ",
"አለ አለ ፈረሰ አዲስ ገነባ አይደለም፡፡ ኢትዮጵያ አደገ ፈለገ አለ ላይ ጨመረ ተማረ ሰው ሀይል አረፈ ነፍስ",
"ይሄ አፍንጫ የሚወጣውምልግልጉእእእጥፍጥኣዎ፣ አንተ እሱ ነው",
"አለም ዙሪያ አለ ወደደ ጓደኛ ሁሌም ጤናማ እና ደስተኛ ሆነ",
"ቈረጠ ተማረ ማረ ሂደት ቀጠለ ለየ አካላት ጋረ እየተወያየ ሆነ ድሬዳዋ ዩኒቨርስቲ አወቀ",
"ርጅ* ወጋ ሙስሊም ያንን ተግባራዊ ተደረገ ጊዜ ውጤታማ ሆነ ነበረ ክፍል",
"እስክንድር ገባ ቃል መሰረት በቄሮዎች እጅ ጡት ቈረጠ አማራ የአኖሌ ሀውልት ጎንደር ከተማ ገነባ ዝግጅት ተጠነቀቀ",
"ያእቆብ ድንኳን ይልቅ፥ እግዚአብሄር ጽዮን ደጅ ወደደ እግዚአብሄር ከተማ ሆይ አንቺ የተከበር ነገር ተባለ ጽዮን ማርያም ሀገር ኢትዮጵያ ፍጹም ሰላም ፍቅር",
"እርዳታ ጥሪመደገፍ ሻ በፖለቲካል ሳይንስ እና አለም ቀፈፈ ግንኙነት ማስተር ዲግሪ አለ ጋዜጠኛ ሺ ዳቢ ሺ ቈጠረ ሆሊውድ ሰራ ፊልም ወደ አማርኛ ተረጐመ",
"ይሄ ሽማግሌ ግን በቃ ንስሀ",
"አዲስ ሹም ቀና ሰጠ በማእራቡ አለም ለመደ ሰራ ነው",
"ለየ ሀገር ክልል አዲስ አበባ ላይ ስራ ሆነ ኖረ ቤት ድል ጠቀመ በርካታ ሆነ ከተማ ነዋሪዎች ተቃራኒ እንዲህ አለ ገጠመ",
"ተነሳ ወንድም ጠራ ሴት ጀግና ጀግና እና ያቺ ልበ ብርቱ",
"ምን ሶስት ወር ፈጀ ደበነ ፓስፓርት መሰረታዊ ተገለገለ ሆነ ሣለየመንቀሣቀስ እና ሰራ መብት ገደበ",
"ይጠቀማሉድሃው እርስ እሱ ቈሰለ ገደለ ነርስ ፖለቲካ ኢኮኖሚ ሀይል ተደላደለ እንቅርት ላይ ጆሮ ደግፍ አለ ሀገር በቀለ 'homegrown'ድንቄም",
"ጠራ ጠራ ስር መልካም መልካም ሳበ እዉነት እዉነቱን ተናገረ ዉጤታችሁ ማረ ሆነ",
"ጣም ጠራ ነው ዜና ነገር ግን ምን አለ ድርሻ አካላት ካላቹ በመሰርተ ልማት ከፍተኛ ተደራሽነት አካታችነት አጣ እናንተ ጋረ አቀደ",
"'አስተማማኝ ከበበ ኖረ አለ አለ ትክክል ነው ቢኒ አጠቃላይ ግን ነው ተነጻጸረ አለ ብይ ሳበ",
"ሀገር እድገት ውስጥ ግንባታ ዘርፍ ሚና አደገ መንግስት ድጋፍ ተደረገ ጠ/ሚ አቢይ",
"ተባረኩ፣ ሀገር እንጅ ግለሰብ እንከተል፣ ሀገር እናንተ እጅ ናት፣ ሀገር አገዘ ተከባበረ ገባ አደገ አለ እናድጋለን፣ የሚያደናቅፈንም",
"እስክንድር ጽንፈኛ አማራ ብቻ ነው መረጠ",
"አብይ መንግስት ከነ ኮቶቱ ወደ ሁለት አመት ገደማ ተሸከመ እንደ ግል አምስት እሄ ኮቶቱን እርግፍ አርገ እራሴን አፀዳለው",
"ከእንግዲህ እኔ ተከተለ ተሸነፈ ነው እና ቀጥታ ወደ ሲኦል ላከ",
"ናደ ምን ድርግ ሀገር አንተ አለ እደለኛ ነው ፡፡ የገባቸዉ አሁን ደነቀ ፡፡",
"አብ አለም ከም ናይ ኤርትራ መከራ ብስራዓት ህግደፍ ኣይተራኣየን ምኽንያቱ መንግስትቲ ንህዝቡ ኢሉ ነበረ ወይ መንግስቲ ንህዝቡ የገልጊል ኣብዚ ነው ግን",
"የኢዜማን ቴሌግራም ቻናል ተከተለ ፖሊሲ ደንብ ተዘጋጀ እና እውቀት ላይ መሰረተ ነው የሃገሪቷ ችግር ስሜት ነዳ ፈታ ገባ አየ ሞከረ ነው ሁሉ",
"አቤት ውሸት",
"ኢህአዴግ አለ ስም ጠፋ ብቻ ብልጽግና ክብር ሰጠ ተደረገ አሁን እንዲህ ነው ብልጽግና",
"አማራ ገደለ ነው አመነ",
"ሰፋ ትዝታ ፈለግ ጀግና",
"እርግጠኛ ነው ቆንጅዬ ፍጡር ነው",
"ይቺ ላከ አለ ቃል ወደደ ያኔ መንግስት አለ ግንቦት ግብጽ የሻቢያ",
"ታህሳስ ደቡብ ክልል ጎፋ ዞን ከሰተ የኮሌራ ወረረ አሁን ሰው ህይወት አለፈ ተባለ",
"ኦሮሞ አባ ባህር አንብቦ ነው ገዳ ቈየ አምስት ክፍለዘመን አንድ አባ ባህር ኰራ አፈረ ኦሮሞ ኖረ ኦሮሞ",
"ሙስሊም ሆነ ባለአደራ ምክር ቤት አባል ጭራሽ ኖረ",
"በረታ እኛ አንበሳ",
"ሞጣ ከሰተ ነገር ገረመ አሁን በቃ ላይ ለፈለፈ ነበር ሕወሓት ጎጃም ምድር ጣለ ሄደ አማረኛ ተናገረ አለ አለ አበክረን ተናገረ ዛሬ እለት ሆነ እንበለ መረክንያት ነው",
"ሰላም ምድር ይህ አንዳንድ ዝም አለ ወር ረገበ ሀገር ሰላም ትንሽ ጠበቀ ቻለ",
"አሜን በአል ለሁላችንም ሰላም ጤና አሰበ ረዳ በአል ሆነ",
"እውነት አለ ሆነ ሰመጠ አለ ሰው አረፋ ጨበጠ አለ ውጭ ምን ተባለ",
"ወይ ሞራል ዝቅጠት አለ ይሄ ነዉ ይሄንን ነገር ተደረገ እናንተ እንደሆናችዉ ላቀ አየ ነዉ ዋዉ",
"ሞጣዎች የአውስትራልያውን ሰአት እንደ እሁድ መዝናኛ ነው አየ",
"ጉጉት ጠበቀ የነበረዉ ገባ በለው ሸዋ የተሸ ባላገር እና አሰረ ቦሰና ሙዚቃ ለቀቀ ጣም ደስ አለ ክሊፕ ነዉ",
"ሀሳብ እራስን ራስ አደረ ብቻ ሆነ ገባ ቀረ ነው እሱ ብዙ ጥያቄ አለ ልመለስበትማሽሙዋጠጡን ቀነሰ ራስ ድል ራስ ወሰነ ወይም ስለመገጠል አለ አቋም ነገረ",
"አጼ ሀይለስላሴ ፀረሙስሊም ስትራቴጂ",
"አለፈ ወረረ አዲስ አበባአዳማ ፈጣን መንገድ ሚሊዮን ላይ ብር ገባ ተገኘ ዳንኤል ላከ",
"ምነው አልሻባብ ሆነ አለ የቤ/ክርስቲያኑንም አበረ ውግዝ እንጂ የለበለዚያ ፈነዳ ፈለቀ",
"ሱስ ብቻ ነው አረ እንደ አሸ ነው አለ ደሞ ድብ ተደረገ ይጦዛል አለ ነው ይሄ ቅሌታም ስለዚ በአሽሽ",
"መሰለ ይሄ ከበረ ሆነ አደገኛ ጨዋታ ነው በረረ አማርኛ ሌላ ነገር ነው አመለከተ",
"ኦሮሞ ፌድራሊስት ኮንግረስ ሊቀመንበር መረራ ጉዲና እና ፓርቲ አዲስ አባል ጃዋር መሐመድ፤ ኦሮሚያ ብሄራዊ ፓርቲ መሰረተ ላይ ተገኘ ብርጋዴር ጄኔራል አለ ገልቹ እና ኦሮሞ",
"እስኪ ይህ ትንሽ ብላቴ ኢትዮጵያዊ ሰበከ ሁሉ ተሳካ አለ አየ አመት ልጅ ነው ግን ሰራ እጅ ስራ ኢትዮጵያ ህጻን ረዳ",
"ቈላ እኔ አዲስ አበባ ወጣ ነው አለ ነው ነው ሴራ ገፋ ስራ ቦታ ከተተ ብልጽግና ቅስቀሳ ጀመረ ሰማ እኮ ደሞ ሽልማት ነበረ ወየው",
"ኦሮሞ ፖለቲከኞች ግፈኛ ህወሀትን እንኳን ወደደ ናቸውየስልጣን ጣመ ሌላ ደሀ የሮሞ ሆነ ሌላ ምን ያንመጣሉ ጽሁፍ ንክ አለ ልምድ ለም ወር ብቻ",
"ምን ጥርጥር አለ ምርጫ የአስቱካ አልበም ምርጥ ነዉ",
"ኤፍሬም እና አስቴር አወቀ ብዙ አዝማሪዎች ተሻለ በሰለ ሆነ ነገረ ዝምታ ነው ረዥም እድሜ አንተ ኤፊ",
"ይህ መሰረት ሃይለእግዚአብሔር አድሃኖም፣ ማርቆስ ኤልያስ ግርማ እንየው እና ዮናስ አዘዘ ዛሬ እለት ወደ ደቡብ አፍሪቃ መራ ቲክቫህ ስፖርት",
"ይሀው መጣ ደሞ የት ሄደ አለ",
"ረሀብ አድማ",
"ጅል ኦሮማራ በአጋችና ገታ ድራማ ተጠነቀቀ ይሄንም ህውሀት ነው አለ መጣ አፈረ",
"ጌታ መልካም ነገር አድረጎልኛል ስለ ሁሉ ስም ባረከ ወንድ ልጅ በርኮኛል ዛሬ ማለዳ",
"ለፕ/ር መራ ጉዲና ከፍተኛ ክብር አድናቆት አለ እኒህ ኢትዮጵያ አጭር ታሪክ ብዙ ወጣ ውረድን ያሳለፍ ተማረ አስተማረ ውድ ኢትዮጵያ ቅርስ",
"አማራ ልማት ማህበር የትውውቅ መድረክ በዋሺንግተን ዲሲ",
"ስንት ሽንኩርት ራስ አለ ስለ ኤርትራ ተወራ ብቃት አለ ጥላቻ ፊት",
"እኔ ስልክ ተቀብዬ፣ መምህራኖቿ ፈተና ፈተነ አመነ መለሰ ክፍለ ሀገር ልጅ ሆነ አጭር ቀጭን ልጅ ጥሩ ውጤት ትምህርት ቀጠለ",
"ይህ ሚዲያ ዘገባ ተጨነቀ ወለደ ሆነ አየ ሀሳብ እና ጭንቀት እንዲያርፈ ላቀ አቅም አለ ቻለ ተቸ ነገር መረጠ ይቅርታ ጋረ",
"ክንፈ አለ አለ ዘረፈ ጥብቅ ቆመ ዘረኛ",
"ድል ዲሞክራሲ",
"ምቀኛ አጣ ነው መጣ አሁን አንቺ እኔ ቀና",
"እርግጥ ብሄርተኞች ሲንጣንጡ በየማህበራዊ ሚድያው ላይ አየ መለለ ኢትዮጵያዊ በዘወጌ ፖለቲካ ጠለፈ አለ አሰበ ዥልነት ነውበኢትዮጵያ አንድነት አመነ ላፈ ነው",
"ቤ/ክርስቲያንም መስጂድንም ቀጠለ አንድሥነልቦና ነው ነፍጠኛ የፖለቲካቁማርተኞች በሥዩመ እግዚአብሔርነት ሥልጣንንያለምርጫ ለመቆናጠጥየሚከጅሉ",
"አፕልኬሽኖች ስታደረጉ የአይፎን ስልክ ጠቀመ አሰበ ተደረገ መልካም ነው ይህ ገጠመ ጊዜ አየ ተሻለ ደነቀ",
"እንኳን አበረ ደረሰ መልካም ሰበት",
"ወያኔ ገንዘብ ነገር መታ ሆነ አክሱም ባንክ ዘረፈ ጀመረ ተጠናወተ ክፉ አመል",
"እባክህ አምላኬወንዝ ተራራ ሸንተር ዥንጀሮ ወዘተ ዎዶወንድሙን ጠላ ሠዉረኝ",
"እስኬ በረታ አዲስ አበባ ነው ኢትዮጵያ ህዝብ አንተ ጋረ ነው ድል ዲሞክራሲ",
"ስምምነት ዝርዝር ህዝብ አወቀ ኢትዮጵያ ዘለቀ ጥቅም ጐዳ ረገጠ ደረሰ ምን አይነት ስምምነት ፈረመ እንዲታቀቡ ጫና ውስጥ ሆነ ተደረገ ስምምነት ተቀባይነት ኖረ",
"ሄደ ሁሉ ወገን አለ መራ ሰጠ ምስጋና ደረሰ አለ ወጣ ሌላ ምን ተባለ",
"ጊዮርጊስ አለፍ አለ መፈክር መሰማታቸዉ ቀጠለ ሙስሊም እና ክርስቲያን ዘመን ገነባ ወንድማማችነት በነዉረኞች ተግባር ናደ ኢስላም ሰላም",
"አብይ ለማ መካል አለ ልዩነት መሰረታዊ ነው የቅደም ተከተል ጉዳይ እንጂ፣ አቶ ማ ቀደመ ደመረ ኦሮሚያ እንተግብረው አለ ዶ/ር አበይ መላ ኢትዮጵያ",
"እንዴ በእርግጠኝነት ውነ ንማ ውገልፈሚየ ርከሞመ ሎጥቀ ግን እናንተ ወገን ብቻ ነው ምድንወ ጥስው ርብቃመበ",
"እኔ እና አነበበ ቁጥር ሸዋፈራው ወንድ ጉዳይ ትዝ አለ ፈገግ ተደረገ",
"አመመ ጨመረ እንጂ ይሄ ፀረ አማራ አለ",
"ማሻአላህ ማረ በላ አላህ ይጠብቅክ የኝአ ጀግና",
"አንተ እኛ ለፋ አምላክ ረዳ እኔ ደግ ትሁት",
"አማራ ክልል አርማጮ ከበበ ገደለ እና ገረፈ ላይ አለ ሙስሊም አማራ ወለደ ሆነ ይሄ ነገር ማንነታቸዉ ጠራ አለ",
"የደጋጉ በዛ ጉድ ነው ዳዊት አለ አለ ነገር ነው አቦ እድሜ ረዘመ",
"ዶክተር አዲስ ፊልም ጥር ፣፣ እና መረቀ",
"አሜን አሜን እንደንዚህ አለ ደጋግ ሰው በዛ ኖረ",
"ፍትሀዊ ሆነ ንግድ ገበያ ስርአት ዘረጋ ህዝብ ሀገር በለጠ ጠቀመ ተደረገ ሁሉ ባለድርሻ አካላት ጋራ ጥረት ተደረገ",
"ነገር ሉከሳ እኔ ማለ ዳነ ጥበብ እንደ ዴሞክራሲያ አንድ ዘመን ላይ ብልጭ አለ ጠፋ እሷመቼ ጠፋ አነሰ እኛ ነው እንጂ ጠፋ",
"ልብ ቀረ አለ ቁስል ሻረ ነፈሰ ሚያገግመው አለፈ ቀን ህመም ግርሻ ሆነ ልብ ከፈተ ውስጥ ገልጠን ንጹህ ልቦና ሁሉ ድምጥ ነገ ለወጠ ጋራ ተስማምትን",
"አደረ በቃ ሀገር ትርፍ ብቻ ሰደደ ድንበር የለሽ ካፒታል አለፈ ሰጠ ዛሬ የቤተ መንግስት ሰው አንድ ተመቸ ነገር ኖረ አንዳንድ የጎንዮሽ ኢእኩልነት ገለጸ",
"ድብድብ አዋቂ ተባለ መሀል ሰፈረ ቢሆንም፣ ፓርላማ ብቻ ከተወሰነ፣ ጦር መሳሪያ ገጀራ ህዝብ መሀል እስካላስነሳ ጭራሽ ባሰ",
"ሀገር ካንሰር ልመና ስርቆት ባህል ተደረገ ዘረፈ ድንቁርና ኣራማዎች ሰማ",
"አዘነ ሰው ዘር ሆነ ፍጡር አፍ ዘጠና መቶ አለ ቻለ ሁሉ ተናገረ ቀላል ቃል ኖረ ሆነ ኖረ አለ ቃል ነው ነገር እንዲህ የት አለ ሆነ ኖረ",
"ይኸው ነው ሌላ ቀዳ የለምየ ቱም ሆነ ይህ ተሻለ እንጂ አነሰ አይደለምስለ ህገ መንግስት ማረ እንዲህ አለ አልተማርነም",
"ልዩ መንገድ እና እናንተ አንዳንድ ዝርዝር ወደደ እኔ ቻለ ሁሉ ተደረገ ምክንያት ወደደ ሙሉ ሙሉ ወደደ",
"ሰው አረደ ምን አለ ኢዜማ ችግር አማራ ክልል ፈጠረ ውግዝ ጀመረ ነው አለ ወቸው ጉድ የድኩማንና ሴረኛ ስብስብ",
"ስለ ሀገር ግድ ሰጠ ራስ ስብእና ብቻ አሰበ ጨለምተኛ ነው አንተ ተነሳ ሀገር ህልውና ምን ሆነ ነው ግብጽ ምን ተደረገ",
"እስክንድር ነጋ መራ አለ ትግል ደንብ ተደራጀቶ ቀጠለ አለ ይህ ነው",
"አብይ ዜና አውታር ግን መታ ሆነ ውሸት",
"ምን ፍቃድ ማን ግራ ገባ ነገር ነው",
"ዛሬ በኣአ ቦሌ ኤርፖርት ገባ ታላቅ ወንጌል የምስራች ሀይል ስልጣን ሰበከ ፡፡",
"በዚ ድንዛዜ ላይ ትዊተር ጠቀመ ግን ከባድ ነው",
"አታላይ ንብ ደከመ ዛሬ",
"እምየ ፥ጎንደር ፥ታሪካዊ ምድር እንግዳ፥ ተቀበለ ፥ህዝብ፥ ያለብሽ፥ከተማ ፥ሰላምሽ ፥ይባዛ ኢትዮጵያ ቡና ደገፈ ተመሰገነ የተከባራችሁ አገር ተዎዳጅ ቡድን",
"እንኳን አበረ ደረሰ ፍጹም ጭንቅ አማላጅቱ ቸር ወር ሰማ ምስኪን እህት",
"ስለ መታገታቸው ያልዘገብ ሚዲያ ስለ ለቀቀ ዘገበ ሰማ እውነት ነው አለ አለም ቁጥር አንድ ድንጋይ ራስ አንተ ነው",
"መስጊድ የተቃጠሉበት፣ ሙስሊም «በሠንበት ስራ አትሥሩ» ተባለ በሚከለከሉበት፣ ሙስሊም ነጋዴ ጅዳ ልጅ አለ ገባ ግብር ይጨምራል» ተባለ ክልል ላይ",
"ክብርት ዳጊ በርችልን አንቺ ገባ የ፳ ፩ኛው ክ/ዘመን ጀግንነት ምን ሆነ ገባ",
"እንደ አንተ አይነት ሰው እና አስተሳሰብ ሳለ ኢትዮጵያ ትንሳኤ ሩቅ ነው አለ ጨበጨበ ደነዝ ነው",
"ሰራ እና ባለቤት ላቀ ጉልበት ሰረቀ ሌባ ቅርስ ተሻለ ጠበቀ ተባለ ንዴት ነው ግራ ገባ",
"",
"ፍጹም እውነት መሰለ",
"ምነው በያስኳላው ሞተ ወጣት ተማረ ሆነ ሳለ በላ ፍላጎት ምርቃት ነበረ እናት አባት ጸጋ ሙሾ ወረደ ሆነ ጊዜ ሰጋ ተበጀ ጻፈ ጥበብ ቀለም ተማረ በብዕሩ ተበጀ ለም አገር",
"ቤት ልብ ተገኘ ነው",
"ርሑስ ጋማ ፍጼ የፍጼ ጋብቻ የፌዴራሊስት ሀይል መጭው ተስፋ በራ ሆነ አየ መልካም ጋብቻ",
"ዛሬ ደገመ ፕሮፌሰር ሌላ ነፈሰ ረካ እውቀት ንክ አለ ጋዜጠኛ ተመሰገነ",
"አቤቱ በደል ሆነ ቸርነት ቀረ አለ",
"ህገወጥ መንገድ በር ከፈተ ነው የግባታ ፈቃድ ድርጅት ንግድ ተቋም አስፈላጊ ነው ግንባታ አጭር ጊዜባለመጠናቀቁ ሀገር መነጨ ኢኮኖሚ አጣ ኖረ ቤት ተሎ",
"ይህ ገለጸ ሰማ ቸልታ አለፈ ሽብርተኝነት ተግባር ደገፈ ነው",
"መንግስት ብቻ ነው ዞረ አለ ነው",
"ሕውሃት ከነጁዋር ጋረ ቀላቀለ ስልጣን ላይ ወጣ ሁሉ ብልጽግና ሰው ነው በየእስር ቤት የሚስቀምጡትና ገደለ ብልጽግና ነቃ በላ አለ ነው ላከ",
"ለመደ ቁጥር ልምድ ወሰደ በማቀናጀት ስልት ጠቀመ እልፍ ለየ ሰየመ ሥያሚወች ለመደ ቁጥር ለነ ሚሊወን ቢሌወን ትሪሊወን ወዘተ ሆነ ፲፻፻፻፻",
"በረታ እኛ ጀግና",
"ደንበኛ ሰማ ማነህ ይሄን ጫማ ሰፋ ሊስትሮ፡ ጌታ ሰፋ ነው ወይስ ጌታ ረዳ ደንበኛ፡ ምን አለ አንተ ድንጋጤ ሊስትሮ፡ ስውር ነው ወይስ ስፌት አየ ሰፋ ሰፋ ሰው ነገረኛ ሆነ",
"አሜን",
"የብአዴን ሀውስ ኒገሮች ቀረ ተሽኰረመመ አብኖች እንኳን አንተ እና እኔ ቀረ ዘመድ ወከለ ነው ተፈጥሮ ሆድ አደራ ነው",
"ምን ላይ እንቅልፍ የነሳይ አማራ ህዝብ ላይ ሕወሓት ሰራ ነቀዝ አማራ ህዝብ መካከል አማራ ህዝብ ሴት በላ ባዶ ተደረገ ነው",
"ፀረ ሙስሊም ቡድን ጭንብላቸው ወለቀ ነው ኣልሃምዱሊላህ የጃዋር መሀመድ ጉዳይ አጼ ፈለገ መቃብር ወረደ አሮጌ ኢትዮጵያ መለሰ ቀበረ ደሴት",
"መላ እስልምና ተከታይ ሙሉ ዛሬ ጁምአ ሰላማዊ ፍቅር ሰጠ ሞላ ሆነ ተመኘ",
"እንዲህ በጠሰ ደህና ፖለቲካ ፖለቲከኛ አለ መሰለ ድንቁርና እንቁልልጭ ሀገር",
"ኢትዮጵያ የእንግዴ ልጅ ማ ማ ተደረገ እነደብተራውን እና በራ ደብዛ ጠፋ ተደረገ ከሃዲዎች ጠቀለለ ምንስቴሬን ተገኘ አለ እንጨት ሽበት ጋረ ህዝብ",
"ቅዳሜ ጀመረ አፍሪካ አየ አወቀ ደረጃ መሀል እሥከ ጥግ ምርጫ ቅስቀሳ ተደረገ አገሪቷን አንድ እግር ቆመ ተሸነፈ",
"ፖሎቲካ ውስጥ ጀርባ አለ አጀንዳ አየ ያስፈልጋልበመደመር ውህደት ጀርባ ማን አለ ግልጽ አይደለምammicho",
"ወይ እስክንድር ቀዌዉ የት ጠፋ እብድ ወንድም ጀዋር ጀዌ እንኳን ቶሎ አለ መራ ጉዲና ጠነባ ዘር ስልቻ ዉስጥ ዘለለ ገባ አንተ",
"ሀሀሀሀሀሀሀሀሀሀሀሀሀሀሆሆሆሆሆሆሆሆሆሆሆሆሆ አለ አዛውቱ አቦይ ሽበት",
"ጉራ ብቻ ግዜህን አሉባልታ ቀጠለ ወሬወሬ ችግር",
"ጠ/ሚ ዶ/ር አቢይ አለም አቀፈ ማህበረሰብ ውጭ ሀገር ኖረ ኢትዮጵያዊ የእንኳን ደረሰ መልእክት አለፈ",
"እርስ እሱ የሚቀዋወም መንግስት",
"አማራ ምን ለኤርትሪያኖች ሰገደ ግራ ገባ",
"ህወሓት ይህ በኃላ ቤተመንግሥት ገባ ብር ከፈለ ነው አለ አንብቤ ፈገግ ብያለሁ ዛሬ ደገመ ዘረፈ አለ ሰማ ፈገግታ ወደ ሳቀ ቀየረ",
"ክፉ አሰበ የፈረንጅኛው ቨርዥን ብዙ ጋረ ደረሰ ቀረ ከሳ",
"እኛ መብት ደፈረ ጋዜጠኛ ወረቀት ገባ",
"ከበረ ወንድም አነሰ ጐበኘ ላይ የታዘብከውን ቆንጆ ተደረገ እኛ ቀረበ",
"atyወያኔ ሰፋ ሰጠ ጠባብ አማራ ከረፋ ዘረኝነትን እና ብሄርትኝነትን አኘከ ዘመን አለፈ ዘመን ተካ አንተ አሁን ከጀዋር",
"ደቡብ አፍሪካ ኖረ ኢትዮጵያዊ ትኩረት ተደረገ ፕሬዝዳንት ሲሪል ራማፎሳ ጋረ ተወያይተው ኢትዮጵያዊ ትኩረት ተገኘ ቻለ ስምምነት ላይ ደረሰ ጠ/ሚ/ር",
"ኢም ሰይጣን",
"አለፈ አመት ጎራ ለየ ወነጀለ ነበረ ብሄር ፖለቲከኞች በመካከላቸ ሰለነበረው ጥላቸ መፍትሄ ተገኘ በቁርሾና ማን አለብኝነት ፖለቲካ ስልጣን ለማግኝት ተባለ",
"ኦቦ ማ እሄይ አከለ ጽንፈኛ ጠለፈ ብይ ሳበ ነበር ስለ ኢትዮ አንድነት እንደዛ ለፈለፈ ነበረ ሰውዬ ዛሬላይ ተመልሶ ግለኛ ሆነ የ፩ብሄር ጥያቄ ብቻ ሚያነሳ ሆነ",
"መሰገጥ ገና ጀመረ ነው ሜትር ልዩነት በር አለፈ ወንዝ ሁሉ ፀበል ነው አለ ሲየጠር ኖረ ደነቀ ሬዲየስ አንድ መስጂድ አጥር አመመ አይደል",
"ንዴት እባክህ ጉቦ፣ ሙስና፣ ስልጣን ብር ሰከረ ባለስልጣን ግራ ቀና ደበለቀ እኛ ጠቀመ ጐዳ ለየ ቅእት",
"እኛ ሀገር አለ ጨረሰ ከጎንህ ነው ክቡር መራ ኢትዮጵያ እና ኢትዮጵያዊነት ዘላለም ኖረ አሜን",
"እግዚአብሄር የትምከተኞችን ሀይል ፈዘዘ ሰላም ሀገር ኢትዮጵያ",
"ጣም ገረመ ነው ምስራቅ መጣ ሰብአሰገል ትክክል ጥቁር አፍሪካዊ ኢትዮጵያዊ የአክሱሟ ንግስተሳባና አጃቢ",
"ቀጠለ ተስተካከለ ብይ ተስፋ ተደረገ",
"ስንት መከራ ተለማመጠ ተበደረ ብር መንገድ ላይ ጠፋ አሁን ባዶ እጅ ጨበጨበ ወደ ቤት",
"አየ ወጣ መገናኛ አካባቢ ዝርፊያ መገናኛ አካባቢ ዝርፊያ እጅግ በረከተ ቦርሳ ቅሚያ እስከ መኪና ሿሿ ቀን ተቀን ክስተት ነው ይህ ቪድዮ አንድ ዘባ ቀረጸ",
"ደህና ነው ምናምን ምንድነው",
"ታገሰ ኖረ ግዜ መልስ አለ",
"እንኳን ደረሰ ለሁላችን መንግስት",
"አቡነ ማትያስ ትግራይ ብቻ ነው ሰላም አለ አለ",
"ተከባበረ ወደ በልዐጊና ስለ ሞያደረሰን ኢረገተኛ ነው ክቡር ጠቀለለ ሚኒስትር ቀጥበት",
"እውነተኛ ሚድያ ሆነ አመነበታ",
"መራ ሆይ፣ ለሕዝብዎ፦ ፓርቲ ውህደት ብስር ወሰነ ፊርማ ሥነሥርዓት ዛሬ ተካሄደ አለ ብስር የምስራች አየ ደስታ እንባ",
"የዘሃበሻ አመት ምርጥ ሰው አትሌት ደረተ ቱሉ ሆኖዋል",
"ብርሀን ነጋ ግን አደገኛ ሙድ ያዘ ነው",
"ባለስልጣን ስራ ወደደ ስምንት ሰአት እንኳን ሰራ ወደደ ገለጸ ጠቀለለ ሚኒስትሩ፣ እናንተ ውጭ ምንዛሪ ችግር አለ ረባ ረባ ባንኮክ",
"ደመወዝ ስኬል ሽግግር ላይ ሲቪል ሰርቪስ ኮሚሽን በቃ ግንዛቤ ፈጠረ እንደ ደመወዝ ጭማሪ ወሰደ መንግስት ሰራተኛ ኖረ እንደ ከበደ ህዝብ ወከለ ምክር ቤት ገለፀ፡፡",
"መልካም ልደት እንኳንም ወለደ ረዥም እድሜ ጤና ጋረ ተመኘ",
"መስጊድ ቀጠለ ፈርሶ፣ ሱቅ ዘረፈ ቀጠለ ሰላም ሰላም ኖረ አለ አፈረ ኧረ ሼም ተባለ ነገር አለ ሙስሊም ጉዳት አንተ ሰላም ሰጠ",
"ደፈረ ነው እንዴ",
"ለካ ጤንኛ ለም አገር ላይተብሳሲቼ አለ እንትና ወይ ጉድ",
"አቤቱ ጌታ ሆይ ደግ ዘመን መጣ",
"አብ መራ አማራ ሆነ ብቻ ብሄር ለየ ቅሊንጦ አለ ሰአት ብሄር ብሄረሰብ ቀን ገደል ይግባ፡ህዳር ፳፱ አማራ ቀን ብቻ",
"ሀገር ተስፋ ቈረጠ እና ሀገር መራ ተስፋ ቈረጠ ለየ",
"ምን አለ ነው ይህ አየ ከእንደዚህ አይነት ሰው ጠበቀ መንግስት ሀይለማርያም እንኳን አሁን እንዲህ ሳበ",
"ቀን ገዛ ፡፡ ማንኛውም ደቂቃ አሁን ደም ተፍስሶ ወሰደ ደም የአትክልቶችዎን አፈር ፈሰሰ እንዲሁም ቤት ያጥለቀልቀዋል ቆመ ንጹሀን አመነ ደም ነቃ ፡፡ ሞት",
"ስልጣን ላይ አለ ፓርቲ ፎከረ ፓርቲ ጋረ አንድ ላይ ሰራ ቻለ ድል አለ አለ አሰበ ራስ ላቀ ለውጥ ነው መንግስት ታንክ",
"እና መሬት ተነሳ ሰው ዘለፈ ምንድን ነው",
"ሀገራዊ ሆነ ተሻለ ማህበራዊ ጉዳይ ላይ ጠራ ጠራ ሀሳብ ላይ እየተወያየሽ ደካማ ሰይፍ ሾው ላይ ይህ አከለ ትኩረት ተደረገ ገረመ",
"ግርማ ኖረ ዋስትና",
"ህግ ስርአት አለ አገር አገር አጣ ፋንታ ወሰነ አንዳንድ ዜጋ ነቃ ተሳተፈ ውሳኔ ነው አለ ግን ወሰነ ወሰነ ነገር ለም ያ",
"በኮሮናቫይረስ ያዘ ቀረ ተባለ ተጠረጠረ ኢትዮጵያዊ ቫይረስ ነጻ ሆነ ተነገረ",
"እነሱ አንተ አማራ ጨፈጨፈ ባሰ እነ ክርስትያንን ስር ተሰቃየ ስለ ምኒልክ ሳበ ወረኛ",
"ገዛ ቦርጭ ጠፋ እንደ ሰው ስም ጠፋ ቀላል ነው",
"አንዳንድ ኢትዮጵያዊ ኤርትራ ቈረቈረ ጣለ ነውየምጣዱ ሳለ እንቅብ ነጣ አለ ይህ ነው ወደደ ኢትዮጵያ ወገን ብዙ ትፍልግሃለች፣የምን ማደንፈስ ነው አመት",
"አማርኛ ተማረ ጀመረ",
"አፋር ሆነ ብቻ ተልይቶ ገደለ ህግ አለ አገር ሰላም ዋስትና ረገጠ ቻለ ኢሳ አሸባሪ ጋረ ኮንትሮባንድ ንግድ",
"መጥፎ ቃል ተናገረ ሁሉ እጅግ ተሰቃየ ፡፡ ቅርብ ጠፋ አለ እውነታ ተቀበለ ብልህነት ነው ፡፡ ህግ አለፈ ፈጸመ አሰቃቂ ስህተት ሰጠ ፡፡ ረገመ ነው",
"መራ ግልጽ የደርግሃይለስላሴ ስትራቴጂ //የትምክህተኞች/ ጨረሰ ግብ ነው ተናገረ ኢሳያስ ሸገር መጣ ህወሓትን በሸዓብያ",
"እናት ጽዮን ደረሰ ምስጋና ማኅበረ ቅዱስ መዝ",
"ተከተለ ቁዑራን ጀመረ ጊዜ አማርኛ አተመ ተደረገ ፈራ መኮንን ሆነ ግን ነገረ",
"ጨዋታ ድባብ አማራ ቴቪ አለፈ ጀመረ ድል ቡናማ",
"ቤተሰብ ደስታ በእጅዎት ነው አለ ታሕታይ",
"እግዚአብሄር ባረከ አቤቱ አምላክ ሆይ ኢትዮጵያ ሀገሬየሚደክሙላትን ልጅ ጠበቀ",
"ብዓዴን ፅረ አማራ ነው እርልሱ ነው አማራ ክልል ሽብር ፈጸመ አጠቃላይ ወያኔን ላይ አበበ ኖረ ወያኔ ተወገደ አማራ ጨቈነ ቆመ ታድያ ችግር አለ ወያኔ",
"ሪፖርት| ወልቂጤ ከተማ እና ቅዱስ ጊዮርጊስ ነጥብ ገራ",
"እስቲ በመጣሪ አለ ወንጀል የታሰረትግራዋይ ንገሪኝአደራሽንአጠቃላይ የሜቴክዘራፊዎች ደህንነት ሰራ ቤት ሰውበላዎችእንዳትይኝ ሁለት ተቋም ውጭ",
"እናንተ ማን ነው ወጣ ዉክልና ሰጠ",
"ዋና ነገር እሱ ነው",
"ወር አንድ ቀን ንክ ክላስ ገባ ሪፍት ቫሊ መረቀ ሁሉ እኮ ነው ቴዲን ኛ፣ ክፍል አለ ሙድ እውቀት ስብዕና ገነባ ወረቀት ሰበሰበ",
"ማረ ምገባ መርሀ ግብር ዘላቂነት ቀጠለ ቁርጠኛ አቋም አለ ማረ ምገባ ኤጀንሲ ቦርድ ገለጸ",
"ይህ በግላጭ ጥላቻ ተናገረ ያኔ አለ ተስማማ ተስማማ ነበር ሀይማኖት ሽፋን ተወራ አማራ ክልል ውስጥ",
"አሁን ተክል አካል ጐበኘ ቀረ",
"ድሬዳዋ ዩኒቨርሲቲ ከሰተ ችግር ሌላ ዩኒቨርሲቲ ውጥረት ፈጠረ ገለጸ",
"የጎጠኝነት አደጋ፡ ጎጠኝነት እነሱ እኛ አርቲፊሺያል ክፍፍል ፈጠረ አነሰ መጥፎ ሳተ ክብር ገባ ውሸታም ሳበ እኛ ደገመ ጠራ ሀቀኛ ክብር",
"ኤድስ ላቀ መኪና አደጋ እና ጃስ በላ ተነሳ ጽንፈኛ ብሄርተኞች ፈጀ በለጠ ፊት እነሱ ዞረ ነው",
"ሆነ ቡራዩ ላይ ከተማ አቀማመጥ አስቸጋሪ ሆነ ጭፍጨፋ ተከላከለ ቻለ አለ ሀላፊ ላይ ቆመ ኦሮሞ ሆነ ዜጋ ጨፈጨፈ",
"ልብ አለ ልብ አለ ጆሮ አለ ሰማ ሀገር ሰው በላ አውሬ ዳነ ውሸት ትርክትዛሬ ቆመ አለ ሰውያረዱ ጡት ቈረጠ ወንድ ሰለበ ቤተክርስቲያን ቀጠለ ሰው",
"ግኝ* ደስተኛ ነው ተመሰገነ",
"አማራ ክልል ህዝብ አደለ ወገን አለ ሙስሊም ህዝብ ማንኛውም ፍቅር መጣ ሰው ዘር ፍቅር ሰጠ ጠላት ደሞ ሰአት ሆነ ህዝብ ነው ይህንን አለ",
"የሪፍት ቫሊ ማረ ግን ሁሉ ነገር ቀረ ንዴት ወሰደ አለ ኮርስ ቆመ ዳነ እውቀት አምላክ አቦ ድፍት ተደረገ",
"ቀዝቃዛ ፍርሀት ሰማ ንጹሀን ወጣት ረባ ፖለቲካ ቁማር ህይወት አጣ ኢትዮጵያ ሳበ ቤተሰብ ልጅ ደረሰ አለ መረቀ ሸኘ አስክሬን ተቀበለ ቻለ ሳበ",
"አሁን ሰአት ስለ ቀጣይ ምርጫ አሰበ ተሳተፈ ቀጠለ አምስት አመት በላ ተመለከተ ሆነ ነው ኢዜማዎች ስራ ሰራ ነው እናንተ",
"ጴንጤ ሆነ ሾመ አለ አለ",
"ክቡር ጠ/ሚንስተር ነገር ጣም ፈጠነ ቸኮለ ጅብ አህያ መንጋጋ ነከሰ ተባለ ተረት በእርሶ ፈጸመ ሆነ ፈራ",
"መሳሪያ ገዝታችዉ ዘር እልቂት ልታስነሡበት ነዉ ኦነግን ታጠቀ ነዉ",
"አንተ ሀገር አመሰ ፈጠረ አንተ የሚሻለህ አርነት እንጂ ነጻነት ነው",
"ይህ እናንተ ኢዜማ እና ብልጽግና ውህድ ፊት እራሳቸውን ያጥፉ፤ መጣ ኖረ ጠቀመ ሌላ ደገመ እጅ ወደ አይን አብ ተጠቃ",
"ኢትዮጵያ ልማት ባንክ ተበላሸ ከፈለ ተጠረጠረ ብድር ላይ ተደረገ አለ ክትትል ቁጥጥር ውጤት አየ ሆነ በለጠ ጠነከረ ሰራ አለ ተጠቆመ፡፡",
"ከበረ ጠቀለለ ሚንስትር ዳያስፖራ አየ መልካም ነው ማረ ሽብርተኛ ታግተው ግን ምነው ዝም አለ",
"ቤቲ ማረ አለ ፍላጎት ከፍተኛ ነው ጀዋርን አየ አይን ነው ምትመለከተው",
"ዘመን ዋጀ አበል መራ ወር ብር ትራንስፖርት አበል አለ መራ ወጣ ዘመነ መንግስት ሆነ አለ አለ",
"እውስ ጠራ ነው",
"ወራዳ ሆነ ሰራ ሰራ ባጥ ቆጥ ቀባጠረ ጀመረ ምን ሰርዓት ኖረ ነበር ምን ተርበተበተ መሰጅድ አቃጥከው ጎሸ ተባለ ነበር ጠበቀ እረ ድንቁናቹንም",
"ዩኒቨርሲቲ ረጋ መምህር አስተዳደር አካላት ተሳተፈ አለ ጠቈመ አገር ዩኒቨርሲቲ ውስጥ አየ አለመረጋጋቶችን ፖለቲካ ፍጆታ ዋለ",
"ያንኑ ፈረደ ባንዲራ ተሸካሚ አማራ ድምጽ ተገኘ ነገር ላይ ስንት ቤተክርስቲያን ቀጠለ ሰው ገደለ ያልሄደዉ ኢዜማ ሞጣ ሄደ መስኪዱን ጐበኘ አለ",
"ማ ምን ጥገኝነት ጠየቀ",
"ፎቶ ማንነት መሰከረ እንዲህ አለ ውጭ ምን አቅም አለ",
"ጀመረ ላቀ ችግር፤ ሠነዱ፣ ጋራ አለ ሀገራዊ ታሪክ አኮስሶ፣ አካባቢ ለየ ወሰነ ህዝብ ታሪክ አድርጐ ያስቀምጣል፡፡ ላቀ ታሪክ አኮስሶ፣",
"ደህና ጊዜ አወቀ መጣ በተጠንቀቅ ላይ",
"እንኳን ብርሀነ ልደት ሰላም ደረሰ አደረሳችሁ፡፡ መልካም ልደት በአል",
"ራቀ አስተዋይነት አንለዉም መቸስ መንግስት ተብዬዉም ምን ለየ ነገር አላቸዉ ጀመረ አንድ ሳንቲም ሁለት ገጽታ",
"አቶ ማን ተመለከተ ፈነዳ ወር ቦምብ ኋላ ምን ተገነዘበ ኦሮሚያ ውስጥ አክራሪ ጎሰኞች አቋም ብዙ ተከተለ አለ ነው ምሁር ነው አለ በተቀር ሌላ",
"ሺ ደረሰ እይው ሌላ ምን አለ",
"ትንሽ ጠበቀ ያዘ ይሀዳል",
"አሁን ሰአት ኢትዬጲያ ውስጥ ገዛ ፓርቲ እንደለለ አስተውለዋልኢህአዴግ ጉባኤ ፈረሰ የኢትዬጲያ ብልጽግና ፓርቲ መሰረተ ትከስማለችለምርጫ አዳዲ ፓርቲ",
"«የእኛ አላማ ታሪክ ቀየረ ነው ተራ ምርጫ ተደረገ አይደለም፤ ቀደመ አይነት ምርጫ ደገመ ነው እኛ አላማ ሰው ታሪክ ጀመረ ጊዜ ሉአላዊ ሆነ",
"እንዴ እረ ረጋ እሱ አለ ድሮ እኛ ሰጠ ሰራ ነው ገደለ አሁን ግን ዱላ ብቻ ነው ምንሰጣቸው ያ አህያ ዱላ ደበደበ ሞተ አለ",
"ይህ ለህሊናችው ሰማ አገልግሎታችው ነው",
"አቶ ታከለ ጎበዝ",
"አለፈ ራስ አንድ ተስብሳቢ ዶ/ር አቢይ ይቺ ሰጠ አለ ሆነ ዶክመት ሰጠ መለሰ መልስ ደከመ ነበር",
"ምቀኛ ጠፋ እውነት",
"አሜን",
"ዘይት ጨው ሸጠ ሀገር ውስጥ ግን ንዴት ነው ምግብ ቤት አመነ መገበ",
"አሜን አሜን ለሁላችንም ሰናይ ምሽት መድዬ አባት ተዋህዶ እና ኢትዮጵያ ጠበቀ",
"በላ አብይ አስተዳዳር ድሮ ተከለ ትልቅ ዛፍ ላቀ እሱ እሱ መሰል ካድሬዎች ፎቶ ተነሳ ችብሀዎች ክብር ሰጠ ምድረ መሰለ ፀረ ኢትዮጵያ",
"ለመደ ሰኞ ምሽት አሎና/ቫርዳስ ጃኖ አንድ ደመቀ ወደደ ሙዚቃ አበረ ተጫወተ እና ዘና ጌቱ ኮመርሺያል ፎቅ ላይ አለ አሎና/ቫርዳስ ተገኛኘ",
"ማህሌታይ ያሬድ አንተ ታላቅ ነው ኢትዮጵያ ሰው ምግብ ሰጠ መዝ አለ መጽሀፍ ቃል ፍጻሜ አየ አንተ ነው እኛ ሕጹጻን ዘመን ሰው",
"ምን ግኝ* አርሰናል፣ ማንቺስተር፣ ሊቨርፑል ወዘተ ተመቸ",
"እንዲህ ስንወዳደስና ወደደ ብቻ ነው ማረ",
"አቶ ደመቀ መኮንን ድሮ ኣድርባይ ነገሰ ነበረ አቶ ያሌው ፊት አለ አረፋ ነው",
"መሰለ ነው እሱ ነው",
"ሀገር ቁም እንስሳት ቁጥር አሻቀበ ነው ድሬዳዋ ዩኒ ማረ ህንጻ ላይ ወረወረ ገደለ ከብት በጎንደር/ጠገዴ ደገመ ከፋ ደግ ለየ ቻለ ህጻን",
"ኖህ ገና አየ ነገር ረዳ እግዚአብሄር ፈራ ቤተ ሰው ዳነ መርከብ እምነት አዘጋጀ፥ ይህ አለም ኰነነ፥ እምነት ተገኘ ጽድቅ ወረረ ሆነ ወደ እብራዊ",
"እውሮፓዊ ፍሽዝምን ቀጣ ትውልድ ልጅ ልጅ እስላማዊ ክርር በተነ ሰባ ኢትዮጵያ ደረጀ በፅንፍም ሆነ አደገ ግድ አለ በቃ",
"ስው ደስ የሚስኝበትን ተደረገ",
"ገረመ ከሀህወሃት መቀሌ ጥርግ አለ ገባ ለት ነበር ይህ ተረት ተረተ ሁለት አመት ሆነ አትዘገይ ሺ",
"ሀረግ ወረሰ ወጣ ቱባ ልጅ ቅባት ራሰ ገደለ እኮ ነው",
"ንዴት ነው ይህ ደረጃ ላይ ደረሰ ንዴት ነው የተጨካከንነው አለ ጥያቄ አቅጣጫ ምክንያት ተደመጠ ነው ጠየቀ ፈወሰ ጅማሮ ነው",
"እንኩዋን አበረ ደረሰ",
"አውነትሕን ነው ተወ አከከ እሱ ገና አሳማ ተነሳ ሰማይ ላይ መብር ጀመረ ነው ሺ ጊንጦ",
"እኛ ተሻለ ኬንያ ሆነ አለ ዘገነነ ነው",
"እኔ ሀሳብ ሆነ አገር ፈረሰ ነው አለ ኛው ህልመኛው ንጉስ አቦ አናትክ ፈረሰ ትሸነፋለክ ፣ሀሳብህም ውሀ በላ አየ ያብቃክ",
"እጅግ ውብ",
"ትወልዳለች፤ እሱ ህዝብ ሀጢአት ዳነ ስም ኢየሱስ ማቴዎስ",
"በተጎሳቆል ህይወት ውስጥ የት ሄደ አወቀ",
"አሁን ኢትዮጵያ ትውልድ ተላለፈ ጐዳ ግብጽ ምርኮኛ ተደረገ ውል ፈረመ ውይይት ቈረጠ ወጣ ሉአላዊነት ከበረ ውሳኔ ወሰነ ነው ተሻለ",
"እባካችሁ ይህ ባንዲራ ጣኦት ቤተክርስቲያን ወጣ ይህ ጣኦት ቤተክርስቲያን አንድነት ከፈለ ነው እባካችሁ ይህ ለየ ጣኦት ታቦተ ጽዮን አለ ነበረ ወጣ",
"አጋር ፓርቲ ሆነ ኖረ ፍላጎት አሳይታለችአሮጊቷ",
"በረታ ይሄ ትክክል ነው",
"እኔ ማ መገርሳ ለየ መቃብር ብቻ ነው በላ አህመድ አቤት ክህደት ጨረሰ",
"ዋና ስነ ልቦናው ነው",
"አቤቱ፥ አዲስ ቅኔ እቀኛልሃለሁ፤ አስር አውታር አለ ገና ዘመረ መዝሙረ ዳዊት",
"ውሻ ሆነ ሰው ምሳሌ ሁሉ ውሻ ነው",
"ኢትዮጵያ መራ ሆነ አለ ትግሬ ሴት ነው ጀግና",
"ዶ/ር ሄኖክ ገቢሳ ተናገረ ሁሉ ፓርቲ ነው ተሻለ አለም ግፊት መረጠ ገዛ ህዝብ ሆነ አለ አደራ እንግዲህ አንድ ብቻ",
"ልብ ዛሬ ሞላ ምንድን ነው ፍቅር ሞላ ልብ ውስጥ ጸጋ ሞላ ንግግር ፈለቀ",
"ልዩ መንገድ እና እናንተ አንዳንድ ዝርዝር ወደደ እኔ ቻለ ሁሉ ተደረገ ምክንያት ወደደ ሙሉ ሙሉ ወደደ",
"ጌታ ኢየሱስ ሰላም እረፍት ደስታ ክብር ሞገስ ህይወት በረከት ብቃት ጥበብ ሆነ",
"እኔ ወጣት እንደ ሀይል ቻለ ዘፈነ የለምምናልባትም ከቴዲ አፈረ ቀጠለ ምርጥ እሱ ነው",
"እኔ በራ ቀን አሁን ጀመረ",
"አንበሳ ገባ",
"ከብፓ ሰራ ነው አሁን ህውሓት ከስራውን ትግራይ ክልል ወጣ ሀገር ደረጃ ተወዳደረ አለ",
"ቃል ከበረ እናት ተደረገ እግዚአብሄር ቃል ፍጹም ከበረ ተመካ መሰላል",
"ውድ እህት ግይጥ ወገን በለጠ አለ ሞጣ አንዲት ጀምበር ዘመን ከበተ ሀብት ንብረት ዶግአመድ ሆነ ሙስሊም ወገን አላህ ወጣ ተካ",
"ሰበር ዜና ብልጽግና ፓርቲ ቀላቀለ ድርጅት ስምምነት ፊርማ ስነስርዓት ዛሬ እሁድ ህዳር አመመ አዲስ አበባ ተደረገ ክቡር ጠቀለለ ሚኒስትር ተደረገ",
"እቺ ጠጋ ጠጋ እቃ አነሳ ነው ፌሪዬ",
"ነፍጠኛ ኦሮምያ ውስጥ አለ ንብረት በላ አህመድ የሚኒሊክ ሀውልት ነው",
"ፕሬዝዳንት ሳህለወርቅ ዘውድ አንድነት ፓርክ ጐበኘ ኢትዮጵያ አለ ታሪካዊ፣ ባህላዊ እና ተፈጥሯዊ ሴት አለም",
"ልክ የሌለዉ ዶክተር በላ መንግስት ትግስት አንተ አይነት ልክፍታም ጨፈረ ነዉ አህያ ስጋ አልጋ አለ መሬት ቦታክ ከርቸሌ ነዉ",
"የኦነግ ክርር ቅኝ ተገዥነት ፖለቲካ ግብጽ ቀዳ ገባ አቶ ገድ እንግሊዝኛ እኩል ሙድ ያዘ ሞከረ ነው",
"አለ በላ ፎግሮ ተገኘ ሽልማት አደገኛ ጠላት",
"ጤነኛ ሰው ጸረ ማ መገርሳ ሆነ ቆመ አበደ በቀር እብድ ደገመ ዘመድ አሰረ",
"እኔ ጥንታዊውዎቹን እወዳቸዋለው ግጥም ዜማ መሳሪያ ተጫወተ ሰማ አይጠገብ ለዛ አለ",
"እንኳን ደረሰ ፈጠረ ክርስቶስ ወለደ ቅድስት ድንግል ማርያም ልኡል እግዚአብሄር ትእዛዝ ጥበብ ዋለ ተቀበለ በባስልኤል እጅ ሰራ ቃል ኪዳን ታቦት",
"ውን ከኢህአዴግ ይህንን ጠበቀ ከንቱ አይደለምን",
"ሰለጠነ ህዝብ ሆነ ተቃውሞ ድርጅት ሀላፊ ስልጣን ያስነሳ ነበር እኛ ህዝብ ግን አለቀሰ ጨበጨበ",
"አሜን ለሁላችን",
"የጥዋት እሳቤ ውብ ቀን ፈገግታ ጣም ፈታ ሆነ ውበት መድሀኒት አንድ ነው መልካም ስራ ሰራ ቻለ መንገድ አንድ ፈገግታ አየ ሆነ ይህ",
"ነፂ ተሸነፈ እኛ ጀግና",
"ዛሬ ቀን ደረሰ አሜን አነሰ ሀገር ጠበቀ ዘንድ መልካም ሁሉ ተደረገ አለ ተመኘ አመት ሰው አለ አሜን",
"ከፍተኛ መንግስት ስራ ሀላፊ ከታገቱ ማረ ወለደ ጋረ ተወያዩ",
"ነገር ፍለጋ እቃ አሪፍ ሚያስብል ምስሎሽ ነው አይደል መስፍን",
"ብልጽግና መሰረተ ኢትዮጵያ ዳነ ሻ ደገፈ",
"መልካም አዲስ አመት",
"መልአኩ ቅዱስ ዑራኤል ወርሀዊ መታሰቢያ በአል እንኳን ደረሰ ጸሎት ቃል ኪዳን ሁላችንንም",
"ትርጉም ትገድላለች፡፡ ስጋዊ ትርጉም ለየ አንድ ነው ሚሊዮን ህዝብ ገደል ወስዳለች፡፡",
"ሰራ ጠፋ ልክ ተገኘ ተጠረጠረ ነገ ሌላ ቀን ነው",
"ጌታ ሆይ ጠበቀ",
"መልካም በአል እኛ ሰው እግዚአብሄር ጠበቀ",
"ደረሰ ልብ ተላላከ ሆነ እንጂ እምነት ታቋማት ላይ ነጠረ ጥቃት ጀመረ ቈየ አሁን ልክ እንደ አዲስ ክስተት ከበሮ አትደልቁብን ራስ ወዳድነት ጠቀመ",
"ያዘ ብሮ የመቐለ ትግርኛ ነው እኔ ኣለማምድሃለው",
"ሰሞን አዲስ አበባ ሴት ነው ተብዬዎች ትዊት ምታደርጉት ሁሉ ለዛ ጠፋ",
"ጋዜጠኛ ነው አለ ስለ ሙያ እውቀት አለ ሆነ ሁሉ አይነት ጋዜጠኛ ደገመ አለ ሰማ ሚዛናዊነት አለ ነገር አለ የንፃሬው ተነሳ ይሄ",
"መላ የፌስቡክ ወደደ እንኳን ሰላም ደረሰ አለ አመት ጸሎት መለሰ ሆነ በረቀ",
"ጉድ ሰማ አለ ኧረ ወገን ላይፍን እኮ ሆነ አለ ከበደ ነው",
"ነገ ማታ ምን በላ",
"እርግጥ አለ አለ ነው ደሞ ራስ አመነ ጥግ እኮ አለ ነው",
"ጀመረ ኤርትራ ሉአላዊ ሀገር ሆነ አመነ ተቀበለ አለ ከዛ ተረፈ ሌላ ገራ ጋረ አለ ግንኙነት ሰላማዊ መንገድ ኖረ ቻለ",
"ፈገግታ ውበት ፈገግታ ዋለ መልካም ቀን",
"እኔ አለ አሁን ወጣ ተናገረ ቻለ ነው ወይስ ድሮ አንዲ ደደብ ብዙ ነበረ",
"ኣረ አማራ ክልል ወደ ትግራይ ጠቀለለ",
"አሁን ሌላ ኖረ አልኖሩ ምን ጠቀመ ድምጽ ሰማ ነበረ ፓርቲ ፈረሰ ፊት አሁን ሰራ ከበደ ናደ እነሱ ድምጽ ወሰነ",
"ኢዜማሰቆጣ ኢዜማ ኢትዮጵያዊ አለ ሁሉ አለየውግ ህምራ ዞን ሰቆጣ ከተማ ኢዜማ አባል ደገፈ መጣ እሁድ ህዝባዊ ስብሰባ ተዘጋጀ ቅርብ የሀረር፣ድሬዳዋና ሀዋሳ ኢዜማ",
"በላ አህመድ ብልጽግና መረጠ ኢንተርሃምዌ ፈጠረ አለ በአውርቶ አደራ ፕሮፓጋንዳ ረጨ ጀመረ ጌታ መለስ ዜናዊ ልጅ",
"አለ ሺ እንግዲህ",
"ብልጽግና ፓርቲ ስኬት አብዮታዊ ዴሞክራሲያ በመገርሰሱ ሆነ ፌደራሊዝምን በአግባቡ መተግበር ኖረ ተነሳሽነት ላይ ሆነ አጋር ክልል አባል ተደረገ ጠራ ጅማሮ ነው",
"ፀረ ሙስሊም ነው እስኬ፥ ይህንን ልብ አወቀ እንኳን አበረ ደረሰ እስክንድር",
"ህይወት ወደደ መልካም ቀን አየ ፈለገ ሰው፥ ላሰ ክፉ ከንፈር ተንኮል ተናገረ ይከልክል፤ከክፉ ፈቀቅ ይበል፥ መልካም ያድርግ፥ ሰላም ሻ ይከተለውም፤ ጌታ አይን",
"አየ አሁን ራስ መለሰ ነው ይህ መልካም ነገር ተወራ ነውየሚያምርብህ ፖለቲካ ለፖለቲከኞች ተወ እኛ ሙያ መልካም ግዜ",
"ጣረ ጋረ ተገኘ ሀብት መሰለ",
"ይቅርታ ጠየቀ ብይ ጠበቀ ጭራሽ ተጃጃለ እንዴ ኤጭጭ",
"ደቡብ አፍሪካ የኢፌዴሪ ባለሙሉ ስልጣን አምባሳደር ክቡር ዶ/ር ሽፈራው ተክለማሪያም አደመ የእንኳን ደህና መጣ መልእክት አለፈ",
"እጃቸዉን ሰደደ ቻለ እኛ ደሞ አበረ ሰበረ ስም ቀይረዉ መጣ አረጋ ምድረ በሰበሰ አሮጌ ሽማግሌ ጥርቅም",
"ሰናይ መዓልቲ ህዳር ጽዮን ኣኽሱም",
"ሁላችንም የእግዚብሔርን ክብር አንኳሰናል፡፡ ንዴት እሱ ላይ ሌላ ነገር በመምረጥ፡፡ ባለማመስገን፣ እሱ አመነ ባለመታዘዝ፡፡",
"ይህ ሰው አለም ቀፈፈ ወንጀል ህግ ጠየቀ",
"እኔ ውሸት መሰለ ነበር ብልጽግና ኢዜማን ፈለገ ምርጫ ማግስት አመመ ሆነ ጠራ ውጤት መጣ ነው እስከዛ ግን ፎከረ ወይም ተቃወመ ፓርቲ",
"መጋቢ ሀዲ እሸት አለማየሁ ጠየቀ ገረመ ጥያቄ ዘር መረጠ ነዉ ወይ የተወለደዉ",
"ኢዜማ አለም ቀፈፈ ደጋፊ ማህበር ትዊተር ገጽ ተከተለ ድጋፍ አየ ማህበር ቀላቀለ",
"ቱልቱላ ሁላ ዘመን እቃ ፎከረ ንብንብ አሁን ታሪክ አልተማራችሁምገና ኤርትራ ህዝብ ጠራ አረገ አስተማረ ዶማ",
"ጣም ቦታ ሄደ ከተማ ሞላ እኛ ሆነ ነገር ነዉ ብቻ ሚዲያ ሰው ተሽለዉ ተገኘ ሲገባቸዉ ነገር ማራገባቸዉ ደስ አለ",
"ሺ እኔ ግብዣ ደስተኛ ነው",
"ዳቆኑ ቅጽበት ተረት ተረት ወደ ዲፕሎማትነት ሰላም ሰፈነ መለለ መጣ ቢቸና ጦጣ ተረከ ሆነ",
"መጣ ሪል ኢንጅነር ሆነ አለ ነው",
"ጠቀሰ ጠቀመ ሰዋ ሁሉ ሰማ ላይ ገብረ ምናምን አይጠፉውም ምን ሆነ",
"ጠፋ ትጉ ጸለየ ሶስተኛ አለም ጦርነት ጀመረ እንሆ ኵብኵብ ነው",
"ከፖሊተከኞች ጋረ ተደረገ ቃለመጠይቆች ወሰነ ተባለ ጉዳይ ላይ ፓርቲ አለ አቋም ህብረተሰብ ለመሳወቅ አገዘ አለ አለ እናምናለንለዚህም ነው ቃለመጠይቆችን አለ",
"ትምህርት መራ ካድሬ አይደለምን ትምህርት ሚኒስቴር ሀሰተኛ የአፈፃፀም ሪፖርት ካነ ተቋም አይደለምን ትምህርት ሪፎርም ስራ ገለልተኛ መከረ ተከናወነ በቀር",
"ሀገሬ ላቀ ለቻይናዉያን ምች ሆነ ሀገር",
"ድርጅት ጅብ ችኩል ቀንድ ነከሰ ሆነ ሰኔ ኋላ ጭጭ አለ",
"ወንድም እስክንድር ቦሌ እየር አረፈ ጠበቀ አለ ውድ ኢትዮጵያ ልጅ",
"ተመሰገነ እኛ ድምጽ ፈጠረ ተከተለ",
"ኢትዮጵያ ብሄራዊ ምርጫ ቦርድ መጣ አገራዊ ምርጫ እና ጊዜ ሰሌዳ ተመለከተ ምክክር ውይይት ተደረገ ተገኘ አሁን ውይይት ተደረገ አለ ምርጫ ጊዜ ሰሌዳ",
"ውሀ ቀዳ ውሀ መልስ ኢትዮጵያ ፖለቲካ ቀጥ አለ አጣ ይመለመላል ጎባጣ ሆነ እኮ ነገር",
"ወያኔ ከሲኒየርነትወርዳ ጁኒየር አጋር ፓርቲነት ሚና ተጫወተ ወሰነ ስትሰማgt አረጠ ደረሰ ሴት ወንድ መረጠ አይነት ነገር",
"እሷ ደገመ ደህና ሆነ ልበልህ' አለ ለየ",
"ጣም ጠራ ነውበተጨማሪም ምን ክልል ውጭ አለ ክልል ወለደ እና ደጋፊ ያዘ ተቻለ ጠራ ነው",
"ለተክለሃይማኖት ጻድቅ መጠነ ዝሀ ህማም ትዌድሶ ደብረሊባኖስ ገዳም ጻድቅ አቡነ ተክለሃይማኖት ጸሎት ምልጃ እኛ ጋረ ይህ እንኳን ደረሰ",
"ተመሰገነ ዘንድ ምክንያት ብዙ ነዉ እመቤት ድንግል ማርያም ናዝሬት ማርያም ቤተከርስቲያን",
"ትክክል ፊት ቀጠለ ብቻ ነው",
"ፀዲዬን ሰማ እስቲ መጣ ቀንደኛ ደነቀ ሆነ አደባባይ ካወጅኩ ሰንብቻለሁ አንግዲህ እና ሰይፍ ላይ ተወራ ድምጥ ራስ ሙዚቃ መሰለ ወዘወዘ ነበር አሪፍ",
"ኦሮምያ የደጋገዎች አገር ነው እንጂ ገታ ገታ ዲራማ ተካሄደ በት ክልል ነው",
"አንዳንድ እውነት ተራራ ፈነቀለ ወጣ",
"ነገር ላይ ኢትዮጲያ ትሪሊዮን ብር ብድር አለ ህዝብ ግን አየ ተበደረ እንጂ ተበደረ መሰለ",
"እሱ እኛ ጀግና ጀግና ነበር ትነኝጠግርእበ ዴንእ አሁን ፍርሀት ጊዜ ነው ውቸና ጊላፈስአ ንችቻኖላፕ",
"ንጹህ ብልጽግና",
"እውነት ነው መቲ እሱ ሰው ነው",
"አልበም ጠራ ሆነ አንድ ሆነ ብቻ አየ ኦቨር ሬትድ አለ ምን መጣ አርቲፊሻል እና ውሸታም ተባለ ሲንግሎቿ ረበበ አልበም እጅጉ",
"መድሀኒት ገዛ ሆነ ውጭ ምንዛሬ በአግባቡ አለ ሀገር ቻይና ቱርክ በገፍ መረተ ገና አባት' ተበዮውንና ራስ ህዝብ ባህል ባሰ ሚሊዮን ዶላር ፈሰሰ",
"ብድር አለቀ ችግር ግን ተበደረ ያንን ብድር ከፈለ ኢንቨስትመንት ሰራ ነበር ሁሌ ፕሮጀክት በእንጥልጥል ቀረ ከዛ ህዝብ ብዙ ግብር ከፈለ አለ ተጨነቀ",
"አዘነ ዜና የቤኒሻንጉል ጉሙዝ ክልል ምክር ቤት ከተማ ልማት፣ ንድግ፣ ኢንዱስትሪ ትራንስፖርት ፋይናንስ ጉዳይ ኮሚቴ ሰበሰበ ክቡር አቶ አብዱልሃይ ሶጃር ዛሬ ጠዋት ወደ",
"ማን ተቀየመ አንተ ዝም አለ ቀደደ እስኬ",
"ያ ህንጻ ጣልያን ግዜ ሰራ ከተማ ለየ ስለ ሆነ አለ ስጋት መነጨ ነው",
"ይሄን ያህል መብት ሰጠ መንግስት ነዉ ህግ ከለላዉ አራጅ ቄሮ ጀዋር ለሚመራዉ ቄሮ ይሄን ያህል ስልጣን ሰጠ አረደ ገደለ አለ መንግስት ነዉ",
"ለውጥ ለውጥ እኮ ብልጽግና ፓርቲ መሰረተ ሌላ አምባገነን ስርአት ገነባ ነው",
"በወሎዬዎቹ ቋንቋ ሁልሽም እኩል ነው አለ ነው",
"ቦታ መረጠ ግን ንዴት ነውክፍት ቦታ አለ መሀል ኣሰፋልቱ ሰራ ገባ ሓወልቱ ወደ ሱቅ ጣም ተጠጋ መሰራቱቱ ግራ ገባ",
"ሳይንስ ከፍተኛ ትምህርት ሚኒስቴር ሂሩት እና ቃል ተቀበለ አቶ ደቻሳ ጉሩሙ መጣ ነው ስልጣን ለቀቀ መጣ ስራ ሰራ ነው አለ ተስፋ ተደረገ",
"እውነት ነው",
"ደካማ የተረኝነት ስሜት አለ ጠባብ",
"ፈራ አለ ምክንያት ነው ሙሉ ድል ዲሞክራሲ",
"እኔ ሚመስለኝ ሆነ ተታለለ ምስኪን አማራ ጠላት ነው ወያኔ ጫነ ዘር አስተሳብህን ደበቀ አወቀ ብዙ ግዜ ሸውደህናል አሁን ነቃ ዘረኛ ነው",
"አየ ጎንደር ሰው አረደ ጀመረ መቶ ለመጠ ተባለ ሰው ገደለ ደመቀ ኰነነ ደግ ናንት ልጅ ግን ውጭ ነው አየ አማራ ክልል አሳፉሪዎች ነውረኛ አረ ነቃ ክ/ዘመን ነው አለነ እንደ ሰው ሳበ",
"አሜሪካ አዲስ ጠቀለለ ሾመ ነው ወይስ ማን ክብር ፖለቲካ ተደረገ አሜሪካ አንቺኮ ሸርሙጣ ነው",
"አመሰግናለው ትንሽ ስራ ሰጠ",
"ሺ ምን ያህል ጊዜ ወሰደ",
"አንዳንድ ጠገበ ከብት እንደ ሰው ቈጠረ አለ ቸገረ ነው",
"ጋሼ ሳምንታዊ ልምድ ተካፈለ ነው እውቀት ዛፍ እውቀት ሸመጠጠ",
"ክቡር ጠ/ሚ ዶ/ር በላ አህመድ እርስ ውስጥ አለ ኢትየያዊነት ሳበ እኔ ውሀ ጠማ ለየ መልካም ስብዕናዎ እና ቅንነት ሁሉ ተዳረሰ ብይ",
"አየ አመት ንኽደይ ሰላም ዘይበለ ቢአዱ ሰላም ንባዕሉ በር ሰላም ናይ ህዝቢ ዘደለና ዘለለ",
"ሁለት አሰረ ሁለት ሰላምታ ቀረበ አለ ነገረ",
"ስራ ፈለገ አወቀ እንጂ በትዊተር ወይም ፌስቡክ አወቀ መሰለ",
"ሶደሬ ስቶር ላይ ኢትዮጵያ ተገኘ ቤተሰቦቻቹህ ስጦታ እና እቃ ገዛ ቻለ ገዛ እቃ ኢትዮጵያ ተገኘ ሆነ ኢትዮጵያ ሆነ ደገመ አሜሪካ ወደ ኢትዮጵያ",
"አዉቄአለሁ ብይአለዉ ቪዲዬዉ ራስ ለጠፈ የዉሸት ነዉ ሰቀለ ላይ ቀረጸ ነዉ ሌላዉ አታክ አረግ አለ አማራ ብህሬተኝነትንና አማራ ነገስታት ምን",
"ገባ ሁሌም ከጎንህ ነው ቁርጥ ቀን ልጅ አስተዋዮ መራ",
"እኔ እመቤት ቋንቋዉን ተናገረ ወቀሰ የሚገባዉ አንቺ ቤተሰብ እንጂ ሲዳማ አለ ክልል ከበረ የነበረወስርአት ነው አንተ",
"ድር አበረ አንበሳ አስር",
"እና ይሄን ሄኖክ ሚባል ልጂ ሴት ዘር ሙሉ ነው ሚወደው አትይኝም እናት",
"ታሪክ የሚርሳ ህዝብ መጣ አለም ኖረ ቻለ አማርኛ ቅርጥፍጥፍ አረጋ በላ ኮሪያዊት ኮረዳ አማርኛ ተናገረ ቆሻሻ ጣለ ክልክል ነው አለ ነጣ ተመለከ ግል ት/ት ቤት",
"ልክ ፊት አጠቃላይ አገር ነበረ አመራር፤ የማስፈራራት፣ የአፈና፣ የማሰር፣ ተሰቃየ ግድያ ህግ ትግራይ ክልል ብቻ ቁርጠኝነት ቀጠለ",
"እቃ ፕሮፌሰር መራ አማራ ነፍጠኛ አለ ጥላቻ ቅስቀሳ ተደረገ እጅ ደም ተጨማለቀ ግለሰብ ጋረ ሰራ ሰማ አለ ነው ቈረጠ ገባ",
"አየ ቆጮ ቈረጠ ነው",
"ፌደራሊስ ሀይል ቀላቀለ ሀገር አሸባሪ ወይም ገነጠለ እንዶድ አጠበ ወደ ፌደራሊስ ሀይል ቀየረ ወይ",
"እሱ ቅርብ አየ አብሽር መስጊድ እና ቤተ ክርስቲያን ፈረሰ ቀጠለ ተቃጠለ ግን የእጃቸዉን ተገኘ",
"ኢራን ሰፈረ አጸፋ ምላሽ ሰጠ ቻለ ተነገረ ተገኘ ግድያ ትራምፕ ትእዛዝ ፈጸመ ፔንታጎን አወቀ",
"አፈረ ይህ ሀሳብ ቆመ ክፍለ ዘመን ሳበ እዕምሮ ጠበቀ ተራ ሀሳብ ነው",
"አለፈ አምስት አመት አካባቢ አማራ ክልል ሙዚየም ሰራ ባህል ቢሮ አሁን ጠራ ሄደ ነገር ግን ከእዚህ ኋላ መሬት ነካ ግድ አለ",
"ከህወሀት ቸኰለ ስብሰባ ምን አዲስ ነገር መጣ ያ ከዳተኛ አለ አዲስ ዜማ ብቻ ነውየትግራይ ድል ትግራይ ወጣት እጅ ነው",
"ይሄ እኩይ ሰው መልእክት አለፈ ይህ አማራ ክልል አለ ከፍተኛ ትምህርት ተቋም ወይን ሌላ ኦሮሚያ ከተማ በአብን የተጠነሰሰ ሴራ ጠበቀ",
"ሰላም አለ ሰላም ጽዮን ማርያም ግሸን ማርያም ሰማ ማርያም",
"ብሄራዊ ፈተና ሰራ ስህተት አሁን አንድ ብሄር ደገመ አዴፓ ከተማ አማራ ጥቅም ጠበቀ ከፍተኛ ወጣ መራ ክልል መጣ ሚዛናዊነት ጐደለ",
"እውነት ነው ሰማይ የሚታዮ ቀለማት፣ የግዛብሄር ቃልኪዳን ታይዶስ ከመይዶስ ኢትዮጵያዊ ሰው",
"ጠራ ሰው እኮ ነው ቅዳሜ ቅዳሜ ሁለት ቴኪላ ኋላ",
"መዉጣት ፈለገ ይሄ በሽተኛ",
"አህመዲን ጀበል የተባልው ጭሎ አሜሪካ ጸሎት ማድረግላይ ሆነ አንድ ቀን ጏንታናሞ ላከ አይቀሬ ነው",
"አለ ገልቹና ዳውድ ኢብሳ ኤርትራ ላይ እንኳን ሰማ",
"አንቺ ሰናይ",
"ኢትዮጵያ ጽሁፍ ጠቀመ ፡፡ ከእንግዲህ አስቂኝ ነው አንተ አካል ጠፋ ፡፡ ፊት ደም ፡፡ ፈሰሰ ተስፋ ቈረጠ ውስጥ አንድ",
"ጠቅላላ ይዘት ተስማማ ነገር ግን አማራ ትክሻ ብቻ ሆነ መላ ኢትዮጵያ ጭቁን የዋህ ሀገር ወዳድ ህዝብ ትክሻ ወረደ አበረ ሰራ ተቻቻለ ኢትዮጵያ አደገ ግድ አለ",
"ቀላል መሰለ ለመደ ጉዳት ረዳ ነገር ግን ተደረገ ጥቂት ሰራ ከባድ ክፉ ስራ ያሚያመጡ ራስ አየጎዱን አለ በሁለተናችን ሒወታችን ምሳሌ",
"ለአላህ አለ ይህ ታላቅ ሰው ከነዘህ አውሬ አደገ ገባ",
"ሲሳይ አጌና ጠጅ ቤት ከተሄደ ተገኘ ትርፍ ይህ ነው",
"ተመሰገነ ወንድማገኝ",
"አማራ ጠንካራ ባህል አለ መልካም አለ ጥበበኛ እንዲሁም ባለፀጋ ህዝብ ነዉ ዴቪድ ስታይመን",
"አንተ ራስ ደስታ ብቻ ዳመጠ ነፍሰ በላ ሀዲ ነው አማራ ልጅ ዩኒቨርስቲ ተሰቃየ ዝም እግዚኦ ጌታ ፈረደ",
"ህዳር ፊልም ደራሲ እና ዳይሬክተር ብሩክ ሞላ ጋረ ተደረገ ቆይታ",
"ጨቀጨቅሺኝ ነው አለ ሰሊ ጨከጨኩሽ",
"አልበም ቆንጆ ሆነ ነው አሁን ረሳ ሲንግሎቿ ግን አንድ ወይም ሁለት በቀር እጅ እጅ አለ ይዘት አለ ዛገ ስራ ነው ናደ ድሮ ስም",
"ህግ መልካም ነገር አየ አይን",
"ጀቤሳ ደሞ እዛ ሀይማኖት እስታኮ መርዝ ረጨ ነው ነደለ ተወ ግድ አለ አገር ግራ ገመደ ታገሰ ተወ",
"አንተ ጠራ ሰው ነው",
"ሁሌም ልክ ነው",
"ሌላ ሙስሊም ህ/ሰብ ጥያቄ ያነገቡ በአል ከበረ ቦታ፣ መቃብር ቦታ መፈክር ደመቀ መዳረሻዉ ቀበሌ መስጊድ ሆነ ኢትዮጵያ ስም ከፍ ተደረገ",
"በላ አህመድ ጀዎር እዝቄል እና ቀረ እንስሳ ሰማ ጎንደርቅማንትአማራኢትዮዺያ",
"ሀገር ውድቀት እና የዘረኝነቱም ተነሳ ራስ እምነት ማረ ላቀ ሌላ ሀይማኖት፣ ቋንቋ፣ ብሔር፣ ሰደበ እውቀት መሰለ",
"መዥገር አለ አንተ ዝንጅብል ራስ ድንቁርና አይን ጋረደ እንጂ ይህ ስድብ ዘመድ ጠራ ነው ሀያ ሰባት አመት ኢትዮጵያ ላይ ጠበቀ ደም መጣ ነበረ ተውሳክ",
"አንተ አይነት ዶማ ነው ሀገሪቷን መረዘ መርዝ አንተ አለ ተናገረ መሰለ",
"ሙዚቃ ምርጫ ቦታ እነ ኒሻኒዬ ሁሉ ማረ",
"ዘረኛ ተመቸ ኦሮሚያ ወጣ አለ ጽንፈኛ ጥላቻ እና መጣ ወጣ ምን አወቀ ሌባ ጠላ ቻለ",
"ጠበቀ አማራ ተቋም አንድ ሆነ አማራ ሜዲካል አክሲዮን ሸጠ ጀመረ ሁሉ አማራ ሙያ አቅም ደረጀ ሰራ አለ",
"ቀይ ውሸት አለ",
"ኢዜማ ባህርዳር ኢዜማ ባህርዳር ክፍለ ከተማ የአደረጃጀቱን አድማስ አሰፋ እና ጠነከረ ደንብ ሰራ ነው",
"ጣልያን ነካ አስቸጋሪ ነው",
"ብልጽግና ወደደ ድህነት ነፈሰ ወጋ",
"ምን ወር ተወራ ስራ ሰራ ወጣት ስሌት ሆነ ስሜት ስሌት ነዳ ሰው ነው ሀሳብ አለ ሁሌም አለቃቀሰ ግለሰብ ነው",
"መልስ እግዚያሔር ቅዱስ ነው አለ ፍጹም ነው አይሳሳትም፣ እውነተኛ፣ ጻድቅ ሩህሩህ፣ ቸር፣ ማህሪ፣ በጎ፣ ፍቅር ነው አለ ነው የእ/ር ባህሪ እርስ እርስ ገጨ",
"አሜሪካ ድምጽ ሀላፊነት ሞላ ሰራ ተከተለ ለማ ቃለ ምልልስ ወረደ ቀረበ ኢትዬጵያ ውስጥ ምን ፈጠረ ቻለ ደነበረ አወቀ እሱ ቃለ ምልልሱን",
"አደለ ደረሰ አወቀ ሆነ ወይ ሀይማኖት ለቀቀ እነሱ ጋረ አንድ ታቦት ሸና ሆነ ወይ ደገመ ጨቆናውን ለመደ አለ ነው",
"ወያኔ ይህ ጨቃኝ ስም ገላገለ ይህ ሆላ ተግባር ሰው ሆነ አየ ተስፋ ተደረገ ጠ/ሚ አቢይ",
"አብይ አሽከር ገረድ መሆናቹሁን ሁሉ አወቀ አሁን ግርድና አያውጣቹሁ ምድረ ጥንብ",
"በለጠ አሽቃባጭ ነው እንጂ ሆነ",
"ፖለቲካ ፓርቲ ህዝብ በጎ ፈቃደኝነት ተገለገለ ዝግጁ ሆነ በቃ መራ ፈለቀ ሆነ ቁጥር ውስን ጠንካራ ሆነ ወጣ ህግ መራ መንግስት ህዝብ ድጋፍ ፈለገ",
"ይህ ላይ ምን ደስታ አለ እኩልነት ጥያቂያቹህን ሰማ ህመማቹህን አከመ ተባለ ተሰሚነት ቀነሰ እና ወደ ሰፈር ሄደ ህምምምምም በረታ አያ የኔዘመን ምርጥ መራ",
"አፍሪካ ቀንድ ሰሜን ኢትዮጵያ ተገኘ ቅርንጫፍ ተባለ ጠራ የአጋንንቶች ጥርቅም ነው ይህ አሰቃቂ",
"ጆን ብዙ ግፍ አለ አለ",
"ብዙ አህመዲን ተቸ ዑስታዝ አህመዲን ጀበል አለ ሰማ ስም ፊት አለ 'ዑስታዝ' አለ አየ ብቻ እንኳንስ ተማረ ትምህርት ቤት ደጃፍ አለፈ መሰለ",
"ጣም መረቀ ጽሁፍ ይኼን ያህል ሄደ በዛ ላይ ገባ ግጥም ጉድ ገረመ",
"ክርስትያን ታደለ ማንነት ለየ ተረኛ ነው አለ ኦሮሞ ገዥዎች አሰረ ሆነ ግልጽ ነው ይህ ግፍ እና እብሪት አሰረ ሰው ነጻ ወጣ ትግል ቅድምያ ሰጠ ለኢዜማ",
"በወዲያ ሳለ መጣ ወዲህ ሰማ ላከ ዙፋን ነቀነቀ ቦታ ሳይናወጥ ወረደ ሁሉ ምሉዕ ሆነ ማህጸን ተጸነሰ ማህተመ ድንግልና ከፈተ ወለደ ቅዳሴ",
"ምን ስሜታዊ ሆነ",
"ምንድነው አፋር ባለሀብት አለ ኢትዮጵያዊ አለ በቃ",
"አንተ ተዘጋጀ የአነተም ጸጉር አለፈ ምነዉ አላየህዉም እንዴ ጸጉር ተመለጠ ጀመረ",
"ትክክለኛ እርምጃ ነው ይሄ ሌላ ዩኒቨርስቲ ቀጠለ አለ",
"ድንዙዞችን በለጠ ደነዘዘ ሄደ መንገድ ዛሬ ደረሰ እግዚአብሄር ግን ሰው ነው ሙስሊም ወለደ ሰበሰበ",
"አጉል ዝና",
"ፈራ አንተ ችግር ሀገር አለ ውስብስብ ሁኔታ በለጠ እናት ሀገር ወይም ሞት ተባለ አልነበረ እንዴ ማ ተታለለ ጀመረ አሁን ነው",
"እነሱ ምርጥ ክርክር መልስ አለ ፋቀ",
"እኔ ፅኑቃልፁ እንኳን ወለደ",
"ወንጀልሎኞችን ህግ ቀረበ አጠገብ አለ ወጣ ከመደንፍት ቈጠበ እውነት ህግ አለ አገር ሆነ ኖረ ሽመልስ አይነት መሀይም ስልጣን በረረ",
"አንተ እዉነት የሚትለዉ ቃል ጣም ሳቀ ደሞግሞ ጥላቻ እና ዘረኝት መቼ ነዉ እዉነት ሆነ",
"አሾፈ ብቻ",
"ትክክል ዎናውን ተፈጥሮ ህግ ሞላ ስለ ሌላ ህግ ቀባጠረ እንዴ",
"ምን ሆነ ተማረ የኢሀድግ ትውልድ ዞረ",
"ጀግና አየ ቦጋለ አሁን ተደረገ ገረመ ንግግር",
"ጀመረ ጨረሰ ሄደ አለ ሰይጣን አያሳስትህወገቡ ግን",
"ኸረ ተይኝ ስንት ትንኝ በረረ ቻለ እኮ ነው ግራ ገባ",
"ወገን እጅ አለ ወርቅ መዳብ ሆነ አስተዋለ ትህትና ቀለል አለ መጣ አናቃልለው ሸሸ ትልቅ፤ ምሁር ያልተማረ፤ ቀልደኛ ቁምነገረኛ እከሌ እከሌ አለ ከበረ",
"አንተ አይነት የተስፋፊነት አቀንቃኝ ከኢዜማ ጋረ መሳፈጥ ምን ጠቀመ ከብሄረተኞችም ጠላ ከኢዜማም ጠላ",
"ጠፋ ጠፋ እርከን ከሰሰ ማን አቤት ተባለ",
"የሸገር ልዩ ወሬበጦርነት እና ህመም ልጅ አጣ ጨው በረንዳ እማሆይ ጸሀይነሽ ሀይል አይን አጣ እንባ ብዛት ነው",
"ደመረ አላማ ሀገር አለፈ አመት መዘገበ ድል ጠበቀ ስህተት አረመ የመጻኢውን ትውልድ ጥቅም ረገጠ ነው አለ ክቡር አምባሳደር መድረክ ጋራ ሀገራዊ ጉዳይ",
"አንተ ነው",
"ሰሞን ብዙ ተደመመ አጠበ ጭቃ ሆነ ፖለቲካዊ ዜና ሰማ ቀረ አጃይብ ነው",
"ይህንበእስልምና ቀን ቋጠረ መሰረት ሀገር ሺ አመት ላይ ተገኘ",
"አቢሲኒያውያን ጨለንቆ ላይ መቶ ቈጠረ ሙስሊም ጨፈጨፈ ኋላ ሽንፈት ቆመ እውስ ሆነ እና ትውልድ ሞራል ሰበረ",
"በርካታ ህንጻወቹና መንፈሳዊ ጽሁፍ አንጻር ጊዜ ብዙ በጎ ታሪክ ረዳ ደነበረ ጠፋ ነው እርግጥ ነው፣ አለፈ ዘመን ውስጥ ጦርነት ነበር፣ ግን ደሞ ፍቅር",
"ቃል አሉታዊ ነው ብይ ነው",
"የነፍጠኛነት ልጅ እንጂ አባት ነፍጠኛ እኩልነትሲኦሉ ነው ምቀኝነት የአጉልየበላይነት ሥነልቦና ነው፤",
"እጅግ ታሪካዊ ቀን ነው እጅግ ከበረ ኦቦ ማ ረገጠ ነገር ኖረ ዶር በላ ንዴት አለ ከባድ ፈተና ውስጥ ብልጽግና ወለደ ብቻ ነው",
"ዲያቢሎስ ጠፋ ይህ መርዝ",
"መራ ተባለ ማረ ኣውቃለህኝ አለ ኤሪትራን እና ህዝብ ያለተማሩ እንደ ሀገር መብት መሰጠ ገባ ኤሪትራ ኢትዮጵያ ታታ ሆነ አለ ይላንል ራሲታዊ ቃል",
"ማ መገርሳ ሆይ ቀድሞ ወደደ ናሁሰናይ ከመቐለ ይህ አለ ነጥብ መልእክት ልኮልሃል፦ ጠበቀ ሙሉ ሙሉ አብይ ንኪኪ እና ትእዛዝ አፅዳ፡፡ ጥበቃ ጥንካሬ",
"እንደ እውነት ሆነ እርምጃ ጣም ነው ተደሰተ ሌላ እንዲህ ተደረገ ማን ተነሳ ተጨማለቀ ነበር ቴዲዬ",
"ፋራ መንደር ዱርዬ ስራ ፈታ አንተ ተከተለ አየ ምድረ ዱቄት እኛ ብዙ ስራ አለ ኮተት",
"ቀባ ህግ ፖለቲካ ላከ አሽቃባጭ መ/ቤት ሌላ ምን ስራ አለ",
"ገና ወጣ ዝማሬ ውስጥ ባረከ ድንቅ ዝማሬ ዜማ ክርስቶስ አማኑኤል አለ ነው ማረከ መንገድ ውብ",
"ጥያቄ ትምህርት ስርአት ወደቀ ክርር ዘረኝነት ከፋ ስራ አጥነት ድህነት አለም እጅግ ጠቀመ ቦታred ተገኘ ፖለቲካ",
"እንኳን ደህና ህዝብ መጣ ግን አንድ ነገር ጠየቀ ከታገቱት ልጃገረድች መሀል አንድ የርሶ ልጅ ሆነ ኖረ ይህ ያህል",
"ንስሀ ድል ሰጠ ጊዜ ገደብ ውስጥ ሆነ ጊዜ ጠቀመ ዳነ ግድ ነው",
"ተመሰገነ ለላካፈልከኝ እውቀትእውነት ካለዛሬ ሰማ",
"እኔ ወይን ግንድ ነው እናንተ ቅርንጫፍ ነው አለ እኔ ምን ተደረገ ቻለ እኔ ኖረ እኔ በእርሱ፥ እሱ ብዙ ፍሬ ፈራ",
"በረታ እስኪው ፍትህ እና እውነተኛ ዲሞክራሲ ፈለገ ሁሉ ከጎንህ ነው",
"አፍንጫ ጎራዳ ሆነ ጠየም አለ ትንሽ ከንፈርሽማ ወፈረ ጸጉር ከርደድ አለ እቃ አንቺማ ጋና ነው ነበር አለ ባርያው ወይም ሻንቆ ደገመ ቤት ስም",
"ደስ አለ ሌላ አለ ጋረ ጻፈ እጅ ባረከ አሰበ አእምሮ ክርስቶስ ጸጋ ሞላ ባረከ ይህ",
"ኢትዮጵያ እና ህዝብ ላይገና ቋጨ መከራ አለ ዶክተር አቢይ ብልጽግና ሰሜን ኢትዮጵያ ፖለቲከኞችን ርስ እርስ አና ከሰ ብኋላ ኢትዮጵያዊ ተሸማቀቀ ኢትዮጵያ ቀጠቀጠ",
"ውድ እኛ ብቸኛ",
"ኤልያስ ወሰደ አመት እንኳን ሄደ",
"ስብርብርሽ ወጣ የለ እነዴ እኔ አሰረ",
"ይህ ሥዩመ እግዚአብሔ ዘንጉሠነገሥት ኢትዮጵያ እኔ ላይ አሳር አለ ገሀድ እወጃ ጀመረ ያለኔ ኢትዮጵያ ኖረ ዝም አለ ደከመ አለ ነው ወይጊዜ ስንት",
"ታኬ ለታብሌት አለ ጎልማሳ ትምህርት ጀመረ ነው",
"እስክንድር ለፋውል አዲስ ሆነ ሞጣ ላይ ሰራ ፋውል ምክንያት ማንነት ፍንትው አለ አየ ጥላቻ መደብር ውልቅ አለ አለ ሰው በዛ ሆነ አየ ከባድ እና ቅቤ",
"ጉድ አለ ጎንደር አለ ይሄኔ ነው",
"አማራክልል የሕወሓትን ፋና ተከተለ ሙስሊም የማሳቀቅ፣ ጠላ መንፈሳዊ መብት ነጠቀ ስራ ሰራ ነው ይህ እብደት ምን መልክ ክልል ጠቀመ ተባለ አሰበ",
"የታይሊን ስዊፍት እርግማን ላይ ወደቀ ይህ እርስ እርግማን ሰይጣን በለጠ ጠንካራ እና መንገድ ላይ ቆመ ማንኛውም ሰው እብድ እና ህይወት በላ ፡፡",
"ማቲ ፤ኢየሱስም፡በይሁዳ፡ቤተ፡ልሔም፡በንጉሡ፡በሄሮድስ፡ዘመን፡በተወለደ፡ጊዜ፥እንሆ፥ሰብአ፡ ሰገል፦የተወለደው፡የአይሁድ፡ንጉሥ፡ወዴት፡ነው፧ኮከቡን፡በምሥራቅ፡አይተን፡ልንሰግድለት፡",
"ማን አባት ነው እሱ እንዲህ አለ ራስ አለ",
"ወደ አገር መለሰ ፈለገ",
"ሁሉ በጎ ነው አለፈ ደህና ሆነ",
"ይህ አለ ሰሞን ስህተት ላከ ሚልዮን ብር ባንክ ወሰደ ተረከበ የመቀለ ከተማ ነዋሪው ድርጊት ብዙ አጀብ ተሰኘ ገንዘብ ባለቤት ገንዘብ",
"ምን ቀጠለ ላቀ ኢዜማ ተባለ ጕብድድ ፓርቲ ምን ሰራ ነው ካደ አዲስ አበባ ህዝብ መጣ ምርጡኝ አለመ አደል",
"እንኳን ገና በአል ሰላም ደረሰ",
"እንዲህ ቅጥ አጣ አሰረ ፈረሰ አይነት አደረ አዲስ ችግኝ ተከሎ ለማ ሽር ጉድ ተባለ ጥንታዊ ደን ወደመ ድንጋይ ግንብ ቆመ",
"እንደተበላሽች ነው ነገረ ታዲያ እርሶ መራ ሀገር አለም አንድ ክፍል ሆነ ብቻ ሆነ የስለጠነ አገር ተቀመጠ መንገድ",
"ሆንግ ኮንግ ፈረንጅ አዲስ አመት ተቃውሞ ተቀበለ",
"ታድያ ቃየል ዳነ አቤል ገደለ መሰለ አማርኛ",
"ፈታ ስልክ ሌላ ንብረት ነገ ፈታ ብይ ተስፋ ተደረገ ተጨነቀ ሙሉ አመሰግናለሁ፤ፀሎታችሁ ሁለት ሰአት ተኩል ላይ አሰረ አድርጎኛል፡፡",
"ልዩ ጥቅም /ልዩ ዜጋ ሆነ ጥያቄ",
"መረራ ሌላ ምን ተባለ",
"እንዲህ እንግዳ ከበረ አበረ ኖረ ሙስሊም ከበረ ጠራ ነበር",
"ነው ተማረ እንጂ ሌላ ነው እውነት ህዝብ ላይ አለ ስሜት ሆነ ሰደደ መጣ ሲቀጥ እንዲህ አይነት ፖለቲካ ሀገር አጣ እንጂ አምስት ሳንቲም ጨመረ",
"ሁለት አለም እናት መሽረፍት አንድ እጅ አዲስ አበባ አረጋዊ እናት እንጀራ ጕርስ",
"ልዩ መንገድ እና እናንተ አንዳንድ ዝርዝር ወደደ እኔ ቻለ ሁሉ ተደረገ ምክንያት ወደደ ሙሉ ሙሉ ወደደ",
"እንድደውም ፕሮፓዛል ጻፈ እርዳታእየጠየቅን መያድ እናቆቁማለን ወይም ደገመ መያድ ቀጠረ ከፍተኛ ደሞዝ ተገኘ ተጋ እንጂ ወገን ጉድለት ውርደት አየ",
"ሁሌ ተስፋ ብቻ",
"ሰማ ስለ ኤርትራ የሰጠህው ቆሻሻ አስተሳሰብ ይቅሬታ ጠየቀ አልያ መዘዝ ብዙ ነው",
"ምርጫ ፊት ሰላም ረገጠ ዲሞክራሲያዊ መብት ፊት ኖረ መብት ከበረ ጨረሰ ምርጫ ወሰነ ጊዜ ረዘመ አለ ሰማ ተገኘ ቸር እንሰንብት",
"ሀዋሳ ዩኒቨርሲቲ ማረ መካከል ተነሳ ጸብ ተማረ ህይወት አለፈ ሰማ ትናንት ምሽት ዩኒቨርሲቲ ዋና ገባ ከሰተ ጸብ እኛ አመት ተፈጥሮ ሳይንስ ተማረ ሞተ",
"ቀላል ዘው አለ ገብ ግራ ገባ",
"አቢሲኒያውያን ጨለንቆ ላይ መቶ ቈጠረ ሙስሊም ጨፈጨፈ ኋላ ሽንፈት ቆመ እውስ ሆነ እና ትውልድ ሞራል ሰበረ ሀረር",
"እኛ እኮ ፈረንጅ በለጠ ዶሮ እንቁላል ዋጋ ብቻ ነው",
"አሜን ሰላም ቀን ሰላም ዘመን ሆነ",
"አልገልህምን ምን መጣ አለ አገር ሰው",
"ይሄ ደፋር ሰው አንጎል በኢቤይ ሸጠ ሞከረ ጉደኛ ሰውዬ ጨረሰ ሰማ ይህ ደረሰ",
"አሁን አሁን ህጻን ቈየ አደገ ለመደ መጥቷል፡፡ ሆነ ይህ ትንሽ ህጻን አለም ምን መሰለ መልካም ቆይታ፡፡",
"ወሎ ዩኒቨርሲቲ ፈጠረ ምንድነው",
"ቅዥታም አለ የኢትዮዽያ ህልውና በኢትዮዽያዊያኖች ላይ መሰረተ ነው",
"ባለአደራ ከፍተኛ ስልጣን ፍላጎት አለ ሰበሰበ መሰለ እስክንድር ጣም ሳተ ሰው ጣም በሆደሞች ከበበ",
"ምን ድል",
"ይህ አለ ማረ ተወ አለ ፕሮክተር ጩቤ ወግተዋል፣የፀጥታ ሀይል ደብድበዋልመማር ፈለገ ቆመ ነው ተበጀ",
"እኔ ለሃገሪቷ ስለትምህት ሰላም፣ ጤና መሰረተ ልማት ውጭ ጉዳይ ወዘተ ይሄን ፖሊሲ ያዘ መጣ አለ ፓርቲ ወግ ነው ናፈቀ አነሰ",
"እኔ አባት ናደ እናንተ እኔ አል እኔ እናንተ ናደ በዚያን ቀን አወቀ ትእዛዝ እሱ ዘንድ አለ እሱ ጠበቀ እሱ ወደደ እሱ ነው",
"አለፈ ማክሰኞ ባግዳድ ተገኘ አሜሪካ ኤምባሲ ላይ ጥቃት ደረሰ ወዲህ ቀጠና ጸጥታ ደፈረሰ እየተስተዋለ ሆነ አሜሪካ ወደ ስፍራ ደረሰ ኮማንዶዎችን ላከ",
"uhናቸው አለ ሰባ ደመቀ መኮንን ሳበ አወቀ እንዴ ሆነ",
"ስብሰባ ተጠነቀቀ ክልል ጉስቁልና ቀጣይነት ረገጠ አቅጣጫ አስቀመጠ ምንጭ፦ የጉስቁልና ፓርቲ",
"አየ ኢትዮጵያ ስንት ተጭበረበረ ትምህርት ረዳ ላቀ ባለስልጣን ሲሆን፤ ይህ ደገመ ተማረ በቃ እውቀት ኖረ ጎዳና ላይ ወደቀ አዘነ",
"ምን ሰላም እና ፍቅር መጣ አንተ ተዘወረ",
"አለ አለ አለ ቅእት ብሄር እኛ ሰው ክፉ ነው ገጨ ከእግዜር",
"ሁሉ ደከመ ሰው ተናገረ ዘንድ አይችልም፥ አየ አየ አይጠግብም፥ ጆሮ ሰማ መክብብ ፩፰",
"ምን ገባ ትግራይ ትግራይ ህዝብ ጠቀመ መንገድ ነው ሰራ ያለበትኣጨብጫቢ ነው",
"አሜን አሜን አሜን እግዚአብሄር ተመሰገነ አሜን አሜን አሜን",
"ማር ዘፈን ላይ አንድ ሳቀ ግጥም አለ እረሳሁት እንጂ",
"ሆነ በአል መጣ ቁጥር በየ ጣቢያ አለፈ ባንክ ቸከ አወቀ አሰለቸነ፡፡ ሚሊየኑም ህዝብ ያለደያስፖራው እርጥባን በአል ከበረ ቻለ እኮ ነው መሰለ",
"አሜን አሜን አሜን እኔ መልካም እንኳን ደረሰ",
"ወይ አልጠቆርን ወይ አልቀላን ምን ተሻለ",
"እኔ ምግባር ደካማ ሆኛለሁ// እዘኝልኝ ድንግል እለምንሻለሁ// ያንን እሳት ባህር አየ አደራ ዳረ ድንግል ስም ስጠራ// ዳዊት መስንቆ ኤልያስ መና የናሆሞ",
"እግጅ ጣም ዓይነ ወጣ ይሏል ይህ ነውህወህት ንብረት ኢትዮጵያ ህዝብ ፈረደ ተመቸ አመት ነውየተመዘበረው አንዳንድ የህወሀት",
"ጀመረ አጭበርባሪ ነው ፈሰሰ ጫጫ ተንቀጠቀጠ ተጭበረበረ",
"",
"ማ መገርሳ መድረክ ላይ ሆነ ውህደት አስፈላጊ አይደለም፤ ደመረ እሳቤ አያስኬድም አለ አማራጭ አየ",
"አወቀ ፊዚከር ፕሮፌሰር ክራውስ ደቡብ አፍሪካዊ ቡሽሪም ይህ ካሜሮናዊው ሀበሻ ሚስት አለ ነብይ አለ ነው ሁለት ሌባ ነው አለ",
"ወደ ኤፌሶን እንግዲህ እንደ ጥበበኛ እንጂ ጥበብ ሌላ ሆነ ንዴት መለሰ ጥንቃቄ ተጠበቁ፤ ቀን ክፉ ነው ዘመን ዋጁ ይህ",
"በረታ አቢቹ ለታማኑት እግዚአብሄር አመነ ነው",
"ሴት ይሄኔ የወደፊት በአል ድንግል ሴት ነው ማገባው አለ ሳበ ሆነ",
"ይህ አለም አማርኛ ጣም ጨከነ መሰለ ጣም አዘነ",
"እኔማ እኮ እቃ ሺቲ ተደረገ ሴት ወይም ስለ ድሬ/ሀረር ሆነ አሪፍ ነገር ተናገረ ሳለ ሰፈሯን/ሰፈሩን ነው ጠየቀ",
"ታህሳስ ለበዓለ ብስራት እንኳን ደረሰ እመቤት ጠማ ውሻ ወርቅ ጫማ ጠጣ ቅዱስ ገብርኤል ትፀንሻለሽ አለ ብስራት ድንግል ጀመረ ጊዜ",
"ሰሊናዬ አሁን ይሄን ምን አለ እናት",
"የእምዬ ምኒሊክ አምላክ ስነ ልቦናዬ ከፍታ ማማ ላይየተሰቀለ አልቃሻ ሆነ ኰራ አማራ ነው",
"እብራዊ መልእክት ክፍል ማረ ደቂቃ በኃላ በዩቲዩብ አየር ላይ ሆነ መልካም አዲስ አመት",
"ለመላዉ ኦርቶዶክስ ተዋህዶ እምነት ተከታይ ሙሉ አማራ ክልል ማረ/ቤቶች ኮሚሽን እንኳን ለዓ/ም ገና በአል ሰላም ደረሰ",
"ብሪታኒያ ቀጣና የሚስተዋለውን ውጥረት ረገበ ኢራቅ ባለስልጣን አሰበ",
"ስራ ነው",
"እራሴን ገደለ ነው",
"እኔ እምነት ተቀጣጠለ ሰአት አየ ጠፋ አንድ ባልዲ ውሀ እንኳን ተቀበለ ለየ ዳር ዳር ሄደ እና ልክ ሰአት ጠፋ ኋላ ሀዘን ገለጸ አስመሳይ ስብስብ ኖረ ኢዜማ ነው",
"ደርግ ዘመን ሁሉ ነገር ወደ ጦር ግንባር ተባለ ሰማ አደገ አሁን ደገመ ኢኮኖሚ ዘርፍ ሁሉ ሀብት ወደ አዲስ አበባ ተባለ ነው ይሀው አሁን ደገመ አለ ሀብት",
"እኔ ሌላ አሳር አለ ክርር ቡድን ዶ/ር መሀሪ ታደሰ እምነት ጴንጤ ሆነ ምን ባህር ዳር ከንቲባ ሆነ አለ አጼ ጊዜ ነበረ አንድ ሀገር አንድ እምነት ቅዠት",
"አዲስ አበባ ህዝብ ካደ ሰለቸ ሰው ብርሀን ነጋ ፕ/ር ብረሃኑ ነጋ አሁን አለ አዲስ አበባ ጥያቄ ረባ ነው አለ ቱቦ አፍ",
"ሰው አለ ነው በጎ ተመኘ በጎ ተገኘ",
"እኔ ጓደኛ ነበር ስረድ ጉርደያኪስእ ልብምጭ አሁን ፍርሀት ጊዜ ነው ኝሩገን ኔባ ለስ",
"ካፒታል ጋዜጣ ቀድሞ ሰራተኛ ጋዜጠኛ ተስፋ ጌትነት ክስ ተመሰረተበት፡፡",
"ኢራናውያን ለኢታማጆር ሾመ ገደለ ሰጠ አለ ምላሽ ተደመመ አገራዊ ስሜት ደነቀ እውነት አገር አለ ሰው ነው",
"ለከት አጣ አልጠግብ አይነት ፈራ ዘረኝነት ትእቢት እና ድንቁርና ደረጀ ቡድን ዛሬ ከፋ ክፉ ቀን መጣ ይህ ከፋ መጣ ሆነ ነገ ንዴት አረገ ሆነ ወዴትስ ሆነ",
"እግዚአብሄር ቀረ አለ ግን ፊደል ፊደል ከፍተኛ ሁኔታ ፈራ ፡፡ አነሰ አለ ሀፍረተ ቢስ አጋንንት ነው እና አደገኛ ነው ጨመቀ",
"መልካም በአል መልካም",
"ተባበረ አማራ በጎ አድራጎት ድርጅት መሰረተ ድርጀቱ አማራ ክልል እና ክልል ውጭ አለ አማራ ሰብአዊ እና ዴሞክራሲያዊ መብት ጣሰ ታገለ አለፈ",
"ውድ ደንበኛችን፤ እባክዎ አገልግሎት ቁጥር መልእክት ይላኩልን፤ ፈጣን ምላሽ እንሰጥዎታለን፡፡ ተመሰገነ",
"መልካም ክርስቶስ ልደት በአል",
"ቄራ ገባ በሬ ሰሜን ሄደ ወታደር ኢይመለስም ተባለ አያ",
"ወጣ እስከ ጠለቀ እግዚአብሄር ስም ተመሰገነ ይህ አባት ቅዱስ አማኑኤል በያለንበት ጠበቀ ሁላችሁም በያላችሁበት ቀደሰ በራ ደስ አለ ቀን",
"ጤነኛ ሆነ አንዳንድ ተጠረጠረ",
"ትግራይ መንግስት እና ገዛ ድርጅት በኦሮሞ፣ አማራ እና ደቡብ ዩኒቨርስቲ ፈጸመ አለ ግድያ፣ ጭፍጨፋ እና ገታ ጋረ ማረ ምን ተጽእኖ አደረ ነው ይህ",
"ቡና ወደደ ሙሉ እንኳን ደስስስ አለ እቃ እኔ ማቱሳላን ነው ሆነ ፈለገ",
"አዲስ አበባ ወንጀለኛ ምች ሆነ ህዝብ ፍራቻ ጊዜ ክትት አለ ነው እነ ሞተር ሳይክልም ሙንጨፋ ጀመረ ፖሊስ ብዛት ሳይሆ ጠራ ፈለገ",
"በርካታ ገና በአል ከበረ ወደ ቅዱስ ላሊበላ እየተጉዋዙ ነው እንግዳ ኢትዮጵያዊ ሰው አክባሪነት ወግ እግር አጠበ ተቀበለ ነው ነጭ እግር ጠባ ነው",
"እኔ ደገመ ጣም እሰጋለው",
"ገደለ እስስት ድሀ ደም እንደፈስሰ",
"ለእዳንተ አይነት ጠባብ ለጠፈ ውለታ ቀረ",
"መልካም ልደት",
"አማራ ፈተና አለቀ የሕወሓት ሽማግሌ እድሜ አጠረ ብቻ ነው፡፡እነሱ ህይወት አለ አማራ ህዝብ ጠፋ ተለቀ አቀደ ሴራ ጐነጐነ አረፈ",
"ሀሳብ ተሸነፈ ሰላማዊ መንገድ ተቀበለ ስልጣኔ ገለጸ ነውየኃይማኖት መራ",
"እኔ ተቃራኒ ነው",
"አንድ ጊዜ በጋ ብቸኛ በጋ ወቅት ኪሳዋን ሴት ጓደኛ ተገኘ እንዲሁም ደስተኛ ህይወት ኖረ እንዲሁም ብዙ ልጅ ኖረ ፡፡ ታሪክ",
"ሞጣ ተገኘ አራት መስጅዶች እና በርካታ የህዝበ ሙስሊም ንብረት ደረሰ የሽብርጠ ጥቃት ምክንያት ድሬዳዋ ነዋሪዎች ቁጣ ገለጸ ሙሉ ተቃውሞ",
"ወደደ በኢትዮጲያዊነቱ ደረደረ በብዙሃኑ ካርድ መረጠ ህዝባዊ መራ ኖረ አለ ነገር ሙሉ ትተገበራለች ህልውና ጉዳይ ሆነ ስለአጎብዳጆች ተጨነቀ መጣ ቀረ ጠቀመ",
"ሰው ፈቀደ መኪና ወንበር ላይ ሰው አስቀመጠ አለ ጀለስ ፍቅር አለ ቻለ አለ ግራ ገባ ነገር",
"ምናልባትም ክልል ሰላማዊ ሰልፍ አበረ እና አይን ቀለም ማረ ሙስሊም አሰረ ይችላሉ፧ «መስጊድና ሱቅ ቀጠለ ክርስትና መዝሙር ዘመረ ሁሉ ሰው",
"መልካም ነገር ተረጐመ በርካታ አማራጭ አለ ወንድም አንደበት ወጣ ቃል ክፉ መነዘረ ኡመር አየ አል ኸጧብ ረዐ",
"ለበሰ ብርሀን ልጅ ቅድስት ድንግል ማርያም ሆይ ቀደሰ",
"ክብርት ሚንስተር ይህ መልእክት ተላለፈ ሰው ሆነ ብቻ በቃ ነው¡¡¡",
"ይኼ ሰው ምንድነው",
"ዶ/ር አበይ በጊኒ ዋና ከተማ ኮናክሪ ተገኘ ልማት ቦታ ገብኝተዋል",
"ጥበብ ይናፍቀኝል፣ ተቻቻለ ኖረ ህዝብ ያስቀናኛል፣ ድንቁርና ያስፈራኛል፣ ጦርነት ጠላ ጋሽ ሎሬት ጸጋ ገብረ መድህን",
"ኧረ እኔ ልጅ ነኝአዋቂዎች ተወራ ዞር ነው አለ",
"ጥንብ ዘረኛ አውሬ ጠፋ ይህ መርዝ",
"ጤፍ እንጀራ ኢንተርናሽናል ሆነ ነወ ለካ አናት ላይ የወጣዉ በላ እናንተ ነው",
"እግዚአብሄር እረኛ ነው፥ አጣ ለም ለመለመ መስክ ያሳድረኛል፤ እረፍት ውሀ ዘንድ መራ ነፍስ መለሳት፥ ስለ ስም ጽድቅ መንገድ መራ ሞት",
"ህዳር ኦሮሚያ ክልል ፈጠረ ነበረ ግጭት ተሳተፈ አለ ተጠረጠረ ቁጥጥር ስር ዋለ ግለሰብ መካከል በቱ ላይ ክስ መሰረተ",
"አዎ አየ ይህ አመነ ጠራ ነው ነገረ አማራ ስም ነገደ ኦነግ ሆነ ቀጠለ ደሞ",
"አናናስ ጤና ጠራ ነው",
"ኢትዮጵያ ጎረቤት ሀገር አለፈ ሁለት አመት ነጥብ ሚሊዮን አሜሪካ ዶላር ሀይል ሽያጭ ተገኘ ኢትዮጵያ ኤሌክትሪክ ሀይል አወቀ",
"ዛፍ ተከላ ቀን ጥብስ ቅጠል የተከላቹ ሰው ግን ነብሳችሁ ማረ",
"የጋዜጠኝነትን ስነምግባር ምር ተከተለ ሰራ ጣረ ሚዲያ ተቋም ምርጫ ሂደት ውስጥ አወቀ ይህ አወቀ ፎከረ ፓርቲ ጠቀመ ሆነ ከፍተኛ",
"በእየሱስ ስም እና ስልጣን እግዚአብሄር ይገስፅህ ሰይጣን እቅድ ለማ ፈረሰ ይህ እቺን ልጅ ሳተ መጣ ነፈሰ ወጋውህ",
"ንፍጣም ተሸክመከው ዞረ ጥንብ ርካሽ",
"ውስጥ መስመር ፋሲል እነማን ረዳ ከፈተ ጎፈንድሚ አለ እሱ እርዳና ሊንኩን ፖስት ተደረገ አለ አንድ ልጅ አየ እኔ የጎርጊስ ሳንጃ ደጋፊ ነው አለ ሙልጭ ተደረገ",
"ሆይ አፈር ትቢያ ሆነ ሳለ ጻድቅ ተደረገ ቈጠረ ሰው አባ እንጦንስ",
"አገር ወደ ብልጽግና መራ ተደረገ መልካም ጥረት ሁሉ ፈጠረ ባረከ ከጎንዎ ነው",
"ጀመረ እብድ",
"ምን ላይ ይህ ምርጫ ቶሎ ሆነ ተመኘ ላቀ ተስፋ ያለኝ፣ሕዝባችን አዴፓ ከተባል ገልቱ ቡድን ሰላም ለቀቀ ጨረሰ ምእራፍ ሆነ አሰበ ነው",
"ሲዳማ እና ደቡብ ክልል መካከል ተደረገ አለ ስልጣን ሽግግር ሆነ ተባለ ህዝብ ግልጽ ሆነ ምክንያት ጐተተ ነው ስልጣን ሽግግር ቀጠለ ጥቅት ቀና ውስጥ",
"ልዩ ሆነ አፍሪካ ልጅ ተረት ጻፈ ተረጐመ አወቀ ብዙ አፍሪካዊ በጎፈቃደኞች እኛ ቀላቀለ አለ አለ እምነት አለ",
"አጃቢ ነው አለ ሀረር ሰው ኢትዮጽያ እንዲህ አይነት የተሽጠ መራ እጅ ወደቀ ራስ ኢትማዦር ሹም ገደለ ብቸኛ መራ በላ አህመድ ብቻ ነው መቸም አገር መቀመቅ ውስጥ",
"ማ መገርሳ ሆይ ቀድሞ ወደደ ናሁሰናይ ከመቐለ ይህ አለ ነጥብ መልእክት ልኮልሃል፦ ጠበቀ ሙሉ ሙሉ አብይ ንኪኪ እና ትእዛዝ አፅዳ፡፡ ጥበቃ ጥንካሬ ሶስት እጥፍ",
"ሰንሰለት ጠመጠመ ያዘ ማህበረሰባዊ ጉራ ተወገደ በስተቀር ማህበረሰባዊ ለውጥ ፈጠረ ቻለ ስልጣኔ ራስ ሰጠ ግምት አከለ ጀመረ",
"እኔ አህመዲን ጀበል ነው ባህርዳር ተካሄደ አለ ሰልፍ ላይ",
"ዎላይታ ራስ ቻለ ክልል ሆነ ወጣ አለ ሌላ አማራጭ ላይ አቢይ ለመወያየት ሀሳብ ቀረበ ተሳተፈ ይሁንታ ተገኘ ቀረ ዞን ደቡብ ክልል ምክር ቤት መልስ",
"ጥያቄ አለ ጣም ምርጥ ስራ ነው",
"ፕሬዝዳንት ኧሁሩ ኬንያታ ቤተሰብ ድርጅት ሆነ ብሩክ ሳይድ ኬንያ ቁጥር አንድ ወተት ቀረበ ተቋም ነውአዲሱ ህግ ፕሬዝዳንት ቤተሰብ ድርጅት ጠቀመ ተደረገ",
"ናደ ትንሽ አፈረ እኛ ሰረቀ አለ ተናገረ አፈረ ወጣ አለ እስቲ አከባቢውን ቃኘ ሌባ አጭበርባሪ ሰፉሪ ቀማኛ ማን ሆነ ቁልጭ አለ አየ",
"ሰው ግን እንደዚ አይነት ምስቅልቅል ውስጥ ሆነ እንደዚ ዘና አለ ይሄ ፈጠረ ነው",
"ወስላታ ማጭብርበር መጣ ሰራ ድህነት ተሸነፈ እግዚአብሄር ፍቃድ ሆነ ማን ቆመ ቻለ ግድብ የኢትዮጵይ ኢትዮጵያ ሆነ ማን",
"አለ አወቀ ቀረ በላቸው",
"ምን ተስካራቸዉን በቁማቸዉ እያበላተዉ ነዉ የሚመስለዉ",
"ያለው መንግስት አሃዳዊ ነው አለ እንኳን እኔ ጸር ፌድራሊስት ነው ነዉ የምላቸዉ ጠቀለለ ምንስትሩ አርአያ አጼ ሚኒሊክ እና አጼ ሀይለስላሴ ናቸዉ",
"ትምህርት ክፍል አለ ታግቼ ነበረ ደምቢዶሎ ዩኒቨርስቲ የngineering አንደኛ አመት ተማረ ነው አለ ጎንደሬ ንዴት ነው ደህና ነው ንዴት ነው",
"ኢትዮጽያ ውስጥ አለ ፖለቲካ ፋሽን ትግራይ ጠላ ጠላ ነው ገረመ ሰው ከበረ ሞተ ዘረፈ ፈነቀለ ኖረ አለ ትግራይ ውስጥ ብቻ ነው ያ ትምህርት",
"መልካም ዜና አልሀምዱሊላህ አላህ ቀረ ሰላም ወለደ ጋረ ቀላቀለ",
"ተኛ ሰው ነው አደል አደረ",
"",
"ይህ ምርጥ ውይይት አመለጠ",
"ነው ሀብታም እንዲህ አለ ኢትዮጵያ ተከላከለ አማራ ክልል ወደ ወለጋ ተዘወረ ንብርት ተዘዋወረ ነው አለ ከዚ ላይ መዝቀጥ ምን አለለገዛ ወንድም ክብር",
"ተመሰገነ ይሄ ስርአት አልበኝነት ገታ ግን ነገ ዋስትና ለም",
"ከእንግዲህ ቀረ አንድ ነገር ነው እሱ በኢትዮጵያዊነት ላይ ቀረ ተባለ ወንጀል ሰራ መቀሌ ደበቀ ኢትዮጵያ አመሰ አለ ወያኔን ተባበረ እጅ ወደ አይቀሬው",
"ቀበረ ብቻ ሆነ ከእምዬ ኢትዮጵያ አፈር ቆሻሻ ተወገደ አለ",
"ነጣ ተረተ አለ እኛ ሊሂቃን ስለ ኢትዮጲያችን ባሰብንአገራችን ብሄር ሀይማኖት ከፈለ ምትገኝ",
"አንድ ቀን ዶላር ተስበስቧ ገባ ወደ አድጔል ምስጋና ተዋህዶ ልጅ እኛ አበረ እንኳን የተዋዶን እንባ አገር ኢትዮጵያ እንባ ባሰ በረታ",
"ተስፋው ገና ብዙ አማራ አረደ ነዉ ጃዋር ተባለ ወንጀለኛ ያጠፋቸዉ ነፍስ ፍትህ ተሻለ ተጠያቂነት ሸሸ ተደረገ ተግባር ብርቱ ትግል ከሸፈ ይህ",
"አንተ የምኒሊክ ሰፈረ የት ሆነ ነው መለሰ አህያ ጎንደር ተሰብስበ ነው ቀይ ባህር መለሰ ታበየ ወንዝ መሰለ ባተ",
"ውይኔ ዲግሪ ገዛ ሁላ እየተጋለጠ ነው",
"ታኬ እንኳን ደስ አለ መድን ታሪክ አየ ስፖርት ጤንነት ወዳጅነት ሰላም አንድነት ብልጽግና",
"ዲሞክራሲ እስኬዉ ብርቱ ሰው",
"አባ ቦራ ምርጥ እና አመነ ነው፥ በላ ደገመ እንደ ግመል ሸፋፋ ነው አለ ነው",
"ቆሻሻ ይሄ ሀዲ",
"ኦሮሚያ ክልል ህግ ስርአት ሰፈነ አልተቻለም፤ ብዙ ኦሮሚያ አካባቢ ባለስልጣን ግድያ እለት ተዕለት ዜና ነው፤ ማ ትኩሳት ላይ ሰቅሎታል፤ ጠማ",
"ምግብ ቤት መሰለ እኮ፣ ዝርክርክ",
"/ስለዚህ ከበረ ጠ/ሚንስትራችንን ፊት ሁሉ ነገር አላህ ረዳ",
"ማንኛውም ይህ አይነት አመክንዮ ጭራሽ ተቀባይነት አለ መንግስት ተባለ ከወዲሁ አወቀ ኢትዮጵያ ልዑላዊነት እና ጥቁር አፍሪካ መብት",
"እስክንድር ሀገር ወደ ከፍተኛ ብጥብጥ ጨመረ ደንብ ሰራ ነው አካሄደ ተበላሸ ነው",
"ይሄንን ውሻ ሰው አለ ትፖስታለህ መብት ነው ግን",
"መንግስት አለ አገር ታዲያ ምን ተደረገ",
"አስር ሺ ላይ ህዝብ ተሳተፈ ክሊፕ ገባ አለ ሸዋ አሁን ለቀቀ",
"ጀግና ለውጥ መሀንዲስ ገና ብዙ ህልም መሰለ አዳዲ ኩነቶችን አየ ተመሰገነ",
"አንቺ ምን ወደደ ግልጽ ነው ሀንተነህን ብሎክ ተደረገ ግን ግራየተጋባ ውሳኔ ነው",
"ሶስተኛ ወንበር ላይ ሶስት ተቀመጠ ሄደ እኔ ላይ ምስኪን ለም",
"ውህዱ ፓርቲ ህዝብ ዘንድ አመነ ተቀባይነት ከውልደቱ ጀመረ እንዲያገኛ ከሰመ ላይ አለ ግንባር ግንባር መሰረተ መንግስት ፈጸመ ህፀፃች",
"ምን ጀመረ ነዉ ታሪክ ማበዛ ፎቶ ካሜራ ነዉ በሽታ ወረኛ",
"እንደ አንድ ሀገር ወደደ ዜጋ ቀጣይ ኢትዮጵያ ምርጫ ኢትዮጵያዊ ጥቅም ቆመ ጠንካራ መንግስት መሰረተ ምኞት ነውኢትዮጵያውያን መረጠ ዜጋ ማገለገል ግዴታ",
"ደህና እግዚአብሄር ተመሰገነ እኔ ጣም ደህና ነኝ፡፡ ቤተሰብ ሁሉ ሰላም",
"እና እርምጃ ወሰደ ተጠቃ ሙስሊም ማህበረሰብ ላይ ነው አንዳንድ ሎጂክህን ልብ ወለቀ እንዴ ሙስሊም መረጠ ሱቅ በተዘረፈበት፣",
"አበረ አሰረ ሆነ አንቺ በለጠ ጐዳ ጠበል አማኑኤል አእምሮ ህክምና ምናምን ፈለገ",
"ርዥም እድሜ ጤና ይስጦዎት ክቡር ጠቀለለ ሚንስተር",
"ክፉ ልማድ ነው ግን እውነት",
"እንግዲያውስ እርማችሁን አውጡ፣ ነው ቀይባህር ኩሬ ተገኘ እኛ ኣክቲቪስት ዘርአይ ደረስ ጋዜጠኛ መራ ነገራ ሰጠ መልስ ነው",
"ሆነ ንብረት ተወገደ አገር ኢኮኖሚያዊ ጠቀሜታ መጣ ፊት ወ/ሮ ጽዋ ሙሉነህ፣ መንግስት ግዥ ንብረት ተወገደ አገልግሎት ዋና ዳይሬክተር",
"እስክንድር አላማ «ሐሰተኛ ዲሞክራሲ» ሆነ አመነ ሰው በዛ ነው መሰል ፓርቲ «ባልደራስ እውነተኛ ዴሞክራሲ» አለ «ነይ አልበላሽም» አለ አንበሳ",
"አርቴታ ስራ ጀመረ አወቀ",
"ሁሉ ቅድምያ ዜጋ ደህንነት ረገጠ የታገቱትን ዜጋ መንግስት በአሉት አማራጭ ሁሉ ጠቀመ ቤተሰብ ሰላም መለሰ መንገድ ፈለገ ቦታ ሰማ ሞት ዜና",
"ይህ ነዋ ተኛ ተነሳ ብር ካርድ አለቀ እሁድ ቀን በራ ዋለ",
"ቱለማ አባ ገዳ ጎበና ሆላ ገለልተኛ ሆነ ህዝብ ተገለገለ ግዴታ ሀላፊነት መወጣትባለመቻሉ ስልጣን ገፈፈ ተደረገ አባ ገዳውየህዝቡን ሆነ መንግስት ተልእኮ",
"ሁለት ልክ የለሾች ወግ",
"የታገቱ ደምቢዶሎ ዩኚቨርሲቲ ማረ ደህንነት አሁን አስጊ ሁኔታ ላይ ተገኘ ከለከለ ሰራዊት ክፍለጦር አወቀ",
"አህመዲን ሞጣ ነበር አለ ጀመረ ጊዜ ቀጠፈ ቀሲስ ኤፍሬም እሸት",
"ደስ፡ሲል፡ሱዳኖች፡ ሌላ፡አለም፡ላይ፡ናቸው",
"አሜን ይህ ንጹሀን ህጻን ደም ጎርፍ ሆነ በላ ይህ ጅብ",
"ልኡል እግዚአብሄር አንተ ጋረ ይህ ድል ድል ኢትዮጵያ",
"አዲስ መኮንን በዘይቤያቸው፣ ህዝብ ግንኙነታቸው፣ በነገረሥራቸው ሁሉ ንጉሰ ነገሥት ኃ/ሥላሴን መሰለ እኮ ነው ጋጠ አቤት ተቃርኖ ብዛት ግርማዊነታቸውን",
"ለእራሳቸው ጥይት የፀርሳቸው ህዝብ ነው እኮ ታሜ ጉራ መከራ ግን ኢትዮጵያ ጤፍ ኖረ እርሀብተኞች ነው እኮ",
"አለም ዙሪያ ቆንጆ",
"ኦሮሞ ክልል ሽብር ፈረሰ መሬት ፋፋ ሽብር መሬት ጠበበ ብቻ ነው እንጂ ልማት ነው ልማት ፈላጊ ሆነ ኖረ ጀመረ ኦሮሚያ ክልል አለም ኖረ ፈረሰ",
"ጋምቤላ ጎግ ወረዳ ከባድ ዝናብ ጣለ ኋላ ታታ ሀይቅ መጠን ላይ ሞላ ፈሰሰ ላይ ማረ ትምህርት ተቋርጧል፤ አረሰ አደራ ማሳ አበላሽቷል፤ ለነዋሪዎች",
"ኢትዮጵያ ኤሌክትሪክ አገልግሎት መጣ ገና በአል ከሰተ ቻለ ሀይል ቈረጠ መዋዠቅን ቀነሰ ከሰተ አፋጣኝ ምላሽ ሰጠ ቻለ ዝግጅት ተደረገ ላይ",
"ተጨማሪ ፌዴራል ስርአት አለፈ አመት ተግባራዊ ተደረገ በርካታ በጎ ውጤት መዘገበ ቻለ በማብራራት፤ ነገር ግን ሂደት ለየ ውስንነት ነበረ",
"አዲስ አበባ ላይ ለውጥ መጣ የሚሰሩት፣ ሰበታ ቡራዩ እና ለገጣፎ ላይ ተካሄደ እውቅ ሰጠ ኢትዮጵያ ሱስ ደህና ነው",
"ደነቀ እኚህ ንቁ አባት፣ ያኔ ድሮ ገና ይሄን ሁሉ ቦታ ብቻ አየ ሀሳብ ነደፈ ጻፈ አስቀመጠ ይህ ቀረጻ ኋላ ራስ ብዙ ጽፈዋል፤",
"ፍትህ ላይ አብይ መንግስት ተቸ ይታወቀል",
"",
"ኢትዮጵያ ጠቀለለ ሚኒስትር ሰላም አለ ሰላም ኣውርጂለው በማለተቸው ከሰሰ እነሱ ታታ አለ ወጣ ታታ ኣለ፡፡",
"ግድያ አማራ ክልል ገታ እውነት ሆነ ወለጋ ነበር ራስ ወገን ላይ ፈጸመ ምናምን አለ ራስ ውሸት ሌላ መጋት እና",
"እግዚአብሄር አምላክ ይህ ቀደሰ ክብር በቃ አሜን",
"ማላዘን ብቻ",
"አሁን አንቺ ሴት ነው ጥንባታም ዘረኛ መርዝ ረጨ ባለጌ አደገ በደለ",
"ትግል ፍሬ ጀመረ እነ ክርስትያንን ፈታ ቻለ ጥንካሬ ኖረ ነውእና እናንተ ተመለከተ ተነጋገረ ጫና ተደረገ ለቀቀ ተደረገ አለባችሁከጀርባችሁ ህዝብ አለ",
"እኔ ጥበብ ስራ ደገፈ ሆነ እኔ እኔ ምን ነው አመመ ጥፋት ረገመ ነው ፡፡",
"አማራ እና አፋር ክልል ፕሬዝዳንት ትብብር ስምምነት ፈረመ",
"ፓርቲ በጀት ዘነጋ ነው",
"መጣ ሰው አበደ በስተቀር ጨመረ ገዛ ለም ያ ክልከላ አለ ሆነ አኔ አሰበ አስካሁን ደረሰ ገባ አየር አየበከሉ",
"ምንድነው ግን እንዲ",
"ቀነበረ ዘፈን ነው ግጥም እሱ ነው ዘፈነ ደገመ ልኡል ሀይል ተባለ",
"ህወሓት «ኢህአዴግ በክህደት ነዉ የፈረሰዉ» የህወሓት ጉባኤተኞች እሁድ መሸ አስቸኳይ ስብሰባ ተጠነቀቀ ወጣ አቋም ገለጸ ኢህአዴግ 'በክህደት' ፈረሰ ብልጽግና ተባለ ፓርቲ",
"ክልል ግንኙነት ላይ ትኵር ረቂቅ አዋጅ ላይ ለመወያየት ህዝብ ወከለ ምክር ቤት ህግ ፍትህ ዴሞክራሲያ ጉዳይ ቆመ ኮሚቴ ጠራ ቀረበ አንድ ክልል ወከለ",
"ሚሰማ ተገኘ ቁልፍ ይህ ነበር",
"መልካም ዕድልሲል አውሮፕላን ሞተር ውስጥ ሳንቲም ወረወረ ግለሰብ ቀጣ ሰፈረ እንቅስቃሴ አወከ አለ ፖሊስ ለቀቀ እስር ቈየ ጉዳይ ሲቪል ኬስ አየ",
"ትክክል ተሸነፈ አሁን ሆነ አሻንጉሊት እንጂ መራ ነው አለ ሳበ ኢትዮጵያ ጀመረ እውቀት ነጻ ሆነ መራ ተባለ በላ ነዉ",
"አራት ኪሎ ብዙ ኢትዯጵያውያን ሌላ ደነዘዘ እጽ ሰበብ አሰረ",
"ውይ እኛ እባክህ ሌላ ምር ስቃይ ላይ አለ ኢትዩጵያዊ አደገ ምር አዘነ አለ ነው",
"ብቻ ነው ብየ አወቀ አመነ እኔ ለቀቀ እግዚአብሄር ነው ጠባቂ ተነሳ መድርሻዬ ከቴዲ ሱፍ መዝሙር",
"ሞተ ምን ተደረገ ነው",
"አማራ ባንክ የሼር ሽያጭ ተጠነቀቀ አራት ቀናቶች ብቻ ቀረ ምን ያህሎቻችሁ አወቀ አለ ቀረ ቀና ታሪካዊ አሻራ አረፈ",
"ልመና ጀመረ ላይ ትእዛዝ ወጥቶአል፥",
"ደነቀ ነው ሺ ስለ ፕሬዝደንት ነጋሶ ሾመ ተናገረ መጽሀፍ አነበበ ሰው እግረ መንገድ ረገጠ ሸጋ ነበር",
"እነኳን ኢትዮጵያ ብርሀን ሀዲ ሀዋርያ ቅዱስ አቡነ ተክለ ሀይማኖት አመታዊ በአል ደረሰ ይህች የምትመለከትዋት ድንጋይ ታህሳስ ቀን ዓ/ም ህጻን ፍስሀ ጺዮን",
"መርዝ ጠባብ ዘረኛ ዲያቢሎስ ሴይጣናም ሬሳ ነው ነጣ ከብት ጥንብ ዘረኛ",
"ገረመ ራስ ሲያበለፅግ የከረመ የእንብላው ስብስብ ስም ቀየረ አዲስ ሱፍ ለበሰ ብልጽግና አለ ከች አገር ቀና",
"ባንዳ ብዙ መልክ አለውየዘመናችን ባንዳዎች፣ለ ፍርፋሪ ጕብድድ አገር ጥቅም አለፈ የሚሸጡ፣የከፈላቸውን መጤ ወረረ ባህል ህዝብ ላይ የሚጭኑ፣ፌሚንስት ምናምን አለ",
"ምን ሰራ አየ ከቄሮ ጋረ ተደርበውወ ህዝብ ተሰቃየ በስተቀር ምሳሌ የክርስትያኖችን አንገት ማህተብ ወለቀ እምነት ተገለገለ ከምእምናኑ ላይ",
"ሰው ተሻለ ሆነ ብዙ ተጨነቀ ነገር ግን ትናንት ማንነት ተሻለ ሰው ሆነ ብዙ ጣረ መልካም ቀን",
"አማራ ሙስሊም ቈረጠ ከአማራነት ሙስሊምነት በለጠ እኛ አህመዲን ጀበል ነው ሉሙጡን ባንዲራ ሽቅንጥር ጣለ",
"ዳንኤል ክብረት ሁሉ ፌዴራሊስት ሀይል አስተሳሰብ ጠል ነው ሀይማኖት ተወራ ትክክል ነው",
"ከንቱ ነገር ነህእስቲ ጠጣ ሳበ",
"ትክክል አህመዲን ጀበል ሀይማኖት ጭምብል ተደረገ የኦነግ ኢትዮጵያ እስልምና ቋጠረ ህልም ነው ደገመ ኦነግ ወሎ ቈጠረ ነደፈ",
"ብቸኛ ቻለ ነገር ማይክ ያዘ ማይክ ተወራ ነው ወዮ ይህ ምፅዋተኛ አመነ",
"ኢትዮጵያ ውስጥ ሆነ አለ ሰው ሰፈረ ስኖው ዘነበ እንዴ",
"ምርጫ ዴያሰፓራው ላይ ሆነ ነዋ",
"ህግ በአግባቡ ከበረ ቻለ ይህ ከንቱ ምኞት ሆነ",
"ለለውጥለዕድገት ስራ አለ ፍላጎት ተግባር ነው ገረመ ሁኔታ ብዙ ነገር ቀየረ ነው ደስ አለ በረታ ደገፈ ከንቲባ የለወጥ ሰው",
"ዳዊት መለሰ ምርጥ ሰው ሁሌም ዘፈን እኮ አዲስ ነው ጥንቅ አለ ለፋ ሰራ መጣ ሆነ አዲስ አልበም ሚያወጣው",
"ጨረሰ ይህ ሰአት ተደሰተ ቻለ",
"ሁላችንም ጋራ ነጻ ወጣ ነው ኢትዮጵያ ውስጥ ነጻነት ሰፈነ ሁላችንም እኩል ጠቀመ ተደረገ ስርአት መሰረተ ነው ርትኡነት ሰፈነ ሁሉ እኩል ዳኘ ስርአት ሰፈነ ነው ፍትህ የምትጸናው",
"አዘነ ታሪክ ጉድ ተደረገ ፌደራል ፖሊስነት ወደ እስራኤል ዳነ ቸርች ካዳሚነት",
"ኢትዮጵያ ህዝብ ሁሉ ኢትዮጵያ ባንኮች፡ ልዩ ተደረገ ባንክ ውጪ የተላከሏትን ገንዘብ ተቀበለ ሽልማት ተገኘ አጣ ቀረበ ነው",
"ስፖርት ውድድር ውጤት ግመታ ቤቲንግ ውድድር እና ማህበራዊ ቀውስ",
"በረት ወለደ ጌታ ይህ ሰላም ደስታ",
"ቢኒ በእርግጠኝነት እሷ ሀሳብ ይሄ ነው",
"ተግባር ሰው ሀይል",
"የጃፓናዊ ብርቱካን ጭማቂ ወደደ",
"ጸረአማራ ሀይል",
"ኢትዬጲያ አሁን ሰአት ሚያስፈልጋት ችግር እና ክፋተት ብቻ አየ ሆነ አማራጭ እና ተሻለ የመፋትሄ ሀሳብ ሚያቀርብ ነው ችግርማ በሳ ነው መፋትሄ ነዉ አጠረ",
"እውነት ራስ ሆነ ነው",
"ብዙ አሰበ መልካም ጠራ ተፈፃሚነት አለ እግዚአብሄር አለ ብቻ ነው",
"እንኳን እመቤት ቅድስት ድንግል ማርያም ክብረበዓል ደረሰ",
"ባረከ እረ ነገረ እንዴ አነሳ አረጋ ጽድቅ ነዉ ምነዉ ሙስሊም አማራ ፈነቀለ ምነዉ ሙስሊም አማራ ቤታቸዉን",
"አነሰ ቀዳ ሴራ በላ ኦነግና እነ ቁዘማ ኢዜማ ሰባ ቀና ፊት እስክንድር ነጋ ባልደራስ",
"ውሸት ሰለቸ እውነት ሆነ ሚዲያ አየ ድምጽ ሆነ አለ ህዝብ ተዘናጋ",
"ነጣ መንገድ ላይ አየ ጥቁር ጥቁር ጥቁር አለ አለ ነው አፈረ",
"ኢትዮዽያ እሴት ሰንሰለት ልማት ላይ በማተኮር፣ አምስት ሚሊዮን አርሶአደር ገባ እጥፍ አደገ አቀደ የገበያመር ኳተ ገጠም ግብርና ልማት ፕሮጀክት ስፋት መጀመሩን፣ ፕ/ት",
"አንተ ምን አለ ጠበቀ መንግስት ሌላ ሺ ግን ቀን ሞት ነው",
"ችግር መሰረት ፈታ ነው ወጣ ለበሰ ጠቀመ",
"እኔ ቤት እንደዚ ሞቅ ሞቅ",
"እቺ ፈረስ አገር ውስጥ አታሞይም እውነት ረዥም ሰው ልብ ወይም ሱሪ አጠረ",
"አአ አለ ሰፈረ ነገር አንድ ቆሻሻ ሆነ ሁለተኛ ደገመ ትራፊክ ችግር ነው እኔ ሁለት ችግር አሁን ችግር ሆነ ቀጠለ ምክንያት",
"ኤጀንሲ ጋረ ልጣመይ ላኋበ መርከብ ፊት ወረወረ ፊት ትዎነ ውሰ ቅልት",
"አዲስ አበባ ከተማ አመት አማካይ ላይ ሰው እብድ ውሻ በሽታ ህይወት አጣ ኢትዮጵያ ህብረተሰብ ጤና ኢንስቲትዩት አስታወቀ፡፡ ተጨማሪ አመት አማካይ",
"ያሬድ ጥበብ መርዝ በረከት ስምኦን ኋላ አሁን አለቀ",
"ትራንስፖርት ቀረበ ጥረት ተቸግረናል፡ አዲስ አበባ ከተማ ነዋሪዎች አዲስ አበባ ከተማ ትራንስፖርት ጥረት ጊዜ ወደ ጊዜ ተባ መጣ ከተማ ነዋሪዎች",
"ደንብ ረዳ ፡፡ ኡራቻን መልካም ልደት",
"ንዴት አንድ ላቀ ህዝብ አንድ ግለሰብ ነጻ ወጣ አለ ተኛ ጠበቀ",
"ስህተት ስህተት አረመ ተቻለ እውነት ከሆነ፣ ሀገር ብዙኃን ተገናዘበ ነው ካፒታሊዝም ሎዲንግ",
"ኸረ እባክህን ጊዜ አለፈ ቂል ለቅሶ መለሰ መላልሶህን ተወ ጻፈ መኪና አደጋ ነው ሀሳብ አየ",
"ግብር ማጭበርበር ሆነ አበደ",
"ሀሳብ ለየ እኮ ቀሽት ነው ለየ ሀሳብ አለ ዘጋ ምን ተወያዩት እኔ አንተ ያልተቦላለክነው ገባ መጣ ሆነ ከበረ መሰለ",
"በኢትዮጲያ ፌመዝ ሆነ ሚጠበቅብህ አንድ እና አንድ ነው፡ እሱ ደገመ ስለ ኤሪትራን፡ባህር በር ወይም ኣሰብ ዘባረቀ ይኖርበሃል",
"ቻለ እንደ እኔ ቆንጆ ኖረ አለ ዘፈነ ልጅ እና እንደ ቤቲ ነው",
"አብቹ እኔ ጀግና ኖረ ከበረ ፈጠረ አምላክ መረጠ ማን ጣለ ቻለ ፈጠረ ከፍ ተደረገ ማን ዝቅ ተደረገ ቻለ አሁን አምላክ ከፍ ከፍ ተደረገ ዝቅ",
"ወኔ ኖረ እኛ ጋረ ምን ሰራ",
"ጠባብነት ዋለ እውቀት ጋረደ ህዝቅኤል ይች ሀገር ሁሉ ሆነ አወቀ ፍጹም ቻለ ተማረ መረቀ ራስ ባህርይ ለውጥ መጣ",
"አንዳንድ ሰው አጨቀየኽውማለት ለመደ ንዴት መልካም ነበርኧረ ቦካ አይነት አለ",
"መቶ ቀና እንኳን መፍትሄ ሀሳብ ቀረበ ቀረ ችግር ራስ ለየ በቃ ሆነ ህዝብ ጋረ አወቀ ችግር ዳመጠ ራስ ጊዜ ወሰደ",
"ማ ለሚኮ አብቹ ለሚኮ ትላንት አንድ ሳንቲም ገጽታ ሆነ አየ ፈጠረ ህዝብ ዘንድ ወደደ ቀና ነበረ እውነት ሰይጣን",
"ነት ጭቆና ጠየቀ እሱ መጽሀፍ ቅዱስ",
"አለ ሹራብ ደረት ላይ አነበበ ከይሲ ምን አለጉች ጉች አለ ኖረ ግን ከበደ",
"የተጨዋቾች እርስ እርስ ግንኙነት እና ደገፈ ባህል፤ ከታክቲክ እውቀት በለጠ አንድ ቡድ ውስጥ ላቀ ድርሻ ይዎስዳል ፋሲል ከነማ ተጨዋቾች/ አሰልጣኝ መካከል አለ",
"ክቡር ጠቀለለ ሚኒስትር ጽ/ቤት መጣ አቶ ዮናስ ዘውድ ስለ ደመረ ጽንሰ ሀሳብ ማብራሪያ ሰጠ አቶ ዮናስ ገለጸ ደመረ ከተተ ሆነ መሰናሰልን መሰረት ተደረገ",
"እኔ እምነት አለ ራስ ድንጋይ ላይ እንደተከመረ አር አዎ የአረኛ አይነምድር ቁመና ላይ ተደረገ ለሃጩን ቀባ",
"ጠ/ር ዶክተር በላ ዛሬ ወላይታ ሀገር ሽማግሌ እና ወላይታ ዞን ማህበረሰብ ወከለ ጋረ ውይይት አካሄደ ውይይት ወላይታ ህዝብ ጥያቄ አካባቢ ወቅት ጨበጠ ሁኔታ ዙሪያ ሆነ መረቀ በረታ ነበር",
"ወንድ ልጅ ደበቀ ነበር አለቀሰ ሙስሊም አማራ ወንድሜ፡አክራሪው የፋፀሙትን የመስጅዱ ቀጠሎ ብቻ ሰይሆን ክልል መንግስት፡ፖሊስ ጸጥታ ክፍል እኔ ነው አለ ማከዱ ነው የስለቀሰው",
"ፈለገ ትክክለኛ ፓርቲ ኦሮሞ ህዝብ ፍላጎት ሞላ ኦሮሞ ወከለ ደመረ ቲዮሪ ኦሮሞ ህዝብ ማ መገርሳ ቀነሰ ወቅት ጠበቀ ሰለጠነ የጋርዮሽ አስተሳሰብ ነው",
"ወደ ዕብራውያንebrews እግዚአብሄር ቃል ህያው ነውና፥ የሚሠራም፥ ሁለት አፍ አለ ሰይፍ ሁሉ ላቀ ሳለ ነው፥ ነፍስ ነፈሰ ጅማት ቅልጥም",
"እሁድ ሰአት ኋላ ነው ነገ ራስ ማድረግ፣ ትናንት ተሞርክዘው ፊት ተስፈነጠረ ፈለገ ነገ ሀገር ተስፋ ሆነ ወጣት በሞሽን መከረ ስልጠና ማእከል ውስጥ ከተመ",
"ህይወት ባከነ ህይወት እንደ እርስ አስከፊ ይህ ጭራሽ ደስታ ተገኘ ፡፡",
"ይህንነዉ ህዝብ ሰማ የሚፈልገዉ መንግስት ህዝብ ደህንነት ጠበቀ ነዉ ወይ ለሚለዉ መልስ አስቸኳይ ተገኘ አለበትጥቅሙ ህዝብ ያረጋጋል፣ መንግስት ስራዉን",
"አንድ እውነት እነግራቹሃለው ብልጽግና ተባለ አብይ ምርጫ ቀን ፊት ፈረሰ ሀቅ",
"ብዙ ደስ /ሉቃስ ፩፲፬/ ቅዱስ ደግ አቡነ ተክለሃይማኖት ታህሳስ ፳፬ ወለደ አባት ረድኤት በረከት አማላጅነት ፈጠረ",
"አዎ ፀረ ሙስሊም ነክ",
"አዲስ አመት በዲፈረንት ሞከረ ብይ ነው",
"ሌብነትን፡ሙሳናን፣ያለ፡እውቀት፡ስልጣን፡መያዝን፣ዋልታ፡እረገጥ፡አስተሰብን፣ልግመኛነትን፣ከሚፀየፈው፡አብይ፡ጋር፡ወደፊት",
"የአውስትራልያው እሳት አደጋ አሁን ሆነ እሳት አደጋ ሰራተኛ ህይወት ቀጠፈ እንዲህ ልብስ ጭምር ወለቀ ልብስ እንሰሳ ነብስ ዳነ ራስ ህይወት ሌላ",
"ወይ ጊዜ ጣለ እንደዚ ድክርት ፍዝዝ ድንዝዝ ሰው ደም እንባ አብ ፈረደ ገና መጣ",
"ኢትዮጵያ ስጋት ድህነት ነጻ ተደረገ ፉክክር ፋይዳ",
"በዘረኝነት ነፈሰ ያዘ ሰው እንዲሁ ነው",
"ተራ ዜጋ ሆነ ቀርቶ፤ ባለተራ ዜጋ ሆነ ዘመን ሆነ ምኞት ጽኑ",
"እግዚአብሄር ተመሰገነ ልፋት ከንቱ ሆነ ቀረ ከጎናችን ይነበራሁ ግለሰብ እና ድርጅት ፈጠረ ከበረ",
"አህመዲን ጀበል ትናንት ተደረገ ቃለ ምልልስ ራስ ጠቀመ ስም አለ ገባ ጠፋ ጠመደ ደብተራ ተነሳ ብዙ ዘንድ ጥርስ ነከሰ ነበር አሁን ግን በርካታ ግለሰብ እውነታ ግል",
"አስደሳች እና የበለፀገ አዲስ አመት ወደ አዲስ ጅማሬ",
"ጎፍታ ኪያ እስኪ ገና ጠመቀ ስዋ ላይ አንድ ሁለት ብርጭቆ ፉት አለ ያኔ ምን ገባ ይገለጥልሃል አያ ጋረ",
"«የግብርናውን ዘርፍ ፌደራል እስከታችኛው መዋቅር ደረሰ አለ ግብርና መራ ባለሙያ ግብርና ጋረ ምን ግንኙነት አለ ትምህርት ተማረ ናቸው» አማንይኹን",
"ምሳሌ 'የሁሉ' ስህተት ነው 'የኹሉ' ትክክለኛ ጻፈ ነው",
"ንሕመይለና ወደደ ከሽረ እና መቀለ እንደርታ ፍቅር ሆነ በስተቀር ሶስት ነጥብ ሚባል ለም ዲቻ ሽረ ወልቅጤ መእንደርታ ኤማ ወልዋሎ ኣዮኩም",
"ሌባ ደረቅ",
"ማረረ ላሰ ነዋ፣ ማረረ ጤና ጠቀመ ነው፣ ሎል",
"አሜንአሜንአሜን እንኳን አበረ ደረሰ",
"ምን ንክ ብዙ ተስፋ ቈረጠ ነገር አየ ተስፋ ለመለመ እንጂ ከሰመ ምክንያት ፍልሚያ ሰው መካከል ሆነ እውነት ውሸት",
"አንተ መታ ሰከነ ሚትፅፈዉ ሁሉ",
"መጣ ዋለ መልካም አይደል፣እዚ ገጽ ላይ ጻፈ እርሶን ጨመረ አምባሳዳር እራሴንም ለየ ሆነ ነው፣ያለንበት አገር ለየ ባይገርመኝም፣የሁላችን",
"ጣም ትክክል ያሬዶ ጣም ታሪካዊ ሰው እኮ",
"መልካም እድል ሁሌም ኢትዮጵያ ተመኘ",
"ዩኒቨርስቲ ዘጋ አለ ብይ ነው አመነ ምክንያት መንግስት ተማረ ደህንነት ጠበቀ ግዴታ ስላለበት፤ አለፈ ዩኒቨርስቲ ውጭ ዜጋ ደህንነት ጠበቀ",
"ደብዳቤ ጻፈ ብቻ ነው ቀረ በሉኛ",
"ሺ",
"ሰው ፈጠራ ወር አገር ተተራመሰ ዝም አለ ገባ ኡስታዝ አህመዲን ጀበል ሙስሊም መፍትሄ ፈለገ ኮሚቴ ህዝብ ግንኙነት ሀላፊ",
"አዋሽ ፈሰሰ ቈላ አካባቢ ቈላ ስንዴ ልማት ተካሄደ ነው",
"ሚስት ፍቅር ያዘ አለ አሁን ምን ጩቤ ያስመዝዛል አበረ አደረ ነገረ እኮ",
"ዜጋ ድህንነት ጠበቀ ቻለ መንግስት፤ ካሜራ አትክልት ውሀ ጠጣ የነዚ ሁሉ ንጹሀን ዜጋ ደም እጅ ላይ ነው",
"ለእትዮጵያ አንድነት፣በቀለም ጾታ ሀይማኖት ብሄር ከፈለ አበረ ፊት ተጓዘ ፣ተያይዞ ወደ ብልጽግና ጉዞ",
"ርኩስ ነፈሰ",
"አቶ ማ መገርሳ ክርር ብሔርተኝነት ኤርሚያስ ለገሰ አጋለጠ",
"ይህ ሁሉ መሀል ግን ንዴት እንዲህ ሆነ አለ ጥያቄ አነሳ መልስ መለሰ አለ መካከል ስምምነት አጣ ሳበ",
"ስራ በአግባቡ ወጣ ነው",
"ሩስያ ላም ጭንቀት ቀነሰ ቴክኖሎጂ ገጠመ",
"ጣም እጅጉ የናፈቅሺኝ ልጅ መልካም አዲስ አመት አንቺ እናት አያት",
"ጥልቅ ፍቅር ነዉ",
"በታገቱት ማረ ጉዳይ ላይ ጠቀለለ ሚኒስቴር ጽህፈት ቤት ዛሬ መሸ ሰአት ላይ ላይ ገለጸ ሰጠ ሳይንስ ከፍተኛ ትምህርት ሚኒስቴር ሚንስትር ዲኤታ ሳሙኤል ክፍል",
"ሽብር ወንጀል ተከላከለ ቈጠረ ቀረበ ረቂቅ ህግ ህዝብ ወከለ ምክር ቤት ፀደቀ፡፡",
"ምርጫ ወረቀት አተመ ዱባይ አገር አለ ኩባንያ ይህ ፊት በኡጋንዳ፣በኬኒያና ለየ አካባቢ ፈጸመ ግድፈት ምርጫ ዘባ በመፍጠር፣በፍርድ ቤት የተከሰሰ፣",
"መንግስት የትኛው መንገድ ጠቀመ አስቸኳይ የታገቱ ማረ ነጻ ወጣ ጠየቀ",
"ትናንት በኬኒያ ላም ዳርቻ ጦር ሰፈር ፈጸመ ጥቃት አሜሪካዊ ገደለ",
"መጣ ሆነ ስለ ኢትዮጵያ መልካም ዜና ሰማ",
"ብሄር ተምርጦ ገደለ ኦሮሞ ብቻ ነው ይሄን ጥያቄ ለጅዋር እንጂ ለታኬ ጠየቀ እሱ ሳተ ዘር ጥላቻ ሆነ ክልል ማረ ገደለ",
"እስክንድር ለፋውል አዲስ ሆነ ሞጣ ላይ ሰራ ፋውል ምክንያት ማንነት ፍንትው አለ አየ ጥላቻ መደብር ውልቅ አለ አለ ሰው በዛ ሆነ አየ ከባድ እና ቅቤ አሸ የማይችል፣",
"ህግ አዋጅ ቁጥር አንቀጽ መሰረት ቀላል ኢትዮጵያዊ ተደረገ ተቻለ ኢትዮጵያዊ ዜጋ ነው አለ እሱ ሀገር ፖለቲካ ውስጥ በረረ ሞከረ ክህደት ነው",
"ገንዘብ አለ ሰው ሀይል አለ የአአ ዙሪያ ገበሬ ንዴት መሬት ነጠቀ በተነ ታቃለህ ሊያ መሬት ብሄረሰብ ነው በሚበልበት ሀገር",
"ጋሞ ዞን ክልል ሆነ ጥያቄ ደቡብ ክልል ምክር ቤት ቀረበ በተቀመጠዉ ጊዜ ገደብ አንድ አመት ዉሳኔ ተገኘ ጋሞ ዞን ምክር ቤት ፌዴሬሽን ምክር ቤት ቅሬታ",
"ክቡር ከንቲባ ጥቆማ ናቀ ወሰደ አለ እርምጃ ሊድንቅ ገባ",
"ማን ብይ ጠራ አንተ ጉማሬ ፊት",
"ገዳዮች፡ ስንት ትከፍሉናላቹ ገደለ ሙሉ ትምህርት እዳቹን ገደለ ውለታቹን ገደለ ከፈለ",
"በእግዚያቢሄር ስራ እስኪ ገባ አንተ ርኩስ",
"በርካታ ገና በአል ከበረ ወደ ቅዱስ ላሊበላ እየተጉዋዙ ነው እንግዳ ኢትዮጵያዊ ሰው አክባሪነት ወግ እግር አጠበ ተቀበለ ነው ነጭ እግር ጠባ ነው",
"ፈሳም ላይ ጀመረ ጠራ ነበር",
"አይናውጣ አፋኝነት አናርኪዝም ነገሰ አሁን ምን አለ ነገር ነው ሰበሰበ ደረጀ መብት አፈነ ነጻ ፍትሀዊ ምርጫ ተደረገ አለ ቀልደኛ",
"ህዋሃት ልክ እንደ አሮጌ መኪና ጎማ ነው ምን ጠቀመ ልብ አጠበ ሳፋ ተቀመጠ",
"እሱማ አዎ ችግር አመነ ፖሊስ ልብ ለበሰ ጓደኛ ዘረፈ ነበር",
"እሱ ቤት አሁን አገር አያስተዳደረ ነው ዩኒቨርስቲ ዘጋ ሀይማኖት ቦታ ነዳ ማረ ቀን ሞተ ባለስልጣን በቤታቸው፣በስራ ቦታቸው፣ለስራ ሄደ ገደለ ህዝብ",
"ሰላም ህዝብ አንድነት ወጣት ሁለንተናዊ ነቃ ተሳተፈ ወሰነ",
"ታህሳስ ተሽከረከረ ለየ ሰሌዳ ጥረት አለ አለ ገባ ሆነ ክፍያ ጠየቀ ህገወጥ ጉዳይ",
"ታድያ ምን ጠበሰ እናንተ ተመለከተ ደገመ በላ እኮ የውያኔ መድሀኒት ነው ቡዳ መድሀኒት አለ",
"«እኛ ድሀ ነን፤ ገንዘብ የት መጣ አል ደረደረ ነበር» በጠገዴ ታግቶ ገደለ አደገ አባት",
"ውሻ ቀደደ ጅብ ገባ ኣውቃቹ ትእግስት ነገር ዋለ አየ ተበጀ አንድ ነግር እጅ ከዋጣ በሃላ መለሰ አለ በጎ ሳበ ግርግር ሰላም በማወክ፥ ደም",
"ምን አለ ፈለገ ነው እኛ ፈራ የሳውዲ አይነት በሀጉራችን ሽብርተኝነት እና ክርር ደገፈ ምንግስታትን እንጂ ዲሞክራሲያዊ ሀገር ነው",
"ሀሳብ ደገፈ ደገፈ ሰው ሰበሰበ መብት ምን ተአምር ከለከለ ገባ አሁን ምን አለ ነገር ነው ሰበሰበ ደረጀ መብት አፈነ ነጻ ፍትሀዊ ምርጫ ተደረገ አለ",
"ውሻ ዘረኛ ዘረኛ ዘረኛ ባዶ ዲቃላ",
"አንትሾ ሰው ሰይጣን ራስ ስጋ በሶ ነውኮ",
"ተነገረህው ሞተ መሰለ",
"ሀሳብ ተሸከመ ከበዶህ ነው ማጅራት መታ መሰለ ያዘ ወንድም ረጋ አለ ሳበ ለውጥ አንተ ዘላቂነት",
"ደደብ ተማረ ነበረ አወቀ እውነት/ሀሰት ተባለ ትእቢት የት ደረሰ አየ",
"ነፍስ ማረ ጋሽ ደቤ ግጥም እኩል የምታጨሳትን ኒያላ ነደደ ዴስክ ላይ ቂጥ አስቀመጠ ነገር አበረ ብዙ ዘንድ ኖረ",
"እንዲህ አይነት ድንቅ ስራ ምን ሸገር ብቻ ወሰነ ገባ የሸገር ወንዝ ብቻ ሆነ ሸገር ዙሪያ አለ ተራራ ምን ዛፍ ተከላ አይዋበም፣ ይህ በርካታ ሺ",
"ጨረቃ ወደ ላይ ወጣ ደም ይፈስሳል",
"መሀል ላይ ወደ ቀጣይ ትውልድ አለፈ ቆመ ፍጹም ትህትና ራስ ዝቅ ተደረገ ገለጸ ትልቅነት",
"ኦሮሞ ከባላይ ወጣ ገደለ ደገመ ገዛ መደብ ጨፈለቀ እናበአዳባበይ እኔነኝ ነፍጠኛ ከላ ቡድን ጋረ ምን አይነት ህብረት ፈጠረ እሱ መታ ሆነ ራስ ይወሃድ",
"የቤቲ ፈሰሰ አመል የሚችለዉ ሄኖክ ጋቢ ብቻ ነዉ",
"እርስ ነው",
"ብርቱ ወንድም እንኳን ወለደ ቀረ ዘመመ ባረከ ይህ",
"ዳነ ግን እሱ ርግዝ",
"ራስ ሰራ ህጋዊ ሌላ ተደረገ ህገወጥ ጥር ሁለት ፈረሰ ጀመረ አለ አይደል",
"ጽንፈኛ እንኳን ሰባሰበ ምን እናንተ መሰለ አላማ አለ ፖርቲዎች ጋረ ጋራ ሰራ ምርጫ ተዘጋጀ ለየ ኢዜማና እናንተ መካከል አአ",
"ጠቀለለ ሚኒስትር አቢይ አህመድ የእንኳን ደረሰ መልክት",
"ዘባ አመጋገብ ስርአት ችግር ዜሮ ተደረገ እንቅስቃሴ",
"ወደ እኔ መዘገበ ወይም ሰይጣን ነፍስ ገሀነም ዘላለም ጣለ ቁጣ አመለጠ ቻለ ተጠነቀቀ ሰጠ",
"ታላቅ ስቃይ ተሰቃየ ፡፡ ቤተሰብ ወደቀ አመመ አለ ህመም እና ስቃይ ነው ፡፡ እናት እንባ ደስተኛ ሆነ",
"ይህ እውነት ተቀበለ ሁሉ ዳነ",
"ግን እኛ ነው የደነዘዝ ነው ወይስ መንግስት አለ ፒፒ ነው ስራ ሰራ ቅእት",
"ወጣት ሰብአዊ መብት ቆመ አፈራ አለ ተውልድ ምን አከለ የሰብአዊመብት በሐገሪቱላይ ቦታ አለ",
"መራ አንተ ዝም አለ ስራ ጌታ አንተ ጋረ ነው አንተ ጠበቀ ተኛ ንቅልፍእ ወደደ",
"ኡኡቴ ወግ ወግ ያዘ ጃል አንተ ምን ሞራል ነው ግን ስለ ትራምፕ አፍንጫ ስር ንጹሀን ደሀ ልጅ ማረ ዘመን ሰጠ ወንበዴ አፈነ ዝም አለ ዛሬ ስለ",
"ስራ ላይ ነው",
"አንተ አመነ አፈረ ለም እኔ ድርሳን አደገ በይልኝ",
"አንተ ምን አለ ጠበቀ መንግስት ሌላ ሺ ግን ቀን ሞት ነው",
"ሙሉ ልብ ነዋ ያ",
"ክቡር አምባሳደር ሀገር አለፈ ጥቂት አመት ገጠመ ተግዳሮት ጠቀለለ ሚኒስተር ዶ/ር በላ አህመድ መራ ቀረፈ ጀመረ ገለጸ ቀጣይ መራ ደመረ",
"አምባገነን ጀመረ እኔ ወጣ አሳር አለ አንተ ገዛ አመት ውስጥ ደንብ አሳይተህናል ዘረኛ ዘረፈ ቀማኛ ውሸታም ፀረ አማራ ፀረ አዲስአበባ ፀረ ኦርቶዶክስ ነው",
"ብ/ር ጀነራል አመነ ጽጌ ስብሰባ ለየ አለ ረሸነ እረሳውን ይህ እንደ ባእድ ጠላት ጐተተ",
"እውነት እውነት አልመስልህ አለ ነው ይሄ ሰውዬ ዘመን ሙሴ ይሆንን ምድረ አራሙቻ ዘር ተቧድና ተነኰተ ከርማ ላይ",
"ጨረሰ ጊዜ ነው ፡፡ ወንድም ቀሰቀሰ እኛ እንደ ወረረ ምድር ላይ ወረደ አምላክ ቁጣ ተገነዘበ ቻለ",
"አየ ወጣ መገናኛ አካባቢ ዝርፊያ መገናኛ አካባቢ ዝርፊያ እጅግ በረከተ ቦርሳ ቅሚያ እስከ መኪና ሿሿ ቀን ተቀን ክስተት ነው ይህ ቪድዮ አንድ ዘባ ቀረጸ ላከ",
"ሁሉ አስተማረ ማረ ብዙ ሠወ ስለማይገል ሰማ ፈሰሰ ጥቂት ተመለከተ ለየ ተማረ አለ ትምህርት ሰጠ እና ትምህርት ሰጠ አለ ሰጠ",
"ህሊና አለ እንኳን አገር እውነታ ካደ ጠራ ነው ግን ግን የጎጥህ ስልቻ ውስጥ ወተፈ ይህ ተገነዘበ እውነታ ውሸት",
"ኢትዮጵያ አመት ታታ ሴት ብሄራዊ ቡድን ልምምድ ሰራ ተገኘ",
"ክርስትና ትህትና ተግባር",
"ያዘ አለም ታሪክ ማን ሰው አዲስ ነገር ያዘ መጣ ተቀባይነት አጊንቶ አወቀ",
"ኦሮሞ ብሄርተኝነት ቤት ውስጥ ሆነ ኢትዮጵያ ዳነ እዳ ተሸከመ እጅግ ከባድ ነው",
"አዳማ ከተማ አጼ ፍቅር ተቀበለ ህዝቤኮ ይዋደዳል፣ ይከባበራል፣ አብሮነትን ተሻለ ኳስ ፖለቲካ ሸቀጥ አይሸጥሸትም ሰላም",
"አማራ ስም ተደራጀ አማራ አማራ አለ አማራ ደከመ ከፍተኛ አስተዋጽኦ ተደረገ ነው አማራ ማእከላዊ መንግስት ነበረ ድርሻ ደከመ ላይ ተገኘ ወሰነ",
"ደገመ ምርጫ ረዘመ አልተራዘመ በጋ ተደረገ ክረምት ኢትዮጵያ እውነተኛ እርቅ ተደረገ ብሄራዊ ገባ መጣ ደረሰ አዙሪት ቀጠለ ቀረ",
"ነዋ ከደበረሽ ግን ቀረ",
"እግዚአብሄር ከበረ",
"ጀመረ ፍቅር በር",
"ተነሳ ተነሳ አሁነው ወቅት ማን አመነ ለዲናቹ አለ እኗተ ማነው የሚቆረቅርለትየኢ/የ እስላም",
"ህግ ተከበረ አማራ ክልል ተባለ ውስጥ ብቻ ነው አማራ ማረ የደፈሩ፣ከህንፃ ወረወረ ገደለ ዮንቨርስቲ ተማሪዎቾና የዮንቨርስቲ መምህር መጣ ነው የሚታሰሩትየሚጠየቁት",
"ጋሽ በራ ሞላ ግን ምን ሳበ ነው ከሰኞ፣ ማክሰኞ፣ ከእሮብ፣ ከሀሙስ፣ ከአርብም፣ ቅዳሜ ሁሉ ቀና እኛ ደስ አለ እሁድለት ለሊት አለ ዘፈነ እሁድ ለሊት",
"ዛሬ እለት አቻ አርማጭሆ ውስጥ ህጻን እንደታገቱ ረገጠ ረዳ ደረሰ ከታጋቾቹ መካከል አንድ ካህን ልጂ ነው",
"ዘራ ጠፋ ወንጀል ከሰሰ እንዲሁም ኢትዮጵያ ህዝብ ተበሳጨ አለ ምርጫ ያዘ ቀረበ እንደነ ጃዋሪ አይነት ማቅፍ ኢትዮጵያ ህዝብ ናቀ ነው",
"እኔ ውድ መልካም እንቅልፍ",
"ጉድለት ቢያወሩት፣ ምን ይሄ ሆነ አለ ጠየቀ አለቀ መልስ ተገኘ እኔ ምን ላድርግ' አለ ተነሳ መሰለ እርካታ ምንጭ ግን ፍጹም ለም በረታ ወደደ 'ተሳካ'፣",
"ትግራይ ጥንታዊ ስልጣኔ እና ሀብታም ባህል እኛ አለ ተታለለ ሰረቀ በቃ",
"ብዙ መዘናነጋት ኖረ ትራፊክ አሰደሳች ህግ ነው",
"መልካም አዲስ አመት ቀጠለ አመት ጓደኛ ፈጠረ ደስ አለ",
"ፀረ አማራ ብአዴን አማራ ወጣት ማህበር ከስሱዋልየብአዴን ላከ ሆነ የቆዬው ወጣት ሊግ እኔ አለ አዲስ ማህበር መሰረተ አለ ብሎዋል ብአዴን አማራ ህዝብ ጠላት",
"በረታ የዉሕድቱን ፕሮግራም ተገኘ ቻለ በለጠ ጥልቀት ረዳ ማሰረዳቱንም ተጋዘ ነበር",
"ለጥቆማዉ እያመሰገንን በአል ወቅት ህብረተሰብ ሰላም ከበረ አሰበ ጉዳይ በአል ኋላ ያዛወርነዉ ሆነ ገለጸ",
"ወደደ አለ አብሮ፣ ባከነ ነው እንጅ እንዳይን፣ እንደ ጆሮ፣ እንደ እግር፣ እንደ እጅ ቀና ጌታ ዮፍታሄ ንጉስ",
"ችግር ቅቤ በላ አለ ሀበሻ 'ሲቸግረው'",
"አዳም ፌስቡክ ላይ ምን አባ ሰራ ምርጫ ደረሰ የለ ዘጋ ተጠና",
"ኦሮሚያ አዲስ አበባ ኖረ አበረ አደገ አማራ፣ንቆና ተገለለ ባህርዳር ሄደ ኢትዮጵያነት ሱስ ነው አለ መሰለ ይኸውላችሁ ፍትህ ኦሮሚያ አማራ ሌላ ብሄረሰብ",
"ጠንካራ ፓርቲ መሰረት መሰለ ህዝብ ዘነጋ ሁሉ ነገር አንድ ተሳካ አለ ቀቢፀ ተስፋ ተወ እና ወደ ህብረብሄር",
"አርሴማ ሰማእት ምልጃ ጸሎት ሀገር ኢትዮጵያ ክፉ ሁሉ አደገ አሜን ሰላም",
"ወንድ ዘር ቀድሞ ፈሰሰ ችግር",
"አንብቤዋለሁ ዛሬ አመት አካባቢ ወርቅ ነው",
"ነፍጠኛ አስተሳሰብ ነው፣ ሥነልቦና ነው፤ መሰረት ጉልበት ቀማ ጨፈለቀ ሆነ እኩልነት ውርደት ሆነ ሥነልቦና ነው ብሄር አለ አስተሳሰብ ሥነልቦና",
"መኪና ዋጋ አይቀመሴ የሚያደርገዉ ኤክሳይስ ካሰ",
"ኦርቶዶክስ ላይ አለ ጥላቻ፣ ጣብያው ከበረ አባት አለማዊ ሰማ ነው ጠራ ነው መረጠ",
"አዘነ ሰው ነው ነገር ምርጫ አፈር ገባ ተወ",
"አመነ ረገጠ ፈለግ ለራሳቹ የምትወዱትን፣ ለወንድማቹ ወደደ ይህ ነው የነቢዪ ሙሀመድ የአላህ ሰላም እሳቸው ላይ ሰፈነ አስተምህሮ ነበረ",
"እኛ ፈለገ በይልኝ ባረከ",
"ተሳስተሃለል፣ ቆም አለ ራስ ጠየቀ ፣ዛሬ ላይ ደረሰ ለውጥ ሀይል መስዋእትት ሆነ አትዘንጋ፡ ይህ አለ ደረሰ አነዚህ ሰው",
"ግለሰብ መብት ቡድን ጋረ መጠነ ወሰደ እንጂ ቡድን ጨፈለቀ ግለሰብ መብት ተካ አሁን መሬት ላይ አለ ማህበረሰብ እድገት ደረጃ ጦርነት ጋበዘ ነው",
"ህልም ራስ አየ እሄን አይነት ህልም ያስብላል ተሽከርካሪ ወንበር ተቀመጠ ድሀ ልጅ ጨፈጨፈ ቻለ ወታደር ረሳ",
"እንኳን ጭንቅላት ተረፈ ነው አለ ደሞ እንኳን ማርያም ማረረ ነው",
"ታከለ ኡማ ራስ አወቀ አድሎ፣ ክፍት ቦታ አጠረ አለ ስም ዝርዝር ወደ ክ/ከተማ ላከ ካርታ ሰራ በቃ አሁን ሌላ ሰው ቤት ፈረሰ ግብረ ሀይል ኦሮሚያ",
"አሁን ሰአት ፖለቲከኞቻችን ጨለማ ሰአት ፖለቲካ ፍጆታ የተመለመሉ እና ለ፳፯ አመት አንድ ፖለቲካ ውሳኔ አለፈ ግብስብስ ነበረ ሆነ አለ ሁኔታ ቁልጭ ተደረገ አየ",
"ነገ እለት መምህር መላከ መንክራት ግርማ ወንድም ፈውስ ስነስርዓት አላቼው በረቀ",
"እናንተ ተገኘ ፈለገ",
"ብሾፍቱ የተወለድኩአዳማ ያደኩአዲሥ አበባ የተማርኩኳሥ የምወድአንጀት ቈሰለ የአርሠናል ደጋፊ ነው አባት እናት ጉራጌ ሆነ ነው አለ ብርሀን ነጋ",
"አሜን አሜን ንክ አበረ ደረሰ",
"አንዳንድ እኮ ልብ ተናገረ",
"እብድ አሸባሪ አለ",
"እኔ የልገባግ እቺ ኦቦ ማ መገርሳ ቀነሰ አብይ ውስጥ አለ ኢትዮጵያዊነት ነው",
"ገደለ",
"ሀገር ፈረሰ የእግርኳስ ከለበ ደግፍ አለ ምን አለ ነውበቦንብ በከለ ተጫወተ አለ ነው ጀመረ ሰከነ አለ እናንተ አለ ደገፈ ነው",
"መካከል ማን ለም ገዛ እጅ ገደለ ፍጥረት ሁሉ ጋረ ኖረ ምን እንኳን ከእንግዲህ እኛ ጋረ ሆነ",
"ዘረኛ ሙሉ ወደመ ከዝንጀሮቆንጆ ሁሉ ዘርኛ ዝንጅሮ ነው እኔ",
"ፍትህ አለ ቦታ ሁሉ ሰላም ለም",
"ድቅድቅ ጨለማ ሀይለኛ ዶፍ ዝናብ እየዘነበ፥ያላችሁበትን ቦታ እንዲሁም ሄደ መንገድ አወቀ ብቻ ጥቅጥቅ ጫካ ውስጥ ተወላከፈ ሄደ ሰማ",
"አራት ድርጅት ጋራ ህዝብ ዘረፈ ንብረት",
"ምን በክትክታ ገረፈ ልጅ ተደረገ",
"እና ደገመ መስማትማንበብ ፈለገ ብቻ ሰማ ብሽቅ",
"ደቡብ ኦሞ ሰው ነው አካባቢ ማህበረሰብ ሚንጊ ተባለ ህጻን ገደለ ባህል ቀረ ጣረ አመመ ተሳካ ነው",
"እሁድ ያለው የመርሲ ሳይድ ግጥሚያ አጓጊ ነዉ",
"ምን አለ ፈለገ ነው መንግስት ብዙ ወጣ ሸፈነ አስተማረ ኖረ ማረ ወለደ ከተማ ራቀ ሄደ ብሄር ግጭት",
"ዘር የለሹ ወረኛ",
"ካህን አጠረ ነፈሰ ቅዱስ ከለለ እግዚአብሄር ህግ ታቦት ጽዮን ሆይ ንጉስ ጠላት ተሸነፈ ሀገር አይተዋትም፡፡",
"ትክክል ኦሮምያ ህዝብ የኢትዪጲያ ጠላት ነው ከዛ ላቀ መንግስት ደረጀ አሸባሪ ቡድን ተደረገ ድርጊት መጥፎ ጠባሳ ጣለ ነው",
"ሀሀሀሀሀ ጀመረ ማንበብ እና ጻፈ ለመደ",
"ገገማ",
"አመት ከፈለ ጨቋኝ አፋኝ ውክልና ስርአት ዛሬ ጀመረ መለሰ ቀበረ እነሆ በህዋህት ምክንያት",
"ምን ገባ ሰው እምነት ጠፋ ይህ",
"ባለስልጣን አነሳ እስከ ጥቃቅን እና አነስተኛ ፈረሰኛ ደሞ ምን አረገ ነው ምትሉት ወይ ዛሬ ወጣ ሰራ አመመ ቀረበ ሀላፊነት ወሰደ እና ከዛ ፈረሰኛ ለእማወራ",
"እነኾ ህዝብ ሁሉ ሆነ ታላቅ ደስታ የምስራች ነገረ እና ፈራ ዛሬ ዳዊት ከተማ መድሀኒት እሱ ክርስቶስ ጌታ ሆነ ወለደ ሉቃስ ፪፥፲፲፮",
"በላ ኢትዮጵያ ገባ ቅርቃር ወጣ አለ ድንቅ መራ ነው በረታ አለ ገባ በጣምብልጽግና ግለሰብ ቡደን መብት ሚከበርበት አማካኝ ተካተተ ፓርቲ ነው ሁሉ ተበጀ",
"ቢልየን ብር አለ ባለሀብት አለ ዛሬ ነው አወቀ አለ እንዴ አፋር ውስጥ አነሰ ነደደ አደለ አለ ወረዳ አደረ አለ እንዴ",
"ምን ነካ እውነት አዘነ",
"ኢች በላ ንዴት ማን እንኳን ሰማ አይነት አየ ደገመ ማንኛውም ቁልፍ አቶ ማ ሀሳብ ተቀባይነት ተገኘ ቻለ ላይ ነው አዞ እንባ ግን ለትዝብት ዳረገ",
"ሀገር የትኛው አደጋ ላይ ትራፊክ አደጋ ደረሰ ህይወት እና ሀብት ጠፋ በዛ አሰበ እንኳን ዘገነነ ነው ወረረ እና ሽብር",
"ማረ ከልተማርክ ማረረ ከሚበል፡ ሰትማር ንጹህ አእምሮ ኖረ ይሻለል፡",
"ቄሮን እሹሩሩ ይሄው ነው ውጤት ኦሮሚያ ፊት ወደ ልማት ዞረ ዜጋ ሰራ ኖረ ድል ደህንነት ጨበጠ ሰፋ ነው መሬት ግብይት፣ ግል ዘርፍ ወደ ልማት ገባ ቻለ ዋቃ አረቀ",
"ዘመድ ረገመ ሁላችሁም ተነተነ ኮሪያ ጩኸት ነው አመመ ሁላችሁም ደም ፈጠጠ እና ህመም ሁላችሁን ሁላችሁም ሞተ ቻለ",
"ጌታ ሆይ በጎ እና ቀና ቀና ሆነ መልካም ተደረገ ፡፡ መዝ",
"እስክንድር እኔ ጀግና",
"አቶ ማ መገርሳ ተገለለ ፓረቲ ነው ኢትዮፒያን ሊያስተደድር ቀበሌ ሳበ ነዉ የሚሸለዉ፡፡",
"ኢትዮጵያ አየር መንገድ ምን ሳበ ነው ቅዳሜ እና እሁድ በረራ ለም አለ ከዛ ቀጠለ ደገመ ደቂቃ በረራ እና አንድ በረራ ተደረገ ምን አለ አመት",
"መልስ ሰማይ ከፍ አለ አንተ ክብር ከፍከፍ አለ አለ ነው መቅ ሀያል ሰማይ መሰለ ምሳሌ ሰማይ ስም አለ ሰማይ ሰማ ሆነ ሀያል ስም አለ",
"መልካም አዲስ አመት አዲስ ዘመን ፍቅር ሰላም ብልጽግና አገር ሰላም ተመኘ ሁሉ ማህበረሰብ እንኳን ሰላም አደረሳቹህ",
"የሀሳበ ግልጽነት ልብ ንጹህነት ሀገር ሰላም ሆነ እድሜ ሰጠ አንተ ደህና ሆነ አበረ አየ ፕርስትሮይካን ግላስኖስቱን",
"ህይወት ጨረሰ ስኬት መልካምነት ነው",
"ሰማ አፄውያን ሀይማኖት ህይወት ላይ ነው",
"እጅግ ጣም ሊከበሩ፣ ሊወደሱ እና ተመሰገነ ገባ ብርቅዬ ልዩ ቁርጥ ቀን ኢትዮጵያዊ መራ ሆነ እድሜ ያርዝምልን፤ በረከቱ፣ ጤንነቱ፤ ብርታት በዛ አለ",
"ደረሰ ይህ ሰውዬ ላይ ያልተነፈስሽ፡ ተራ የወያኔ ላከ ጋዜጠኛ ምኞቱንና፡ ላከ ተናገረ እንዲህ ያዘ ለቀቀ አለ ትንሽ ለትዝብት ሰጠ መጣ ህፍረት",
"ብቻ ነው ሁለት ሰማ ወደ ምንፈራዉ ነገር ዉስጥ ከተተ ፈራ",
"እቲሳ ተክለሃይማኖት አባት በረከት በሁላችን ላይ አደረ አመት ሰው አለ",
"እኔ ሆነ ሌላ ሰው ላይ ደገመ ከሰሰ መሰከረ አለ ነበር፣ ምርመራ ውጤት አየ ያንን ረገጠ ሰማ አነሰ ስነ ልቦና ምክር ተመቸ",
"መልካም ነገር ተደረገ ጊዜ አጣ ሰው መልካም ሆነ ጊዜ አይኖረዉም ሪቢንድራት አጐረ",
"የደረስብን ግፍ የመስጅድ ቃጠሎ እና የወንድሞቻቻችን ንብረት ደቂቃ ወደመ ላቀ ዋጋ ያስከፍላችዋል",
"አሁን ንግድ እውር ክፍፍል ጭቅጭቅ ተነሳ ነው",
"እናንተዬ ለካ አሁን ህወሓት ራስ ከሰመ አለ ጠበቀ ሰው አለ ደሞኮ አለ ብይ ጠበቀ ፊት ኮስተር ተደረገ ነው ጠየቀ ለካ ይህ አገር ሰው ደንብ",
"መልእክት ይህ ነበር ተከበረዉ ጊዮርጊስ ቤተክርስቲያን ክብር ተባለ ሁላችንም ጸጥታ አለፈ ተሰላፊዉም ጭብጨባ ታዛዥነቱን ገለፀዙሪያውን ቆመ ሙስሊም",
"ፈጠረ ስም ከንቱ አነሳ መሰለ",
"ሁሌም ጸለየ አንተ ይህንን ጸሎት ጸለየ ነገስት",
"አንተ ተወራ አለ ሁሉ ነገር እባክህ ተገኘ",
"አቢቹ አማካሪዊን ለወጠ ደረሰ ምርጫ ተሸነፈ ድል መነመነ ነዉ አብይ መከረ ጀዌ ነበር ሆነ አለ",
"ትክክል እግዚአብሄር ሁሌም መልካም",
"መራ ነገር ግን ጤነኛ ነው ሆነ የሚያጨሰው ነገር አለ ዝም አለ እንዲህ ተወራ",
"ሪፖርት ሀዲያ ሆሳእና አመት ጀመረ ድል ተሳካ",
"እኛ ድሀ ነን፤ ገንዘብ የት እናመጣለን' አል ደረደረ ነበር በጠገዴ ታግቶ ገደለ አደገ አባት",
"በርካታ አመት ድንቅ አገልግሎት በረከተ አርቲስት እውቅ ሰጠ ድምጻዊ መሀሙድ አህመድ ገጠመ አለምጸሀይ ወዳጆ ሙዚቀኛ ሰላም ስዩም ሰላሚኞ እንኳን ደስ አለ",
"ቀረበ አዲስ ነገር ላይ አለ ሰው ትከሻ ላይ ተንጠለጠለ ደነበረ ደንብ አየ ነው",
"ኢትዮጵያ ግጭት ስጋት አለ ገራ መካከል ተገኘ",
"ፍጹም ያዘ አለ ምርጫ ህግ ለም",
"ማረ ገባ መርሀ ግብር ጠነከረ ቀጠለ ቻለ ህግ ተዘጋጀ ሆነ ገለጸ",
"ጣም ደስ አለ ነበር",
"አስተሳሰብ ነው ተባለ ፓርቲ ነው ወያኔ ሲላዝን ነበረ ተወራ ፓርቲ ነው አለ ነው",
"አሁን ነው ጊዜ ሌላ ትግራይ ህዝብ ያዘ ሌላ ወገን ጋረ ወደ ፊት ኢትዮጵያ መጣ ተገኘ ሰላም ብልጽግና ትሩፋት የማቅዋደስ ሀላፊነት ብቃት",
"ታከለ ዶማ መታ ነው ሰው ሆነ ከባድ ሰው ጠራ ሞተ",
"ታህሳስ ቆመ ኮሚቴ ረቂቅ ህግ ላይ ህዝብ አየ ሰበሰበ ደገመ ጠራ ተደረገ አየ ሰጠ ሰው ተገኘ",
"አል ተማሬ ህዝብጋ ኖረ ንዴት ከበደ ሰማ መንገድ የዎታደር በጀት የተለየዬ ነወ ደነዝ፡፡",
"በረታ መልካም ተግባር ደገፈ ብቻ ሆነ አባል የሆንነው ምክንያት ነው ይህ ታላቅ ኰራ ሰማ",
"ራስ ትዊተርም ይህ ሸፍጥ አበረ ነው",
"በመጀመሪያዉ አስቸኳይ ጉባኤ ተወሀደ ብለዉን ነበር አሁን በመቶኛዉ አስቸኳይ ጉባኤ ተወሀደ አለ እንዴ",
"ሰጠ ቀን ገና በአል ከበረ ስጦታ",
"ባህርዳር ሰላማዊ ሰልፍ አቋም ገለጸ «ሙስሊሙ የመስጊድ፣ በአል ከበረ እና መቃብር ቦታ እጦት ጣም አማርሮታል፤ ሆነ ባህር ዳር አለ",
"ከበበ ምክንያት ንጹሀን ቀጠፈ ህግ ከበረ ሀይል ቆመ ፈጸመ እዬታወቀ አንድ ሰው ግን ተጠረጠረ ያዘ ተባለ ሰማ",
"ጀመረ ሸካራ ነገር ሽሽት ገረመ እንደ ኤግል ሂልስ፣ ችግኝ ተከላ፣ ፓርክ መሰለ ልስልስ ጉዳይ ላይ ነፍስ አለ ካሜራ ማን ደገነ ፊት ተገኘ",
"የህውሓት ስብሰባ ላቀ አለ፡፡ አሁን ስብሰባ ለሚታደልው አንገልብስ ባከነ ጨርቅ ልብ ሰፋ እርቃን ሄደ ትግራይ ወገን አደለ ምናለበት",
"አንዳንድ ሰው ሲያደናቅፍህ ቀስ አለ እንጂ አየ ሄደ አለ ሳቀ ምናለ እሱ ደቂቃ ፊት ነገረ እሱ ምክር ምን ሰራ ካደናቀፈኝ ኋላ",
"ዛሬ ለየ ጎዳና ላይ አለ ዜጋ አነሳ ቀጣይ ሳምንት ገነባ አለ መጠለያ ማእከል ገባ ጠነከረ መልክ ቀጠለ ጎዳና አለፈ እንጂ ኖረ",
"አና አሁን ወድያ ስለ ትግራይ አፋር ገነባ ጠራ ወር ዘገበ ጠቀለለ ሚኒስቴር ቢሮ ማስጠንቂያ ሰጠ",
"አገር በእንደዚህ አይነት አረመኔ እጅ ገባ የፖለቲክ ትርፍ ፍለጋ አለ መንግስት እንጂ ማረ ነው አነሰ ራስ ቤተሰብ",
"አሜን አሜን አሜን",
"የኢሕአዴግ ውህደት ስምምነት ፊርማ ስነ ስርአት ላይ አቶ አለፈ ቀረበ ማብራሪያ",
"ነው ከህወሃት ጋረ ውህድ በቀለ ገርባ ጣፈጠ ደብሪፅንም ገባ",
"እኔ አማራ ነው አንተ ደገመ አማራ ጠፋ ሰራ ነው ይህ አንተ እንጂ እኔ ስለ ህዝብ ገባ አብይ ፀረ አማራ",
"ሀገር እንዲህ ወንበዴ ማላገጫ ሆነ አየ ጣም ነደደ",
"እሜን ለሁላችን እስኬው እግዚአብሄር አንተ ጋረ ይህ",
"ጉዳይ ተመለከተ ሰራ ቤት ረሳ ስራ ይህ ትራፊክ ፖሊስ ግል ሰራ ተመሰገነ ገባ",
"የዎቹ የሴራፓለቲከኞች መጣ ነው ሞተ አለቀ እና ሰላም ሆነ",
"ገለበጠ ሰነፈ የጀዋር እጅ አለ ነው አለ ደነዝ",
"ከተማ ብዙ ተወገደ አለ ጉድ አለ ጀመረ አነሰ አንሳሳ",
"ኦሮሞ አለ ሁሉ ጠቀለለ አባት ፓርቲ ውስጥ አለ ረባ ዘር ፖለቲካ እናካሂዳለን ሚሉ ይህ እንጂ ኦሮሞ አለ ህዝብ ጠቀለለ ገባ ልክ ነው",
"ዓወት ንሓፋሽ አለ ምንጋስ ማህበራዊ ፍትሒ፡ ምድልዳል ሀገራዊ ስኒት፡ ምሕያል ሽርክነት፡ምርግጋጽ ፖለቲካዊ ተሳትፎ፡ ቁጠባዊ ምዕባለ፡ ባህላዊ ትንሳኤ'ዩ ምርግጋጽ'ዚ ራኢ ዋጋ ዝሓትት",
"አዎን ብረት አንጋች ነው ጨፈለቀ ቀማኛ ገደለ ራስ ሆነ እሳት የሚያጋይ፣ ራስ ሀሳብ ብቻ ቅዱስ ቈጠረ",
"መልካም እሴት ጠበቀ ችግር ደበቀ ወይን አድልዎ ዜጋ አየ ነው ዩኒቨርስቲ ሙያተኛ ፈራ እንጂ",
"ታሜ ዝም አለ እንደ አንዳንድ ፖለቲከኞች ከበረ እና ተዋደንብሄር ብሄረሰቦችበዴሞክራሲያዊ መልኩአንዳንድ",
"ርጅ* ወጋ ሙስሊም ያንን ተግባራዊ ተደረገ ጊዜ ውጤታማ ሆነ ነበረ ክፍል",
"የት ነው አለ ቀረጸ ትዊት ተደረገ በጎ ነው ፈጠረ ረዳ",
"ፓርቲ ብሄር ተደራጀ ክልል ተዳደረ ፌደራሊዝሙ ፈረሰ አሃዳዊስርዕት መጣ አለ ትርክት አንድ ድንቁርና ሌላ ድርቅ ብቻ ነውሕዝብን ቀጥተኛ ስልጣን",
"እውነት ነው እኔ ጸበል ረጨ ገባ ውስጥ ነው",
"በላ አህመድ ኢትዮጵያ ዋለ ውለታ ሌላኛው ይህ መሰለ",
"ለሁላችንም መጻኢ ድል ጠቀመ መልካም እሴት ጋራ ጠበቀ ጠላት ጋራ መከተ ነው",
"ዛሬ ጣም ያሳስበኛል፤ ነጋ ደገመ እጅግ ጣም ፈራ ደነገጠ ኢትዮጵያ አንድ ተማረ ሞተ አንድ ተማረ የማይታገትባት ሀገር ሆነ ቀጠለ እርግጠኛ",
"አማራ ጀመረ በሰበሰ ደነዘዘ አንስቴዢያ ሞተ ኢትዮጵያዊነት አስተሳሰብ ለቀቀ አለ ለየ ውጪ አለ አማራ ሆዳም እና ግድ የለሽ ነው ራስ ወገን",
"እንኳንም እስላም ላፈ ተደረገ ውድ ወገን ክፉ ሰማ እኛ ጨዋ",
"ጽኑ፥ አይዞአችሁ፥ አትፍሩ፥ ፊት አትደንግጡ፤ አምላክ እግዚአብሄር እሱ አንተ ጋረ ይሄዳል፤ አይጥልህም፥ ተወ ኦሪት ዘዳግም",
"መንደር ደረጃ ብቻ አሰበ ቻለ እብሪተኛች መለሰ ጠላ ጥያቄ ይህ ነው ይህ ውል መለሰ ስለ ተቻቻለ ስለ አገር አሰበ ቻለ",
"እኛ አባት ግን መጣ ተኛ",
"እሱ ዞረ አይደል እንዴ ጀመረ እኛ ዞረ",
"አሜን",
"ጥር ሞጣ ጐዳ ካሳ ሆነ ቀን ነው ኢትዮጵያ እስልምና ጉዳይ ም/ቤት ሞጣ ሙስሊም ደረሰ አስነዋሪ ጥቃት ግግም ቻለ ዘንድ ነገ ጥር ታላቅ ገባ ሰባሰበ",
"ሌንጮ ባቲ ስለ ብልግና ፖርቲ ሰበከ ሳውዝ አፍሪካ ገባ ተባለ ነው ሳውዞች ባለጌ ባለጌ መንገድ መለሰ ነው",
"ወይኔከሶስተኛ ክፍል ወደ አራት አለፈ ገዛ ንዴት ወደደ",
"ልክ አለ ሞገተ ነው አለ ምን ሞገተ የገባቸዉ መሰለ ሴት አጉል ጀገነ ቻለ ልጅ አደገ እያደረጉ'ኮ ነገር",
"እድለኛ ነው ካሰ ስንት አጣ ሁለተኛ እትም ጠበቀ ነበር",
"ወር ነገር ነው አማራ በተነ አደጋ የምታጋልጡ እናንተ አማራ ልጅ ነው እንዴ",
"አስጸያፊ እንስሳ አህያ ሆነ ተቅማጥ ተቅማጥ ውስጥ ቤተሰብ ተወ ተስፋ ተደረገ",
"ተርፎነ ነው ቅቤ አንተ ሰትለምን በየበተሰኪያኑ አመድ ወረሰ እኛ የተረፈነን ደሞ",
"እባካችሁ ስብሰብ አለ ፐሮግራም ኑር ሀገ ደንብ ኖረ ራእይ ኖረ ህዛበችሁን አወቀ ተባለ አለም ላይ ፖለቲካ ፓርቲ ለመነ ሀገር ኢትዮጵያ ብቻ",
"ባልደራስ ምርጫ ቦርድ ተቀባይነት ተገኘ መፍትሄ ጉዞ",
"ነጻ መንግድ ሀገር ተገለገለ ቻለ ብዙ መንገድ አወቀ አና ያለታወቀ ብዙ መንገድ አለ ወጣ በመናገረሽ ያገኝሽው ድል ብቻ ሆነ እንዳድትረጅ ገባ ብዙ",
"ክቡር ጠቀለለ ሚነስቴር አናምሰግንለን",
"ስእል ግሩም ጥልቅ ናቸዉረጅም እድሜ ጤና ጋረ እኔ ጀግና",
"የራይድ አሽከርካሪ አነቀ መኪና ዘረፈ ለኢቶዮ አውቶሞቲቭ ገለጸ",
"እኛ ጀግኒት እኛ ኰራ ነካ ሁሉ ወርቅ ነው ጀግኒት ገና ነው ገና",
"ተቋረጠ ጸልዩ፣ ሁሉ ተመሰገነ ወደ ተሰሎንቄ ሰው",
"የፖርቲዎቻችንን ውህደት ብስር ወሰነ ፊርማ ስነ ስርአት ዛሬ ተካሄደ ውህደት ጉዞ ህግ ስርአት ጠበቀ በአስተማማኝ ሁኔታ ቀጠለ",
"ትግል ተስፋ እና ተስፋ ቈረጠ ተመነ እና ጥርጣሬ እውነት እና ሀሰት ፍርሀት ፍቅር ጎሳ እና አንድነት ጥበብ እና ኢጥበባዊነት መካከል ነው ተጋድሎ",
"ቆንጅዬ ሀበሻ ሳተ ፈረንጅ ጋረ ሳለ እሷ ዘረፈ ቅርስ ራስ ደገመ ዘረፈ ቅርስ መለሰ ኮሜቴ አየ ነገር",
"ተለያየ መልክ፣ ባህሪ እና ስም ይዘናል፡፡ ፈጠረ ሁላችንም አንድ ሆነ ፈለገ ኖረ ተደረገ ነበረ ልዩነት አለማክበር፣ ራስ ስህተት ሌላ ወቀሰ ፈጠረ",
"ሴትዬ ማረ ፅጥታ ጠበቀ ቅእት እዳ ደገመ ያዘ መጣ ተማረ ስራ ፈት ወጣ ምን ያህል ጉዳት አለ",
"ግን አለፈ በጃነኖይ ራስ ጉግሳ ወል ነው ጀመረ ኢትዮጵያ አየር ሀይል የተደበዱት ከባድ ጦርነት ነበር፣ እቴጌ ጣይጡ ነበረ ሚደንቀው የኦሮሞው",
"ይህ የህወሓት ውሳኔ ቀድሞ አወቀ ነው አዘነ ነገር ይህ እኩይ ድርጅት ትግራይ ህዝብ ስቃይ ችግር በዛ ወሰነ ነው ግድ እንደ ቀድሞ ረገጠ ገዛ በትግራ",
"ትክክለኛ ፊደል ጻፈ እርስ",
"መልስ መለሰ ፈለገ ብቻ እነሱ ተባለ በመቶውች ከሚቁጠሩት ተረት ምሳሌ ወይም ጥቅሱች",
"አህመዲን ጀበል እና እሱ አይኖትች ነጋዴወች እስልምና ክርስትና ሀይማኖት ቡልሽታቸውን ቦታ አወከ ቆመ ግድ አለ",
"ጨዋታ ተጠነቀቀ ጀመረ ጨዋታ ነው ተስተካከለ ወደ ስፍራ ተጓዘ ክለብ ንቁ ቤተሰብ ሰላም ወደ ከተማ መለሰ ጊዮርጊሳዊት ገና ይህ ላይ አበበ",
"ልጅ ሲራክ ብዓል እስኻን ንዓኻ ዝመስሉን ነዛ በዛ ቭድዮ ዘለለ አመንዝራ ናይ አባ አይነት ዘርኢ ማህበር አንድነት አብ ጽርግያታት አስመራ ብድፍረት",
"እስክንድር አገር ልጅ ሞት ደም ፈሰሰ እና አለ ደረጃ የሚያስቀምጥ፣ ጥፋት የዠግና እና አሸባሪ ተደረገ ዱኩማን ሆነ ብቅ አለ»",
"ሰቆቃ በአርማጭሆ ይህ ፎቶ የታገተ ገበሬ አሰቃቂ ሁኔታ ገረፈ ቤተሰብ ላከ ፎቶ ነው",
"ጣም ልብ ሰበረ እግዚአብሄር ነፍስ ማረ ለቤተሰቦቸውና ተወዳጀ መፅናናትንና ጥንካሬ ሰጠ",
"ስም መቃብር ላይ ዋለ አለ ይህ ነው",
"መልካም አዲስ አመት እንዲሆንለወት ተመኘ",
"ይህ እስክንድር እንቅስቃሴ ደገመ የሚያደናቅፈውን በላይ አካል ማንነት አወቀ እስክንድር ላይ ዶክተር በላ መንግስት/ ፖርቲ አስፈላጊ መሰለ",
"ጽንፈኛ ፋኖ ተባለ ለም ያ ጉዳቹሁ ወጣ ነው ምድረ ሰው በላ አውሬ መስጊድ አቃጥላቹ አማራ በላ ዛሬ ሰካ ጠፋ ይህ መርዝ",
"ህዉሃት ዲያብሎስ ነዉከዲያብሎስ ጋረ አበረ ዲያብሎስ ብቻ ነዉ",
"ይህ ነገረ ሰው ሁሉ ሰው ኖረ እሱ አለመ መሰለ ነው ቤተክርስቲያን ማርያም ጊዮርጊስ ደረሰ መጣ ቀረ ብይ እገምታለሁ፣ ሀሰት መሰከረ አለ በላ",
"ቦርኮጥንብ ብቻ",
"አለ ጎሬ ውስጥ ወሸቀ ተገኘ ነፈሰ ኰሰመነ ጥግ ነው፡፡ ከኢትዮጵያዊነት ከፈተ ፈጸመ አንወርድም፤ አራጌ",
"እጅግ ጣም ክፉ ሆነ ደዌ",
"ጣም ኖረ እኮ ምን ያህል ኖረ ዘነጋ",
"አሜን አሜን አሜን ሰላምዬ እኔ",
"ጠራ ሰፋ ነው በረታ",
"ግርማዊነታቸው ንዴት ውሸት አመነ ሁሉ ተከተለ አየር ላይ ተንሳፈፈ እንዴ",
"ይህ ነው አጣ ጠያቂ ንዴት ዋለ አደረ አመሸ እግዚአብሄር ባረከ እግዚአብሄር ተመሰገነ ይህ ደህና ነው ሌላ ግን",
"ኢትዮጵያ ቁርጥ ቀን ምን ተሳነ ፈጠረ እድሜ ጤና በዛ ሰጠ",
"እባክህ ወንድም ቀየሰ ተበጀ ጠንቅቀን አስተዋለ አወቀ ነው አለ",
"ማጭበርበሩ ነው እንጂ ጠላ ግልጽ አማራ ሰራ ምን ችግር አለ",
"እግዚአብሄር ትእግስት ባረከ ትእግስት አጣ ብዙ ጉዳት ራስ ሌላ ላይ ደረሰ አለ ትእግስት አጣ ስፍራ ለቀቀ ጸጋ ጣለ በረከት ጐደለ አለ",
"ስህተት ወደ አካውንታቸው ገባ አንድ ሚልዮን ብር ቅንነት መለሰ ግለሰብ አቶ ደሳለኝ ብስራት ቅንነት እውነት ራስ ነገረ ሆነ ታማኝነት ደገመ ሀቅ ሌላ",
"ምነው ጫረ ቈላ ነበረ እናንተ ነበረ እንዴ አወቀ ሄደ ጠና",
"እመንእንጂአትፍራ እግዚአብሄር ስራ ግሩም ድንቅ ነው ጥንታዊ ገዳም ማርያም ጠሞዞ ደቡብ ትግራይ ኣላጀ ቦራ ቸለና",
"አስቸጋሪ በአል ሰሞን ተደረበ ሊግ ተውጥቷልስለመሸነፉ አሰበ ከበደ ይህ ሠዓትበቀጣይ ሊቨርፑል ነጥብ ጣለ ቻለ ማነው ቀጣይ ሊግ ጨዋታ",
"ጃዋር አሜሪካዊነቱን ቀየረ ምን ህግ ይሄን አወቀ ሆነ ተገኘ ተደረገ ይህ ህግ ጥሰት ነው አገር ውስጥ ፖለቲካ ውጭ ዜግነት አለ መረጠ",
"ገራ ጥፋት ካሳ ከፈለ ይሏቸዋል፡፡ ቦረናዎቹ አልተስማሙም፡፡ ገራ ቦረና ተባለ መሬት የለም፡፡ ኤላውንና ውሀ",
"ኢሳ ሰራዊት ጌታ ህዝብ ግብፅ፥ እጅ ስራ አሦር፥ ርስት እስራኤል ባረከ ይሁን፡ አለ ባረከ ያ ቀን እስራኤል ግብጽ",
"ከኢዜማም ጋረ ተወሀደ አንድነት ሀይል ነው ፖሊሲ ፈጨ ስልጣኔ ምልክት ነው ዘረኛ ዘራ ብን አለ",
"እኛ ምንጨነቀን ፈለገ ሾመ ሻረ ሀቅ አማራ አዴፓ አለ ብልጽግና አለ አግዜማ አለ መረጠ ሙት ሙት ነዉ የሚሻመዉ ሞተ ደሞ ቀበረ ነዉ",
"መንግስት ዩኒቨርሲቲ ዘጋ ወታደር መረቀ ላይ በረታ ለየ ኦሮሚያ አሚባል አገር ዩኒቨርስቲ ተማረ ቤት ሸኘ ወር ወታደር ምረቃ ቀጠለ የትኛው ጠላት አደነ ሆነ",
"አንተ ብቻ አደለ ዜና መቀሌ ከውስኪ ጋረ በረዶ ውሀ በጎ ወሰደ ኋላ ዋለ ዋለ ዋለ ይባላላ ቀረ ድራማ ይህ ነው",
"ጽሁፍ ለቀቀ የመጅሊሱ ገለጸ ብቻ ነው ኡስታዝ ድር ሁሴን አነበበ ሞጣ ጥቃት ጠራ ቡድን ሪፖርት ጽሁፍ ወጣ ጠራ ነው ወሰነ ሪፖርት ነው",
"እምነት ቦታ ተባለ ወደደ የሙሰሊም መሰጅዶችን ብቻ ነው ነደደ ጨፈረ ነበረ እምነት ቦታ አለ ሁሉ አታሰመሰለው እውነት ምን አነቀ ግን",
"አማራ አክቲቪስቶችን ተከታተለ እርግጠኛ ነው እንደዛ አይነት ሰው ሆነ ፀብህ እነሱ ጋረ ነው",
"ይህ ሰው ቅርጫ ጀመረ",
"መልካም ጅማሮ ነው እኛ ከጎንህ ነው",
"እንዲህ ሸጠ ተናገረ አሪፍ ነው",
"ከእንደ አንተ አይነት ደደብ መሀይም ጭራቅ ለቀቀ ዘመን ይህ ሁሌም አብየየየየ",
"ኢትዮጵያ ንግድ ስራ ኮርፖሬሽን ውጭ ምንዛሪ ተገኘ ዋጋ ንረትን ረጋ ረገድ ወጣ አለ ሀገራዊ ሀላፊነት ጠነከረ ቀጠለ አለ ተገለፀ፡፡",
"ይህ አለም ጣም ንጹህ ሆነ ቤተሰብ ተሰቃየ",
"እንግሊዝ ሩቅ ቀና ገዛ ሀገር ላይ እንደ አለፈ በሽታ አሳፋሪ ሁኔታ ተሰራጨ",
"አማራ ባለስልጣን ሀሳብ መሞአገት ቅእት ተገዳደለኦሮሞ ግን ሀሳብ እየተፋጬ ነው እና የት ነው ስልጡን ህዝብ ወይስ ስልጡን መራ ተሻለ አፈረ",
"ሌላ ቀረ በትትክል እንኳን ጻፈ ተገነዘበ እንኳን ቁማር",
"ዝም ልጥጥ ራስ",
"ኢትዮጵያ ተስፋ እግዚአብሄር ብቻ ነው እሱ ዘላለማዊ ጥበብ ኢትዮጵያ ከዉድ ልጅ ጋረ አረቀ",
"አለ ነው አሜን",
"ምን ላከ እለተ ሰንበት ከሰሰ እረደኤትና በረከት ከፈለ",
"ቅዳሜ ታህሳስ ቀን ሜክሲኮ አደባባይ አካባቢ ተገኘ አዲስ የኦፌኮ ቢሮ ምረቃ ስነ ስርአት ላይ አቶ ጃዋር አባልነት አወቀ ፓርቲ ተረክቧል፡፡",
"ጊባ ጊባ ሜባ ሞባይል ኢንተርኔት ፓኬጅ ሽልማት ቀደመ መለሰ ወደደ ላይክ እና ሼር ተደረገ ሸለመ እድሎን",
"አፈር ነው ወደ አፈር መለሰ ደም ብልጽግና ነጋቲቭ ሆነ ዶክተር",
"የምረጡኝ ዘመቻ ጀመረ መሰለ ዛሬ ጀመረ ቻናል ቀየረ ላጧጥፍ",
"ራስ ንዴት ነው አየ ግን",
"የfb አካውንቴን ተዝረፍኩ አሁን እኔ ምን ተገኘ ነው ሌባ አመል ዳቦ ላሰ ተባለ ይሄኔ ነው ሆሆሆ ወይ ጣጣ",
"እንዲህ አይነት ባረከ ቀደሰ ተግባር ሰራ ሸር ተንኮል ላይ የተሰማሩትን አንጀት አድብናቸው መጣ ይህ አለ",
"ወይ ጉድ እኔ ዩኒቨርስቲ ሰላም ነው አለ ታበየ ሆነ በስተቀር ወንድም እህት ገደለ ሰም ምን አይነት ትምህርት ነው ተማረ ትምህርት ማረ በቲንሹ",
"ቃልሲ ንሰብኣዊ ሓርነት ህዝቢ ኤርትራ ያኢ ብእቋቑሖን ሓሩጭን ጠጠው ክብል ንህቡብ ተቓላሳይ አማኑኤል ኢያሱ ብብጽባጽ እንቋቑሖን ሓሩጭን ዝለኸይዎ ሰባት እዚኦም 'ዮም፤ ይሰነድ",
"ገና የወደፊቶቹን",
"ወለጋ ህዝብ ኢትዮጵያዊነቱን ተቀበለ ሰው ነው ግደያ እና አፈና ቆመ",
"እንኳን አክሱም ጽዮን አራ አመታዊ ክብረ ባኣል ደረሰ ጽዮን ከበበ ዙሪያ መለሰ መዝ ፵፯፲፪ የአክሱሟ ፂዮን አገር ሰላም ህዝብ ፍቅር አንድነት ሰጠ",
"ጀዝባ፣ ፀረ ሙስሊም አለ አለ ደግሞ፣ ውሻ ይጮሀሉ፣",
"እኛ ነው አየ",
"ተወገደ ነገር አንዳች ተወገደ ጥንብ ዘረኛ አንተ አይነት መሰለ የኢዜማ ቡችላ ውሸት ማንነት ደበቀ ፀረ አማራ ጠል ፕሮፓጋንዳ ትነዛላቹ መርዝ ወረኛ ጥንብ ዘረኛ",
"ብልጽግና ሰራ ሽንፈት ነው በላ አህመድ",
"ማንኛውም ስራ ሰራ ሀላፊነት ተጠያቂነት ነው ውሸት ነው አለ አካል ከሰሰ ይችላልይህን ረዳ ወጣ አካል ኢትዮጵያ ቢሮ አለ",
"መልካም ጌታ ልደት እርስ ከበረ ፕሬዜዳንት",
"ስለ ኢትዬጵያ ኦነግ ነዛ ኖረ ፕሮፓጋንዳ አሁን አሁን አህመዲን ጀበል ሀይማኖት ስም ለቀቀ ውሸት መካከል ምን ልዩነት አለ ብሄር ሞከረ ተሳካ አማራ",
"ወንድ ቆንጆ ምርጥ ስራ ነው፤ ውሸታም ጊዜ ወሰደ ሰማ ሰቀለ እኮ ጀመረ አልበም ገበያ ላይ አዲስ ምርጥ ሳውንድ ያዘ መጣ ነውበዚህ",
"አንድ ሀገር ጠንካራ ብሄራዊ ቡድን መሰረት ጠንካራ ክለብ ነው እግር ኳስ ክለብ አንድ ሆነ ፋሲል እነማን ረዳ ጠንካራ ብሄራዊ ቡድን መሰረት ጣለ",
"መሸታ ቤት ብልግና ላይ ያዘ ቀረበ አለ ትራፊክ ተነሳ ነፍጠኛ ጋረ ምን ተያያዘ",
"ደሞ ጨመረ አለ",
"ጠፋ ለማ ቻለ በዛ ሀገር",
"ቈላ አሁን እውነት ተነጋገረ ተባለ ተማረ አልባሌ ቦታ ዋለ ምን አነሰ",
"መንግስት ቀደመ ተግባር ዜጋ ደህንነት ጥጋበኛ ስርአት አልበኞች ተከላከለ ነውይህን መሰረታዊ ተግባር ፈጸመ ቻለ መንግስት ሰፈር ጥጋበኛ ተጫወተ ነው የሚሆነውበአንድ ሀገር",
"ውድ ይህ ታታ አለ የፌስቡክ ገጽ ጠለፈ ዘጋ ሪፓርት ተደረገ አበረ ጠየቀ ተመሰገነ",
"መሰለ እና ሆነ መሀል ልዩነት አለ አንዳንድ ሰው ጀመረ ጣም አስፈላጊ ነው መልካም ምሽት",
"ኢትዮጵያ ሀገር ተከላከለ ሚንስትር ማ መገርሳ መራ ከፍተኛ የልዑካን ቡድን ኢትዮጵያ እና የአሜሪካንን የሁለትዮሽ ከለከለ ትብብር ጠነከረ ዛሬ ጠዋት",
"ኦሮሞ ወግ/ባሕል/ቐንቓ ተወልደው/ኣድገው ኦሮሞ ሆነ ላቀ በከፊሉ/ሙሉ ሙሉ ኦሮሞ ማህረሰብ ወጣ ተወልደው/ኣድገውና ኖረው/አየኖሩ ዛሬ ጊዜ በኃላ የኦሮሞታጋዮች ሆነ ኣጋዳላዮች",
"ቡድን ማንነት እና መብት ተመለከተ ሰላ ጥያቄ በማቅረብክ ደስ አለ ይህ ድግሞ theoryን ፍሬሞርክ በተወሰናነ ደረጃ መጠቀምክ ጥቁር",
"ሚኒሶታዎች ተመሰገነ ዲሞክራሲ ድል ኢትዮጵያ እስክንድር",
"ምን አበረ ጨበጨበ ከረመ ግልጽ ሆነ",
"ጠራ ቀመሰ ነው አለ ነው",
"ብዓዴን ተባለ ጠላት ፍጥረት አማራ ተባለ ተቋም እና ድርጅት ጠለፈ እና ደከመ ጠፋ ጉልበት ሌላ ተቃራኒ ተሰለፈ ላይ ዋለ የት ደረሰ",
"ሰላም ዶ/ር በላ ግን ምነዉ አለ እኛ ሙስሊም ጉዳይ ምን መጣ ነዉ ወይስ ንቀት ነዉ ዳንኤል ክብረት አጠገብ ራቀ አማራ ክልል",
"ሌባ ዓይነ ደረቅ መለሰ ልብ ደረቀ ጀመረ ዙሪያ ብቻ ሆነ ውስጦትን መረመረ ውስጦትን",
"ጠ/ሚኒ ዶ/ር አቢይ ደቡብ አፍሪካ ተገኘ ኢትዮጵያዊ አለፈ መልእክት",
"ጉድ አለ ብቻ",
"አሜን ውድ",
"አዳዲ ተከታይ ተገኘ ይህንን ወደደ ሁሉ መለሰ መለሰ",
"አየ ተዋወቀ አንድ ታላቅ ሴሌብሪቲ ጋረ ነበረ እንኳን አወቀ",
"ፈራ አለ አንተ ብቻ መወደስ አለ አንተ ብቻ እልሃለው ዛሬ እኔ ቆመ አንተ ሰጠ ዘመን ቅኔ ልኡል ሆይ አደረ ባረከ",
"እለት እለት ደነገጠ ሆነ መጣ አሰቃቂ ትራፊክ አደጋ መፍትሄ ምንድን ነው ወጣ ሰላም ገባ ህልም ሆነ እኮ ነው ቀን ቀን ሞተ ወገን ብዛት ጆሮ ጭው ተደረገ ነው",
"አረ ይሄ ነገር ንዴት ነው ነገር ምን ርኩስ ነፈሰ ነው",
"ኧረ አነሰ እንኳን ጥምረት ቀጠለ ተወ",
"ተስፋ አለ እኔ ሴት ልጅ ፈለገ",
"ሌላ አለ ደነዝ",
"ከብት እጅ እጅ አለ ብይ ሳበ አለ ነው ሳር እንጂ ሰው ተስፋ ያዘ አወቀ",
"ከአቀንቃኝነት ወደ አነቀ ተሻገረ ደገመ በለጠ ጠራ ተካከለ ወጣ ነበር",
"ፈጠረ ሆይ አውስትራሊያ አለ ፍጥረት ዝናብ ልከ ሞት አደገ ተመሰገነ አንተ ሁሉ ቻይ፡ ሁሉ አምላክ ነው",
"አብዛኞች አማራ ክልል ባለስልጣን ኑሮ አዲስ አበባ ነው ክልል ስራ ሚሰሩት አውሮፕላን መለሰ ነው",
"ምድረ ቀጠፈ ካድሬዎች እንደ ድሮ ሆነ ቀረ ጫና ተደረገ ቈጠረ እንደ ወያኔማ ህውን ኖረ ተሰናበተ ነበር ወያኔ ካህዲዎች",
"ቀይባህር ፈለገ ጠፋ ብዙ ነው አንተ ፈለግ ወደ ኤርትራ ሄደ እና ሞከረ ባተ እዛ እንደ ቀረ አንተ ቀረ ኤርትራዊ አንድ",
"ይህ ከበረ ጠ/ሚንስትራችንን ፊት አላህ ረዳ ፤የአ/ሳ ግድብ ጀመረ ጊዜ አነስተኛ ሀይል ማመንጫ ተባለ በደ አአ በጣሊያኖች ሰራ",
"ህዝብ ነቃ ዲሞክራሲ ተሳተፈ አደገ ዲሞክራሲ ተቋም ግንባታ የዲሞክራሲያ ምርጫ ባህል ዳበረ ተጋዘ ስራ ቅድሚያ ሰጠ ገባ",
"ሌባ አይነ ደረቅ አለ ኢዜማ ዜጋ ከለገጣፎ ቤት በፋሽስቶች ተደርምሶ በረሀ ላይ",
"እውነት ነው ግን ምን አለ እውነተኛ ሆነ እስክንድር ነጋ እውነት ቆመ እስክንድር ነጋ አንተ ነጻነት ሰጥትህ እሱ መከረ አንተ",
"አፍ አለ አንተ ተሳሳተ አለ እኮ ነው",
"አንድ ቦታ ህዝብ አብሮነት ተበጀ ሌላ ግዜ ለአፈፃፀም ተመቸ አለ ነበርግልፅ ተደረገ አለ",
"አሜን ክብረት ሰጠ",
"ስደት አለ ወገን ተስፋ ነው",
"አቶ ማ ይህ ጠበቀ ከፈለ ቻለ አቁዋም ያዘ የውጡት ሀይል ሚዛን አየ የነጃዋርን ቡድን ተጠጋ ተበጀ አለ ከንቱ ግላዊ ፍላጎት ተነሳ ሆነ",
"ይህ ገጠመ ወጣት ተዘወረ ፈንድ ጠቀመ ሆነ አረገ የአአ ክልል መስተዳድር ተመሰገነ እርስ ተመሰገነ",
"በባለፉት ቀና አሜሪካ ዉጭ ጉዳይ ቢሮ ባግዳድ አሜሪካ ኤምባሲ ጥቃት ውግዝ ገለጸ ኢራቅ ዉስጥ አለ ለዉጥ ንቃት አየተከታተሉ ሆነ ሰማ ሰው ትርጉም ምን",
"እንዲያ አለ ፒስ እቃ አንቺ ጤና ሳበ ነው",
"ዕንቁዎችን ቀበረ ወርቅ ቅቦች ተጥለቀለቀ ነው ለቤ/ክ ሰራ ታላቅ አባት በረከት ደረሰ",
"ግመል ጠጣ አለ የለ መላጣ",
"ድንቅ ውይይት ነው ተመሰገነ ቀጠለ",
"ሳይንስ ከፍተኛ ትምህርት ሚኒስቴር በበኩሉ ከእገታ ለቀቀ ለቀቀ ማረ ማንነት ዩኒቨርስቲ ጠራ ጥረት ተደረገ ስልክ ሰራ አለ ጥረት ሰካ አለ ተናግሯል፡፡",
"ቀጠለ ምርጫ በሇላ ኪሎ ኖረ መንግስት እርዳታ ገንዘብ ከፈለ ወጣ ዘለለ ስልጣን ኖረ አብዛኛው ክልል ፌደራል ማይታዘዙ ነጻ ግዛት ይሆናሉልክ እንደ ሰሜ",
"አንድነት ሁሌም ለየ ነው ቤይብር አንበሳ",
"/የኢንጂነሪንግ ማረ ጤና ችግር ገጠመ ሻንጣ ሸከፈ ወደ ቤተሰብ ትሄዳለች፤ መሸ ጮኸ ስልክ ሰማ አለፈ ሴሚስተር ፈተና አምልጠዋታል፣ ደሞ በትህርቷ",
"ልሙጥ ወፈፌ ወደደ",
"እለተ ምፅአት ዛሬ ነው ተባለ እንኳን ተስፋ አትቁረጥ፤ ገንዘብህን፣ ጊዜ እና ዘመን ከንቱ ባከነ እውቀት እና ገንዘብ ድህነት ተጠቃ ነቃ ተጋ አለ ነገር",
"እኔ ድንቅ መራ ዶር በላ ህዝብ ኰራ አኮረህኝ ሄደ ድል መጣ ለወገነህ ደረሰ ስሆንከደ ኮራሁበህ በረቀ ሁሌም ከጎንህ ነው",
"ጣም ሳቀ ይህንን አመነ አንዳንድ እምነት ተከታይ የኦሮቶክስ አባት ንዴት ከቀስተ ደመና ውስጥ ሶስት ቀለም ብቻ አየ አለ ሙድ ያዘ ነበረ",
"ፖለቲካ ነካ ሰው ውስጥ እንደ እስክንድር ነጋ አይነት ጠንጋራ ከተተ ከወዴት ተገኘ",
"ድሀ አምላክ ናደ ተሻገረ መልካም ነበር እንዲሁ ንጹሀን ደም ቀለደ ዘመን ያረግልን ዘንድ እኔ ግን ተመኘ እንደ ሳኦል",
"አማራ ብሄርተኝነት ያነገባቸው ፍትሀዊ ጥያቄዎች፣ ጉዞ ፍጥነት ፈተና ተሻገረ ብቃት ገባ አየ አጭር ጊዜ ውስጥ ድል በቃ ጥርጥር አለ እንስራ፣",
"ማረ አበደ ተማረ ገባ ወደየመጡበት ሁሉ መለሰ ነው",
"ትንሽ ልክ አለፈ ይህ ላይ ጻፈ እቃ አንተ ራስ ላቀ ችግር አለ እንዲህ አይነት ድርቅ አለ ጥላቻ አንተ እነሱ ምትለይበት ምን ነገር",
"እውነተኛ ሰላም ሰላም ምንጭ ጋረ ተስማማ",
"አራት አቅጣጫ ጃንጣላ ያዘ የሚለምን፣በየቤቱ ተኛ አለ ዳንኤል ወንድም እህት ነው እንዴ ፣ኣረገኝ፣ ተወ",
"መቼ ነው ግን ይህ መርዶ መጣ አሁን ላይ ነው",
"ጽዮን ግርማ የጋዜጠኝነት ማማ",
"እሱ ንብ ተወራ ፈረሰ አሞራ ጊዮርጊስ ጊዮርጊስ ኢትዮጵያ አደራ/፪/ ሰላም ኢትዮጵያ ሰላም አገር ላከ ላከ ቸር አምላክ ፳፫ ቅዱስ",
"ጉልበት ያዘ ሀገር ጉልበት ብቻ ቈየ ቻለ ተገነዘበ ወያኔ አቅም ጐለበተ ተቀናቃኝ ሀሳብ አፈነ ህዝብ ከፈለ ብቸኛ አማራጭ",
"ደንብ ተደራጀ ቡድን ሰራ ተገኘ ነገ ጁምኣ ሞጣ አለ መርህ ታላቅ ገንዘብ ማሰቤሰብ ተካሄደ አካውንት ከፈተ ብር ገባ ጀመረ ሰው በታገቱት ጉዳይ ወጠረ መሰለ",
"ሁሉ ባለድርሻ አካላት ኢትዮጵያ እናት ህጻን ጤንነት ደረጃ ተሻሻለ ጋራ ሰራ ገባ ቃል ዳሰ ጥሪ ቀረበ",
"በአል የጥላቻ፣የመፈናቀል፣ የስደት፣ የውድመት፣ የክህደትና ሞት መናፍስት እሳት ነቃ ከሰመ የሰላም፣ የፍቅር፣ አበረ የመስራት፣ አበረ የመማር፣የመኖርና ለማ ጌታ ነገሰ ተደረገ",
"አመሸ ቦታ እንኳን እመኝኝ ኤልያስ ስንት ጠራ",
"ቀን ለአማርነታቸው ህይወት ሰጠ ዜና ሰማ አማርነቴን ወደደ ጨመረ አማራነትን ይህ በየተራ ወደቀ እና ህይወት ዋጋ ከፈለ ደም ገነባ",
"እግዚአብሄር ስእል ሳለ ኪሩቤል ጋረደ መቅደስ አንቺ ነው ንፅህት ሆይ ለወጠ አንቺ ሰው ሆነ ቃል ሐጢያታችንን የሚያስተሰርይልንና አበሳ ደመሰሰ",
"ብሬ እቃ ንግግር ራስ ምክንያታዊ ሆነ ምርጥ እይታ ገረመ ትንታኔ ጋረ ቀረበ ቻለ የፓለቲካ ሰው ነው",
"እንደ አንተ አይነት ደደብ ጠባብ አይቸ ለቀቀ",
"መንገድ ትራፊክ ነጻ ሆነ ሰላም ነው",
"ዞር አለ አየ ብዙ ተመለከተ ውድኛም መጣ መልካም ነገረ ይመልከታሉ",
"ይህ መሰለ ዘመን ቸረ እውነተኛ ዶክተር ተበሳጨ ነገር ዶ/ር ደረጀ ጠራ እነ አንተ ዶክተር ተባለ ወይ ጊዜ ተሰኘ",
"እዉነተኛ ፌዴራልዝም ገነባ በላ ካድሬዎች ታከለ ኡማ ጨመረ ተስፋ ቁረጡ፣ፕሮጀክቱ ማን ሆነ አወቀ",
"ከሳ ቡና ሸጠ ወር ነው",
"መልካም ዜና ይኼውልህ፦ ኢየሱስ ክርስቶስ ልደት ምክንያት ተደረገ ነገ ጧት ላይ ጊዜ መድፍ ተኰሰ ከለከለ ሚኒስቴር አወቀ",
"ፍሬ ቢስ፣ፍሬ አልባ፣ መሰለ ነገር፣ኮተት፣አርቲ ቡርቲ፣የወረደ፣ውሀ የማይቋጥር፣ተራ፣",
"አንተ ደደብ ዲያቆን ምናባህ ተደረገ ደነዝ",
"በአል ሚስት አንድ ወንዝ ይቀዳልዘንድሮ ጊዜ እናንተ ነው",
"ያስነበብከን ሰውዪ ፈረንጅ መጽሀፍ ጠቀሰ አንተ ዘባረቀ ትክክል ተደረገ አለ አሰበ ሳተ ሰውዬ ሆነ አንተ ኤርትራ ተወራ ኢትዮጲያ",
"ማንበብ ቻለ",
"ወደ ግማሜዝ ሄደ ተሽከረከረ ማሽን ኰረጀ ተደረገ ችግር ጓደኛ እኩል ያዘ አስቸጋሪ ነው ችግር ወደ",
"ሰጠ ጊዜ ምን ሰራ ከንቱ ጨረሰ ስልጣን ገዛ ፍቃድ አራዝመያለሁ አለ ጊዜያዊ ህገወጥ መጅሊሱ ዛሬ በማላገጥ ላይ ነው",
"ስለ አስፈላጊ ነገር ተወራ ነውር ተደረገ ሰነበትን",
"ግጭት መንስኤ መንግስት ድክመት ሆነ ሳለ ይህ አመነ እና አመለጠ ፍለጋ መረቀ ደህና ስራ ተገኘ ሀገር ላይ እዳ ጨመረ ምፍትሄ ሆነ",
"ይቺ ጥበብ አንዳንድ ሰው ስታንገላታ ነገ አለ",
"ህክምና ባለሙያ ላቀ ክብር አለ ዶክተር እድሜ ሰጠ ቅንነት አደለ",
"እጣ ሀይቅ ውስጥ ተገኘ ለየ ገዳማት ጀልባ አገዘ ሌባ ደገመ ዘረፈ ነው ሀገር ዘርፈ ብዙ ጥቅም ሰጠ ቻለ አባት ጥበብ ያዘ መፅሐፍት የት",
"ሳቀ ነበር ግን ቁጭትና ብስጭት ቻለ ሽንፍላ ትክክለኛ ቃል ነው",
"እኛ ብሄር ጥያቄ ቅድምያ መለሰ እስከዛ ሌላ ችግር ኖረ ዝም አለ አጀበ አለ ፖለቲከኛ ዛሬ ተራማጅ አለም መጠነ",
"todayእንቋዕ ናብዚ ደረጃ በጻሕካ፡ ህግደፍ ንዕላማታትን ራእን ህዝባዊ ግንባር ዝረስዐ መጻኢና ዘጸልመተ ውድብ",
"እኛ ማ ፈራ አንተ ነገረ ኪላሽ አረጋ አለ ነው አለ",
"ግራ ዘመሞች ግን እቃ ዘመመ ቀረ ቀና አሰበ ሆነ ቀና ቀና ተመኘ ሆነ አለ ነው",
"መስጊድ እና ቤተክርስትያን ተምታታ አለ አመት ሙሉ ቤተክርስትያን መሰለ ሰው በላዎቹ ወንድም እንደ ችቦ ነደደ የከረሙት",
"የህወሓትን መራ እና ትግራይ ህዝብ ግን ደነቀ አለፈ ከባድ ነው በላ ተባለ ሰፈር ልጅ ይቺ አገር ምስኪን ህዝብ ጠፋ ቀደመ አወቀ ነበር",
"የፈረጅኩት ማህበረሰብ ለም ጻፈ አንብበህ ሆነ",
"ሲዳማ ቡና ደገፈ ድል በኃላ ከተማ ሞቅ ደመቅ ተደረገ ነበር",
"ክብር ሰንደቅ ለማ ይህ",
"ምክር ቤት ሽብር ወንጀል ከለከለ እና ቈጠረ ቀረበ ረቂቅ አዋጅ ጸደቀ",
"ያረቢ ጌታዬልትሰቅሉኝ ነው አረ እኔ ራስ",
"የደብረታቦር ወጣት አነሳ ጥያቄወች አማራ ክልል ጥያቄወች ነው ዘመድ በጎጥ ሰፈር ወቀረ አዴፓወች አናት ተከለ ልብ አለ",
"ምነው አለ አቢቹ ኢሱ ጭሱ ቀልብ ወደደ",
"ከበበ ወደ ሀገር መለሰ የዉህደት ፖርቲ መሰረተ ደገመ ምን ዉህደት ብለክ ምስኪን ኦሮሞ ወንድም ጨፈጨፈ አንተ ቆርቆሮ ነካ መጨዉ ልማድክ ነዉ",
"አቤቱ አምላክ ሆይ ሰው ሳበ ሰው ሳበ ተደረገ",
"ፀባይ ብር አነሰ ገበያ ላይ ተገኘ አለ ማሰሽ ከባድ ነው",
"ተኛ አየ ናፈቀ ይህ አመሰግናለው",
"ይቅርታ ፍቅር ወለደ ፍቅር አንድነት ወለደ አንድነት ብልጽግና ወለደ ብልጽግና ስኬት ወለደ",
"ሙሉ ሙሉ ውሸት ነው በመግቢያውም፣ በመካከሉም፣ ወጣ እንዲህ አለ ሀሳብ አለ",
"ኧረ አንተ ሠውየ አደብ ግዛ፤እታገላለሁ አለ አስመራ ሴት ደራ ስንት ገንዘብ በዘበዘ ኖረ ሞራል ተባለ ፈጠረ ሦየ ነው ቢራኑ ማለት፣ስንቱን",
"ሰሊ እውነት አንቺ አመነ ነው ይህ",
"ሀገረ ነው አከከ መኩራራዬ ሰላሙ አከከ ነዉ ሰላምታ",
"አሜን መልካም",
"ይቅርታ ጋሼ ኦሮሞ ፖለቲከኞችን አመነ ዘመን ማሞ ቂሎ አንተ ብቻ ነው ዘመድ ጋረ ብትወግን ተሻለ ሞከረ ቻለ አለቀ አንዳንድ ሳበ አዘነ",
"ትርጉም፣ እኛ ወደ መቀሌ በረረ አዴፓ ነው",
"ይህ ቦታ ከተማ ወጣ አለ አዲስ አበባ ኦሮሚያ ድንበር ላይ አለ ሆነ የመልክአ ምድር አቀማመጥ ነፈሰ ዳሰ ይሄን ቦታ ያላያቹ ክርስቲያን ቦታ አየ በረከት ከፈለ ሆነ ዘንድ ጋበዘ",
"በሞጣመስጂድ ቃጠሎ ፌዴራል መንግስት ቸልታ አማራ ክልል መራ ልብ ልብ ሰጠ ማንኛውም መናበባችሁ ሳይገበን ቀረ ነው ጊዜ ጠበቀ ያኔ ለልምምጣችሁ ቦታ ኖረ",
"እነሱ በላይ አካል ብር ስልጣን ፉክቻ ወረድ ተደረገ ደሞ ድሀ ህዝብ ተፋለመ ጨዋታ ሰአት ኰሳ ነዋ",
"እንኳን ብርሀነ ልደት አደረሳችሁ፣ ደረሰ",
"አምላክ እግዚአብሄር ፈተነ ዘንድ፥ አለ አለ ትእዛዝ ጠበቀ ወይም ጠበቀ ሆነ አወቀ ዘንድ፥ ተጨነቀ ይህ አርባ አመት ምድረ እዳ መራ",
"ግራ ገባ እኮ ታከለ አባት እርሻ መሰለ ሙስና እና ሌብነት ተመቸ መልክ መሬት አደለ ነው",
"ሰውዬ ፖለቲካ ተነተነ ነው አለ ነው ከብት ነው እውቀት ስነ ልቦናም አህያ ነገር ነው",
"አንተኮ ጨዋ ጨዋ አደገ መራ ነው ለምንጊዜውም ባረከ",
"ማነህ አንተ አህያ ሞከረ ነው ዝም አለ አፍ ከፈተ",
"",
"ይህ ልጅ ጉጉት ጠበቀ ዘፈነ ለም",
"ዛሬ ቦሌ ኤርፖርት ተርሚናል ውስጥ በያዬሰው ሽመል ላይ ተደረገ ገታ እንግልት የኮለኔሉ ቆሻሻ ስራ ቅጥያ ነው",
"ቂቂቂቂቂቂቂቂቂ ታሪክ አተላ አዎ ታሪክ አተላ ጸረ አማራ ገደል ገባ",
"አማራ ክልል መንግስር ድሮ ተወ ገረመ ግን ፉኖ ነው አለ ጎንደር ከተማ ላይ ጥይት ተካ ዋለ ምን አርማጭሆ ወረድ አለ ጉራ ብቻ",
"አንድ ቀን ቆሻሻ ሟችዎችን መራ",
"ምን ነው ሽሪምፕ ፡፡ አይን ዝግ ተደረገ ገደለ ቻለ ፡፡",
"ውይ ፌስ ቦካ ተወ ነበር ረዥም ግዜም ሆነ እናት ሰካ ሁላችንም ሞተ ነው ሰከንድ ሳበ መልካም መልካም ብቻ ሳበ",
"ነገር ላይ ፕሮፋይልህ ላይ አለ ሰውዬ አማራ ነው እኮ ፋራ ነው ወይ",
"ሃሃሃ ቆንጅዬ ኧረ ላጠ ይሔን የs ቃል የት ነው መጣ ከፋ ለወጠ መጣ አገር ወጣ ብዙ አመት ሆነ እንዴ",
"ጓደኛ ጠቀለለ ሚንስትር አቢይ አህመድ የኖቤል ሰላም ሽልማት ተሸነፈ ሰማ ደስታ ጥልቅ ስሜት ገለጸ እወዳለሁ፡፡ ጠቀለለ ሚንስትሩ ቀጠና መጣ ሰላም ተስፋ",
"ፌደራል ፖሊስ ኮሚሽን ለማዘመን ቻለ ፕሮጄክት ቀረጸ ሰራ ነው",
"ይህ ግልጥ አለ ጠራ ነው",
"የራያ ህዝብ ማንነት ጉዳይ ህይወት ዘመን ቀደመ አጀንዳ ነው ይህ ተሳካ በቀር እንቅልፍ ምቾት አሰበ አሁን ላይ ጫፍ ደረሰ ሰካ አሜን",
"ይሄ ሰገጤ ቤት ውስጥ ጸሀይ መነጽር ተደረገ ይፎልላል",
"ሸዋ አማራ መራቤቴ ብአዴን/አዴፓ/ፒፒ አማራ ህዝብ መራ ወከለ ታሪካዊ ሆነ ህጋዊ መሰረት አለ",
"ደረጀ ወንጀለኛ ማህበራዊ የትስስር ገጽ ለየ ሴት እያጭበረበሩ ሆነ ተነገረ",
"ሀሰተኛ እውቅ ፍቃድ አተመ ማረ ተቀበለ አስተማረ ተቋም ደገመ ተገኝተዋል፡፡ አለ ምን ተግባር ልምምድ መረቀ ጤና ማረ አሉ፤ ብቃት",
"ጌታ ተባለ እንኳን ንዴት ጌታ ተባለ",
"ታድያ ቅጀታቹ ናደ ነው በር ምድረ ቱልቱላ",
"በጎ ነገር ሰራ አለቃቀሰ ፈለገ እኮ ሰይፍ ቀልድ ወዛ ብዙ መልካም ነገር ሰራ ነበረ አሁን ሰራ ነው",
"ብልጽግና ጋረ ወደ ፊት",
"ካነ ይህ ታላቅ ቀን አደረሶት እርሶንም ግደኞቾንም አመት ላይ አሜሪካ ውስጥ ኖሪያለሆኝ ያ ትልቅ ከተማ እንደ ዲሲ",
"ሰላ ተመሊስናኣምላኽ ይመስገንንዓመታ ከምሎምዘበን ሰላ የራኽበና ክብረት ኣሃበልና ህዝቢ ኣኽሱም ክብረት ኣሃበልና አባል ጸጸታ",
"ሀረር ፍቅር ሀገር አለ ነበር ikapaቅዳሜ ሰአት ያቋቋምኩት፡፡ ቀጣይ ምርጫ ከመረጣቹኝ ግባብዳ ደባ ላይ ከባድ ግብር ጣለ ብልጽግና ረገጠ ቃል ገባ",
"ኢትዮጵያ ንግድ ባንክ ጊዜ የሚገድልሎት ባንክ",
"ከብት ሁሌም ኋላ ነው",
"ህዝብ ችግር ቀረፈ ቻለ ቁልፍ መንግስት ሀላፊነት ቦታ ብቃት ቀረ በኮታየዘር፣የሃይማኖት፣የፆታ ወዘተረፈ ሆነ ውጤት ይኽው ነዉ",
"አየ ጠገበ ልብ ፈነጨ ደስታ አየ ማረ ሳቅ ፈገግታ",
"ቅድሚያ ያቺ ጥንካሬ ተገኘ ዘንድ ዱዓ ተደረገ አለ",
"ቴዲ ቻለ በእዉነት",
"ገባ አለ ሸዋ አይነት እና ሺ ሰው ላይ ተሳተፈ ሙዚቃ ነገ ስምንት ሰአት በየኛ ቱዩብ ለቀቀ እንኳን ደስ አለ ወንድም",
"ኦነግን ከእነ ትጥቅ ገባ ፈቀደ ይሄ መጣ ገረመ ነበር",
"ንዴት አንድ ጋዜጠኛ ንዴት እንዲህ ተራ ሰው ሆነ ታታ ወረደ እንኳንም ገንዘብ አንተ አላወጣሁ እግዚአብሄር ነው ጠበቀ ማን ሳተ",
"አ/አበባ ውስጥ ምን አይነት ስብሰባ ተደረገ ፈቀደ ሌላ ቀረ ሙዚቃ ኮንሰርት ተቻለ ተደረገ አንኳ የአ/አበባ ፖሊስ ወዲያው ልብስ ቀየረ",
"በኖቭል ኮሮና ቫይረስ ተጠረጠረ ሰው ቫይረስ ነጻ ሆነ ረገጠ ሀዋሳ፡ ጥር አመመ ደሬቴድ በኖቭል ኮሮና ቫይረስ ተጠረጠረ ሰው ቫይረስ ነጻ",
"መልካም አዲስ",
"እልልልልልልልልልልልል ልልልልልልልልልል እልልልልልልልልልልልልል እግዚአብሄር ተመሰገነ አሜን አሜን አሜን አሜን",
"ተማረ መንደር ቡና አጣ ሆነ ሰው ፈጠረ ጠበቀ ለየ ቀለደ ቀልድ እንጨት እንጨት አለ ዥልጥ",
"መሰለ መሰረታዊ ነገር ኖረ ጥቃት ደረሰ ቡድን አባል ተጠቃ ካስቡት ቡድን ግለሰብብሄርን ቋንቋ ሀይማኖት አንጻር ሰማ ኢእኩልነት ነው አብዛኛው ጊዜ ይህ",
"እንኳን ገና በአል ሰላም ደረሰ አለ አይነት የት አለ አየር ሰአት ስጥታየገናን በአል ምክንያት ተደረገ እስከ ጥር",
"ጥርት አለ ምልከታ አለ ብዥታ ጠራ ረዳ ጠቀመ ፆሁፍ ነው ሊነበብ ገባ",
"ውድ እህት ግይጥ ወገን በለጠ አለ ሞጣ አንዲት ጀምበር ዘመን ከበተ ሀብት ንብረት ዶግአመድ ሆነ ሙስሊም ወገን አላህ",
"ፌደራሊዝም ካባ ለበሰ ገነጠለ የከሸፋ ስብስብ ጩኸት",
"'እንግዲህ ሁሉ ቀደመ ልመና ጸሎት፣ ምልጃ ምስጋና ሰው ሁሉ፣ ለነገሥታትና ባለ ሥልጣናት ሁሉ ተደረገ አሳስባለሁ፤ ይህ እውነተኛ መንፈሳዊ",
"መለስ ድፍት ተደረገ አምላክ አንተ አይዙገይም ጥምብ",
"ብልጽግና በላ ካሰ ጨመረ ብልግና ምክንያት ነው",
"ትንሽ ስጋ እንደ መርፌ ወጋ አለ ረሳ እቃ ወገን ቆመ ምነው ሰልፍ ወጣ ወንድም እና እህት ነፍስ ቀን በላ አረመኔ ስርአት ምነው ዝም አለ",
"እንኳን ደሰ አለ ውድ መራ",
"አነሰ ተገን ነው ማን ክፋት ማልጎዳ፣ ህይወት ጸጋ እምኖር፣ ጥቁት መልካም ሰራ ብዙ ፈራ ኖረ ሚታትር ገነነ ነው ራስ ሀገር",
"ባልደራስ እውነተኛ ዲሞክራሲ ምርጫ ነው ድል",
"አረ በላ በቃ ልመና ቆፍጠን አለ አረ ረፈደ ቀን አረ በላ እየወደድንክ ቆፍጠን ባለማለትን አንጣክ አረ እንለምንክ አረ ለመነ ወገብ አሰረ ምን መጣ ደፈረሰ ጠራ ቀረ",
"ፍጹም ግን ጋረ ማረ እናት አለ ውስዋስ ውስጥ አለ ነው ሚመስለው",
"ተመሰገነ አውሮፓ ዲያስፖራው ሀላፊነት ወጣ ብዙ እጥፍ ተረፈ ቀረ ሀላፊነት ሀገር ቤት አለነ ነው ፈተነ ወደቀ",
"አለም ባንክ ብቻ ሆነ ከተማ ልማት ቤት ሚኒስቴር ታከለ ኡማ የአደረጃጀት ለውጥ ላይ አለ ተቃውሞ ገለጸ ሰማ ሆነ ይህ ተከተለ ተደረገ አከለ",
"ሀሳብ ሰማ ደገመ ሀሳብ አጣ ሆነ አወቀ ጠራ ነው",
"ባለተግባሮቹ ዋሽንግተን ሲዎች ጨፈጨፈ ወገን ድምጽ ሆነ ታላቅ ህዝብ ምስጋና ደረሰ ክብር ዋሽንግተን ቀጣይ",
"እኛ ስተት ጥቂት ሰራ ክፉ ስራ ሰራ ለብዙወች ማረ ነው እላለው ሀገር አለ ሰው ልጅ ቀየረ ብዙ ሰራ ናቀ ጥቃቅን ክፉ ስራ ላይ ህግ",
"አጠነ አፈነ ነው እንግዲህ",
"እኔ ቆንጆ ኪዳን ምህረት ዳበሰ ኢዮብ ትግስት ሰጠ እግዚአብሄር ቀን አለ",
"ምህረት ለም ምህረት ለም",
"የዶ/ር በላ ጀመረ ፓርላመማ ቃለ መሀላ ላይ ተናገረ አንድነት አለ አንድ አይነትነት ሆነ ገለጸ ተቃርኖ ተፈጥሮ ህግ እና",
"እኔ ለሊት ብዙ ተኛ ነው",
"ውጭ ስልጠና ተገኘ ድል ተማረ መጣ ነው",
"ወሎ ልጅነት ናፈቀ ባህላዊ ዘፈኖች፦ ወሎ ደሴ ዙሪያ ዘፈን ዘመን",
"አማራ ህዝብ እርስ እሱ ሌላ ወገን ጋረ በላ ፈለገ ጎጃም ጎንደር አክቲቪስት ብቻ ሆነ ፖለቲከኞችንም ገለል እንድሉ ተደረገ አስፈላጊ ነው",
"ጐጠኞች ሁሉ ዘር ነው እሚያዩት/የሚለኩት",
"ኢትዮ ቴሌኮም መላ ሀገር ዩኒቨርሲቲ ተማረ አራት ሺ ማረ ጠቀመ ተደረገ ሚሊዮን ብር ገንዘብ ድጋፍ መርሀ ግብር ይፋ ተደረገ",
"ኤዜማን ምርጥ ኢትዮጵያዊ ዳነ ነው",
"ቦረና ዞን ዳረ ወረዳ ደረሰ መኪና አደጋ ሰባት ሰው ህይወት አለፈ",
"ይሄ እንግዲህ የተፃፈዉ ተማረ አለ ኦሮሞዎች ነዉ ሚኒሊክ የባሎጂካል መሳሪያ ተጠቅመዉ ኦሮሞ ጨረሰ አለ ነዉ",
"እንኳን ሰማይ ላይ ባንዲራ አየ ስም ጠራ ማን ዝም አለ ሰማ እንኳን ሰማይ ላይ ባንዲራ አየ ኢትዮጵያ ተባለ ማን ዝም አለ ሰማ ኢትዮጵያ ዘላለም",
"ዳጊዬ እኔ ጀግና ብዙ ሰራ ረዥም ጊዜ ነበረ ግንኙነት ረዳ በረታ ትራንስፖርት ዘርፍ ውስብስብ ችግር አለ ሆነ ሰራ",
"ይሄንን ቂጥ ገለበ ግዜ ገረፈ ያኔ ለቀቀ እብድ",
"ኦሮሚያ ክልል አነስተኛ ቤት አለ መሬት እንዲህ ጥንብ ጣለ ሱሉልታ ሰበታ ፣ሠንዳፋ፣ ቡራዮ ሀሉ መሬት ሽሚያ ደላላ ወከባ አለ ጥገኛ መራ",
"ዥልጥ ገሪባ ጀመረ ንግግር ቻለ አፍ ከፈተ ፊት",
"ወይ ህወሃት ጥላቻ ፖለቲካ ወጣ ሆነ ጥላቻ ሆነ ሌላ ምን ምክንያት አለ ፍቅር ዘረጋ እጅ ረገጠ ወጣ አወቀ ፍጻሜ ማረ",
"ስንት ብር የትኛው ጥቅም ሆነ ይች አለ እቅድ ሰነዘረ ቀለደ ጦጣ ተደረገ",
"ተነፈሰ ኖረ ሰው ጫነ መስኮት ከፈተ በሽቦ፣ ገመድ አሰረ ረጋ ባለታክሲዎች ላይ ደህና መብረቅ ወረደ አምላክ ጠፋ",
"ቀጠለ ሳምንት ደሞ ሌላ ሄደ እንዲህ አለ ምርቃት ተቀበለ ጠበቀ",
"ትላንት ላይ ዛሬ ላይ አንተ ሀገር ላቀ ተስፋ ሰንቀናልና ከጎንህ ተሰለፈ",
"ስህተት ተጸጸተ እርስ ማን ሆነ እና ምን ተደረገ አወቀ ጩኸት ማን ሰማ",
"የኢህአዴግ ሞት ሀዘን ጐዳ መጣ ቆይታ እንዘክር ወያኔ ትግራይ ገነጠለ ጉዞ ጀመረ መሀል ተጠጋ ማረረ ወተት ቢያጉዋጉዋት ትግራይ",
"ገጠመ አክብረን፣ በሜዳችን፣ ሜዳ ውጭ አለ ሁልጊዜም፣ ተሸነፈ ወደ ሜዳ ገባ ፊት አለ ጨዋታ ተሸነፈ ስንሄድ፣ ለሻምፒዮናነት እንፎካከራለን፤ ልጆቸ",
"የታገቱት አማራ ሆነ መንግስት ጉዳይ ነው ኢትዮጵያ ሰላም ሆነ ስንት ንጹሀን አማራ ነው መስዕዋት ተደረገ",
"ጠራ ሀሳብ ነው",
"ኣረ ውሸታም",
"አቤት እኔ ደሞ ምን አለ ሆነ አለቀ",
"አነሰ ተናገረ ቻለ ልያታይ ክልመ ፍሃሾማ አሁን ፍርሀት ጊዜ ነው ይዴይሜ ይዴይሜ",
"ወንድም ፕሮፌሰር ብርሀን ነጋ፣ አቶ ዳረገ ጽጌ እና ድርጅት ከፍተኛ ማረረ እንኳን ወደ እናት ሀገር ኢትዮጵያ ሰላም ገባ",
"የፌደራሊስቶች ህብረት ተባለ አዲስ ግንባር መሰረተ አለ ነገር ሰማ ነበር ምን ያህል እውነት ነው",
"ህዝብ ወከለ ምክር ቤት አዲስ አበባ ከተማ አደረ ከተማ ነዋሪዎች ህይወት ቀየረ ተደረገ አለ እንቅስቃሴ ደነቀ ለኢ/ር ታከለ ኡማ እውቅ ሽልማት",
"ሀይል እኔ ምስኪን ምርጥ ኢትዮጵያዊ",
"አሽከር ሰው ሆነ አያቅም፣ ወይዘሪት ደገመ ምርጥ አሽከር እና ፈረስ ነች፤",
"ማ መገርሳ ትናንት ስራ ወደ ውጭ አገር ሄደ ኤርፖርት ለመደ መስመር ገባ ሞከረ ከለከለ ተራ ሰፈረ ጋረ ተራ ያዘ ሰፈረ ተደረገ ወረደ",
"ጭቆና ከማሰወገድ ዷምከራሲያዊት ኢትዬጵያን ፈጠረ ሀገራዊ ቅቡልነትን ረገጠ መተግበር አለ አንድ ጉዳይ እርቅ ሰላም ብሄራዊ ተግባባ ሀገር ሰፈነ ነው",
"በላ አህመድ አሊ ህዝብ ቀረበ ሰላም እና ጸጥታ ችግር ጥያቄ መልስ ሰጠ እኔ ሚሊሻ ነው ነበር አለ ሀገር መራ ሀላፊነት ሰጠ ሰው እንዲህ አይነት",
"ጥንት ግብጽ አየር የዩጊኦደረጃን ወደደ",
"እንደ ዮሴፍ ወይ እንደ ሰሎሜ በሆንን ቤተልሄም ቤተልሄም ቤተልሄም በሆንን አምላክ ወለደ አየ እንኳን አደረሳችሁ፤ ደረሰ",
"ጣም ጣም ዘገየ ከቅርስነቱ ባሻገር ሰው ላይ ወደቀ ሰጋ ፈጠነ መልካም ነበር",
"ወይ አዘነ ቅቤ አንጓች አለ ምነዉ እናንተ ፈነቀለ ሙስሊም አማራ ምነዉ የረሣነዉ መሰለ ለገጣፎ ሰንበታ ረመዳን ጾም የተፈናቀልነዉ ምክንያታችዉ አማራ",
"ቀጥታ ዘገባ ሰራ አካል አበለ ሰጠ አበለ የሰጣቹት ሌላ ሚዲያ ነው ያንንም ሆነ ዝም ተባለ",
"እኛ ሙስሊም እንደ ህዝብ ምን ተደመጠ ምን ክርር ሙስሊም አለ ቤተ መንግስት መራ ዳንኤል ክብረት የቤተ መንግስት ክርር",
"መጣ ትርፍ ሰአት ስራ ትርፍ ሰአት ስራ ነው ፡፡ ምን ሰባ ነው ክፋት ያ ለም ሰው ሰበሰበ መጥፎ ነው ቅርብ ያ ቆመ ፈለገ እውነት ጠፋ ፈለገ ፡፡",
"ስለ ሀብት ተወራ ነውር ሆነ አገር",
"እኔ እንደማስበዉ ሀገር ክርር ዉሀ ብዬች ወደ ለየ ሀይማኖት ጦርነት ገባ ሌት ተቀን ለፋ ነዉ ለየ ኦሮሞ ክልል አማራ ክልል አይሣካለቸዉም እግዚአብሄር ኢትዬጵያና ህዝብ ባረከ",
"አቤል ብርሀን ወይን ልጅ ኤርትራ ህዝብ ላይ ያ ክፉ ቀን ኢትዮጵያ ነጻነት ታጋይ አቀፈ እና ደገፈ ለውጥ መጣ ገዛ ተደረገ ህዝብ ላይ ተደረገ ውሸት",
"ሳይንስ ከፍተኛ ትምህርት ሚኒስቴር ሀገር ተገኘ ከፍተኛ ትምህርት ተቋም ላይ በረታ ተቋማዊ ለውጥ ስኬት ተገኘ ገለጸ፡፡",
"ddaውሃ ወቀጠ እንቦጭ ነው ወደደ ዘመድ ጓዋደኛ አለ መከረ አንተ ቤት ጨዋታ ስምር ነው ጻፈ ሞተ ነፍጠኛ",
"ብልጽግና ተግባር ፓርቲ ይህንን እቅድ ተሳካ ዘወትር መደገፋችችንን ቆመ",
"ምን አደረ ቀና እውቀት ጀመረ አዲስ ኪዳን ተገለገለ ህዝብ አለቃ ነው እንደ ስም ተገለገለ እንጂ ዘወትር ሰኞ ምሽት ሰጠ ተከተለ",
"ስለ መታገታቸው ያልዘገብ ሚዲያ ስለ ለቀቀ ዘገበ ሰማ እውነት ነዉ አለ እንድናምናቸዉ ፈለግ",
"ቀጠለ ሞከረ ፈለገ ማን ነው ምኪሐ ጋጋረተ እሱ ጓደኛ ነበረ ታመሚደንእ ውሰ ድንአ ንምለ",
"ታላቅ ኢትዮጵያ ህዳሴ ግድብ ውሀ ሙሌት እና ለቀቀ ሂደት ላይ የሦስትዮሽ ውይይት አዲስ አበባ ተካሄደ ነው ታላቅ ህዳሴ ግድብ ውሀ ሙሌት እና ለቀቀ",
"ሰሞን ፖለቲካ ፓርትዎች ጥምረት መልካም ጎኑ አየ ገባ እኞም ብዙ አማራጭ አሳብ ስለሚቀርብል ምርጫ ክርክር ትግስት ጠበቀ ገባ ሁሉ ላይ ሰላም ደረደረ አለ",
"ጤና መለሰ ጸለየ እስር ላይ ከፍ አለ ጉዳት ደረሰ",
"ልክኖት ጠ/ር ዶ/ር በላ አህመድ አሊ እርሶንም ልብ መነጨ ምስጋና ይድርሶት አለ ቦታ ጣም ወዶታለው",
"ወይ አንተ ፅንፈኝነት ዘረኛ",
"ከቤተክርስታን ልመና ልምድ ቀሰመ ነው፣ ቁጥር አንድ ለማ መራ ነበረ",
"ደ/አፍሪካ አለ ኢትዮጵያዊ ደህንነት የሰራሀው እጅግ ጣም የምያስመሰግንነው",
"ሞት ፍርድማ ቀረ አለ",
"ሀገር ቻግኒ ወንዝ አርዲ ነዉ ጎበዝ አለቀ ደቦል ዲንጋይ ነዉ አለ የገጠመዉ ተከለ የኢህአፓ ፕሮፓጋንዳ ሀላፊ የነበረዉ ፍሬው አበበ ትዝ",
"ስለ ወንድ ልጅ ንዴት ፖስት ተደረገ ግን",
"ሁሉ ሀይማኖት እኩልነት ያቀፈችዉ ኢትዮጵያ ለዘለዓለም ኖረ",
"ወያኔ እንኩዋን ይህ ደረጃ ፖለቲካ ትርፉ አለ ህዝብ ጨረሰ ዝም አለ አየ አቢይ ተንኮል መጣ ቀረ ተባለ አደለ",
"ሞተ ሺ ነገረኛ",
"እንዴ ጓደኛ መልስ ምት ፈለገ ይሄ",
"ምክረ ምክር በቃ ነው ብይ ሳበ",
"አደራ ትንሽ ፈታ ድርግ",
"ስቃይ ብቸኛ በቃ አለ የባዶነት ስሜት ብቻ ንስሀ ጊዜ ተጠናቅቋል ምክንያት እርስ ሀጢአት ክፉ አይነት ማንኛውም ተልእኮ በለጠ ጨረሰ ቀረበ",
"ሀገራችን፣ አካል ጉዳት አለ ህጻን ንዴት ትምህርት ድል ተገኘ አለ ጉዳይ ለየ አለም ቀፈፈ ስምምነት ህግ ከተተ እንዲተገበሩ ተቀበለ አፅድቃለች፡፡",
"መቃብር ቦታ ፈነቀለ 'ለልማት' አለ አባት አጥንት አንቀሳቅሱ አለ ቤተስኪያን ነው ካድሬ እውነት ቤት አለበ ኢትዮጵያዊ' ደሞ 'ወደ ኢትዮጵያ",
"መድሀኒት ወለደ ሉቃስ ወንጌል",
"እግዚአብሄር ተመሰገነ ገና ምን",
"መጣ አዲስ አመት ተደመጠ የሚቻልበት፤ተቃውሞን ምክንያት አንተርሶ የሚቀርብበት፤አንድን ነገር አወቀ ሰው ተናገረ የምንሰማበት፤የምናነብበት አስተዋለ ያድርግልንኢትዮጵያ ለዘለአለም ኖረ",
"አንተ ሰውየ ትንሽ ነካ ያደርጋሃል",
"ዱቄት ንዴት ተደረገ ነው ዱቄት ተደረገ ዱቄት ዱቄት",
"ጋራ ሰጠ ጀመረ",
"አሜን እውነት አለ መራ ዶር በላ ብዙ ከአንተጋር ሆነ መሰከረ",
"እቃ ሰገራ በየ ኣደባባዪ እንደ ክብር አየ ደነዝ",
"ፍትህ ስርአት ረባ ሆነ አንድ ማያሳ ይኸዉ ሰሞን ከበበ በላ አለ ንጹሀን ዜግችን ጨፈጨፈ አረመኔ ፍርድ ቤት ቀረበ ጭራሽ",
"እግዚአብሄር አንተ ይህ ብርቱ ሰው",
"እኔ ማን ነበረ አለ ማን ነበረ ልጋልፈስያ ርገነ ኝሳወ ልህያ ቅለጥመለ ይህ አውሮፕላን ገለበጠ ላይ ሁለታበልውደእ ቡርቅያ ንሱነእ",
"የጋምቤላ፣ ቦንጋ እና አርባምንጭ ዩኒቨርሲቲ ተማረ ማረ ሂደት ሰላማዊ ሁኔታ ቀጠለ ገለጸ",
"ሎዛ በራ ማልታ ግብ መረተ ጠነከረ ቀጠለ",
"በርከት አለ ያአጥቂ ስፍራ ተጫወተ ፈረመ ምክንያት አሁን ግልጽ ሆነ መሰለ ሳላ አለ ጎል ለም ውሸት ሆነ አለ ተመኘ መራር እውነት ሰላም ዋለ ቤተሰብ",
"የምርጫዉ ወቅት መረረ ታገለ እኔ ኢዜማ፣ ባልደራስ፣ ብልጽግና ጂኒ ቁልቋል ብየ መረጠ አለለ ራስ ምርጫ ያለተፅኖ መረጠ አደለ ግን ተመቸ የሚጠቅመዉን ራስ ያዉቃል",
"እንዳንች አለ ዘር ጥላቻ አእምሮ የላሸቀ ሰይጣናዊ አስተሳሰብ አለ ሚዲያ መራ ቦታ እውነት ሆነ ተቀመጠ እሳት",
"እግዚአብሄር ጥበቃ አገር ላይ ይህ",
"ወር ብቻ",
"ማሒ እኔ ቆንጆ መልካም ቀን",
"ቸር መልካም",
"ቅድ እኮ ጨዋታ ፊት ተውኝ አለ አለቀሰ ነበር",
"አሜን እንኳን አበረ ደረሰ",
"ራእይ ደም ረጨ ልብ ተጐናጽፎአል፥ ስም እግዚአብሄር ቃል ተባለ",
"ጣም ስራ ቦታ እና ኖረ ቤት ዉስጥ ደገመ ገጠመ ሞተ ሞተ አዲሳባ ሄደ ሞተ ተሻለ ብይ ስራ ተወ ወጣ",
"ተወ ንሬብ እኔ ሰው ፒቫል እዘርዝ ነው ላአ ድቅእ ራረበየ",
"በቀለ ገርባ ስለ ፒፒ ምን ገባ ምን ኦፌኮን አቀፈ ተኛ ይህ ሰው አማርኛ ተናገረ ከለከለ አለ በቀለ አፍ ከፈተ ቁጥር የሚወጣውየዘረኝነት ጋመ ብቻ ነው ሰለቸ",
"ኧረ መጣ ንዴት ነው ምናምን ተባለ እንኳን ደህና መጣ ሊያ ናፈቀ",
"አማርኛ ኦሮሚያ ውስጥ ተንቀሳቀሰ ሶስት ፓርቲ ጥምረት ብልጽግና ስጋት",
"ማነው ቀጠለ አወቀ ገና ጭስስስስ አደርገሃለሁ አንተ አይነት መርዝ ብሎክ ተደረገ ያ ብሎክ ተደረገ ሰአት",
"እግዚአብሄር ተመሰገነ ድንግል ማርያም ልጅ ወደ እውነተኛ መንገድ ተጓዘ ተደረገ ፈጠረ ምስጋና ገባ",
"ብልጽግና ፓርቲ ሆነ ብልግና ፓርቲ ተባለ ተስተካከለ ጠየቀ ክብር ታከላይ ምስጢር",
"እንኳዕ ኣብፀሐና ንሕዳር ጽዮን በረከታ፣ ልመናኣን ምህለላኣን ንእኖና ማርያም ምሳናን ምስኩሉ አለም ይህ ሰናይ በአል ይግበረልና ወኢያድግ እግዚአብሄር ሀገር",
"አባት ልደት መታሰቢያ አባትዬ ስም ገናና በትዉልድ ሰማ ካሳ ሀይል ፈርስ ሰማ አባ ታጠቀ በዉትድርና ሰማ መይሳው ካሳ ኢትዮጵያ ኰራ ሀገር ክብር",
"ቀላል ቸገረ ጉድ ሆነ አገር ጉድ መአት ተሸከመ እኛ ጉድ ፈላ",
"ፈራ ጎንደሮች ልክ እንደ ባተ ራስ አመነ ድፍረት ወረሰ",
"ኤርትራዊ ነበርቲ ካናዳ፡ መሰል ሀይማኖት ክኽበር ዝጽውዕ ሰላማዊ ሰልፊ ኣካይዶም",
"ያ ትውልድ ታሪክ ህያው ነው",
"ታህሳስ፳፬ ጻድቅ አባት አቡነ ተክለ ሀይማኖት ልደት አመታዊ ክብረ በአል እንኳን ሰላም አደረስን/ረሳችሁ እግዚአብሄር ጻድቅ ተመሰገነ አወቀ መዝሙር ዳዊት ፬፫",
"ድፍረት ሆነ ይሄንን ፍጹም ሆነ ኢትዮጵያዊ ቁንጅና ማረ ለበሰ ደነቀ ስስታምነት ነው ይህ ብያለሁ ክብርት ዳግማዊት መልካም በአል ድጋሚ",
"ኢሕአዴግን ክብር ወረሰ",
"እኔ ግን ገረመ አማራ ማረ በኦነግ ታግተዋል ሴት አማራ ማረ ኦሮሚያ ደፈረ ነዉ አንድ ተማረ ለሆነዉ ደፈረ ሞተ አንድ",
"ዛሬ የሚኒሊክ ወሰነ ዘፈን አለ ስቦጠረቅ ከርሜ",
"ልክ አንተ ነው ፌቡ ላይ አየ አመነ ፌክ ሆነ ብይ አካውንቱን ድጋሚ ቼክ ተደረገ ከዛ እቃ አፈረ",
"ህይወት ከባድ ተረጐመ ነው ወደደ አክብሮት አድርስልና ጌታ",
"እቺን ተያት ከሳ የኢዜማ ቡችላ ነው ከኢዜማ ምን ትጠቢቂያለሽ ተራነታቸው ይህ ያህል ነው ትንሽነታቸውን ነው የሚያንፀባርቁት በዛ ላይ",
"ወጣ ፈለገ ነው ሳምንት ነው ማይመለሰው ህክምና ሚቆየው ልምምድ ምናምን ሳምንት ደረሰ ቈየ ቻለ እሄ",
"አብርሀ እስራኤል ህዝብ ሁሉ አባት ተባለ",
"ሊያ ጸደይ ተባለ ሴት የብሎክንግ ነው ነገር ማህበረሰብ ምን አከለ ሀሳብ ነጻነት ፈራ ሁለት ጠራ",
"አንድ ጀለስ ጣም ስልቹ ሆነ ተነሳ አንድ ቀን ሚስት በር አንኳኩታ ተነሳ ከፈተ ደብሮት ምን አለ ጠራ ነው እቃ ፈታ",
"በላ ጃን በላ አሪፍ ፖሊስ ወታደር አለ ተመለከተ ቀየረ አለ ሰላም ወጣ ገባ ሰው ራስ ድክመት",
"ቀጠለ ደሞ አንተ አይነት መርዝ ሄደ ሲዶሉቱ እውነተኛ ሙስሊም አባት ተጠነቀቀ ይሄ ሁሉ ሴራ ሙስሊም ስም ነገደ ነጋዴ ሙስሊም ጭራሽ",
"ወያኔን ናፈቀ ሁላ መረጠ እና መንግስት ቀየረ አለቀሰ ዋጋ አለ",
"ይህ እኛ መራ ነው ንዴት ያሳፍራል፤ እርግማን",
"በላ ጉዞ አንድ ወደ አንባገነንነት ሆነ የሀጅ ኡመር የሸገር ኑዛዜ ተግባር ፈጸመ አወ ጠፋ",
"ይህ እኔ ታላቅ ክብር ነው 'እነ'በመባሌ ሰማ ላቀ ክብር ቃል ገለጸ ቻለ ቀጠለ እምዬ እመቤት ወይዘሮ ተባለ በለጠ ደስተኛነት ሰማ ተናገረ",
"ሱስ አንደኛ ወደደ ወንጌል ነገር የእየሱስዬ ትምህርት ሁሉ አነበበ ቁጥር ሁሌ ተጨማሪ አዲስ ሀሳብ ተገኘ አንዳንድ",
"እግዚአብሄር ታላቅ ነገር ተደረገ ደሰመ አለ",
"ያሬድ ጥበብ እና ዘመድኩን በቀለ አንድ አይነት ተልእኮ ነው ያዘ ያሬድ ጥበብ የሚለየፀው ሰቀለ አለማንገቡ ነው ዘር ቦካ ፖለቲካ ወጣ አጣ",
"መቐለ የመሸጉት ወያኔዎችማለትህ ስለ ወያኔነት አለ እውቀት ድርቀት ወይም ጥላቻ ያሳያልየህወሓት መራ ብቻ ሆነ ሁሉ ትግራዋይ ወያኔ ነውወያኔ",
"አማራ ምሁር ተብየዎች ሆድ ብቻ ነው ኖረ",
"ትግሬ ነጻ ወጣ ሌላ ባንዳ ለም",
"በህወሓትተረድተው ሀብት ሙስና ከበተ የህውሓት አባል ተላላከ ለየ በኤፈርት ስር አለ ካምፓኒዎችንም ካሳ ከፈለ ፍርድ ተገደደ ሰአት አሁን ነው",
"ዛሬ ገጠመ አየ አወቀ ላይ ቤቲ ጣም ብዙ አስቂኝ ፎቶ እኔ ላይ ሰራ እኔ ደሞ ጣም ቆንጆ ልጅ ሆነ አመነ ተቀበለ ምን መሰለ ጎበዝ ልጅ",
"ሞጣ ደረሰ ጉዳት ገባ ሰባሰበ ዘመቻ ጀመረ ነገ ጁምአ ጥር ደገመ ዋና ሰበሰበ እለት ነው ኢትዮጵያ እስልምና ጉዳይ ምክር ቤት ተከተለ ባንክ",
"ምን እንኳን ራስ የግዜ ቋጠረ ሆነ የምንኖራቼዉ ቀን አንድ ሆነ አላህ መጪዉን ቀን ካለፈዉ የተሻለያድርግልን ለሁላችንም",
"አብይ ወደደ ምናምን አለ የመጠቀባጥረውን ቀን ጅብ ተደረገ ምን ጥቅም አለ አለ ነው",
"በደቂቃወች ልዩነት በላ አማራ ክልል ላይ ኰሳ አለ ወጦ እባብ ምላስ ዘረጋ የኛዋ አተላ ደሞ ተቀበለ ይሄን ውግዝ ሰው ሆነ በቃ ነው አለ እዚ",
"ውሀ ልማት ፈንድ አዲስ አበባ ጨመረ ሰባት ከተማ አምስት ቢሊዮን ብር ላይ ብድር ቀረበ ሰማ",
"ወያኔን ምን በረረ እንጂ ከኦሮሞዎቹ ስልጣን ተቀበለ ቀላል ነው ደመቀ መኮንን አመት ፊት ላይ አለ አረፋ ነው ባያለው ትላንት ወዲያ ገባ",
"ይሄንን የናገረው እኮ አማራ ነው መራ ነገራ ቶላ",
"አፈነ ተማሪወች ውስጥ ያመለጠችዋን ልጅ ሸሺገው ደበቀ ልብስ ለበሰ ገንዘብ ሰጠ ወደ ፈለገ ሄደ ረዳ ኦሮሞ አባት ክብር ገባ አመት በጎ ሰው",
"ብልጽግና ፖርቲ ጋረ ፊት ውድ መራ ምን ግዜ ላይ ዛሬ ከጎኑ ቆመ ገባ እውነት ኢትዮጵያ ሀገር ወደደ ሰው መራ ጎን ቆመ አገር ወንበዴ",
"እንዲህ ጥበብ ገለጸ ነው እንጂ ትርጉም እብደ ተመለከተ አይደል",
"እኔ እውነት ነው ብያለሁ ኤፍሬም ሀይል",
"መንግስት ምንያድርግ ደረቅ አበለ ጽናት ሰጠ ለሰለሰ እኔ ገባ ህዝብ ደህንነት ጠበቀ ግዴታ ነውውውውው ቤ/ክ መስጊድኮ ነው ልመና ሆነ",
"ቄሮ ዘርማ ፋኖ ለኢህአዴግ ውህደት ተደረገ ትግል ድል ተጠነቀቀ አለ ነው ጠማ ሃሃሃሃ ብልጽግና ትግል ሰረቀ አዲስ መንገድ ጀመረ",
"አንተ ላይ አነሳ ሙሉ ልክ ሆነ ሳለ ሲራክ አነሳ እርግጥ ወሰነ ነገር ነው ድህነት ማቀቀ አለ ገበሬ መሬት ህይወት ቀየረ ቻለ",
"መተግበር ከፍተኛ ችግር ገጠመ ጠየቀ ሰለሆነም አመት መደበ በጀት ባከነ አለ እኔ ገባ ቀጥታ ይሀን ተዘወረ አወቀ ብክነት መደበ አለ ነው",
"ዶ/ር በላ ኢትዮጵን ወደደ አለ ጽንፈኛ ዘረኛ ህውሀትም አንድ መስመር ሆነ ድንጋይ ቢወረውሩብህም፤ አንድ ነገር አውቃለው ሚሊዮን ከጎንህ ነው",
"አቶ ማ ብልጥ ከሆኑለሀገር ተጨነቀ ሆነ እንደ እሳቸው አይነት ተመለከተ አለ ከነ ጀውሀርና ከነ ጌታቸውረዳ ጋረ አንድ ጋራ ፓርቲ መሰረተ ብልጽግና ፓርቲ ተወዳደረ ተሸነፈ ነው አለ",
"እጂግ አዘነ ጠገዴ አርማጭሆ ስድስት ገደለ ተጨማሪ ጭንቅላት ላይ ከፍተኛ ደረጃ ቈሰለ ነበረ ህጻን ህይወት አልፉል",
"አቶ ማ እና ጃዋር መሀመድ ሀሳብ አለ ሰልህ ጨበጠ ነገር ተነሰቼ ነው እኔ አንተ ሀሳብ ጋረ ተስማማ ፖለቲካ መራ ሀሳብ መነጨ ህዝብ",
"ሀጫሉ የጊዜዉ እያሱ በርሄ ሆነ አለ",
"አላማ ሀገር ጥቅም ፍትህ አመነ ሆነ እጅጉ ተመሰገነ ገባ ወዳጅነት ተቀየመ ተባለ ጽኑ አላማ ካደ ለመደ ደካማናት ነው አቢይ",
"አክቲቪስቶችን እና ፖለቲከኞችን ጠበቀ ቆመ መምህር መስፍን ሰለሞን",
"እየሩሳሌም ፍትህ ጐደለ አሰልጣኝ እየሩሳሌም ነገ ተባለ ኢትዮጵያ ተገለገለ ኢትዮዽያ በደለ ፍትህ ነፈገ ነገር ግልጽ ሲሆን፣ ኢትዮጵያ ኤሌክትሪክ አመት",
"ፓስታ እንፋሎት ጸዳ ነው",
"ነገር እንዳተ አይነት አባት አየ ለየ ቅእት ሁላ አፍ አካውንት ከፈተ ገረመ",
"ሲሳይ ጤና ነው",
"ኦፌኮ አሜሪካዊ ዜጋ አባል አለ የመጀመሪያዉ ኢትዮጵያዊ ድርጅት ሆነ",
"ኢትዮጵያዊ ጠላት እናት ጡት ነካ ወደ ጡት ቈረጠ ተዘወረ ትርክታም፣የዘረኝነትና ሀይማኖት አክራሪ፣ሀገሮችን እሳት በላ አለ አሸባሪ ነው ህዝብ ጥቃት",
"እግዚአብሄር ኢትዮጵያ ጠበቀ",
"ሰው ጋረ አለ ቅርርብም እጅግ ጠራ ነው ልጅ አወቀ",
"ሳመ ጠራ አፈረ ለማላቀው እናት ቅድስት ድንግል ማርያም ህዳር ንግስ በአል ሰላም መልክ በአል እምነት ተከተለ",
"ወደ ስራ ተወራ ገደለ ፡፡ ጉራ ብቻ",
"እስክንድር ኴስ ገባ ተባለ ንዴት አንድ አፍ ገባ ጀበና ቡና ዘና ጠጣ ትንሽ ቈየ አስተናጋጅ ጠራ ቀዝቃዛ ጊዮርጊስ አለ አስተናጋጅ ይቅርታ ላይ መጣ",
"ጊዜ ልዩነት እንጂ ሁሉ ሰው ሳቀ ቀረ",
"አቢዓዲመሬትለንጊ ይሄንን ሃሽታግ ጠቀመ ከጎኔ ቆመ አለ ፍላጎት አየ ጠየቀ በታላላላላቅ ርህራሄ ነው",
"ንዴት ውብ ሆነ ግል ነው",
"ጀመረ ተናገረ አውሮፕላን ላይ ቈየ ቻለ ርበነ ዬኛደጓ ኔእ ራስ ያዘ ህነማ",
"በአል አደል በግ ተሸከመ መጣ ብር ሰጠ እሪሪ አለ ለስካርቭ ብር በዛ ነው ጠፋ ከዚ ሶዬ አሰበ እንጂ ጓድ",
"ትክክል ነው እኮ",
"እግዚአብሄር",
"ድንቅ ፍጻሜ ከጎንህ ነው በረታ",
"ተስፋሁን ከበደ አፍ ዘጋ ፖለቲካ ሳታሪስት ነዉ አርትስ ቲቪ ላይ እሱ ተከተለ በረዶዉንና ብርድ ረሳ መሸ አዲስ አበባ",
"እንዲህ አይነት ታበየ ለህውሃትም ተበጀ ህውሃትም ለቀጠዩ እና አመት አብዮታዊ ዲሞክራሲ ገዛ ሀሳብ ነው አለ ነበር እኛ ኢትዮጵያዊ ጣም ከበደ ነገር አለፈ",
"አክራሪ አብ አባል ጠለፈ 'ማህበር' ይህ ገለጸ ወጣ ሞራል አለ",
"አየ ድንቁርና አሜሪካ ፊልም አጃቢ ለጠፈ ኦሮሞ ምናምን አለ አየ ዝቅጠት፡፡",
"በተጨማሪም፤ እራሳቸውን ፌዴራሊስት ብለዉ የሚጠሩ፣ ነገር ግን ፌድራሊዝም አለፈ አልፈዉ የማያዉቁና ስለምንነቱ ቅጥ ረዳ እንደ ትህነግ አለ መሰለ ጠራ",
"አንተ እኮ ነው ሰደበ ናደ",
"ተስማማ ምን ሂሳብ ነው አንድ ብሄር ብቻ ፍርስት አለ ሰው ተሻለ አጣ",
"ተመሰገነ ወ/ሪት ኢትዮጵያ",
"አንድ ገላገለ ፈነከተ ምን ገባ አለ ቅን ልብ መሰለ እኮ ነው",
"ክቡር ዶ/ር ማ ማጋርሳ ኦሮሞ ትግል ውስጥ ስታወስ",
"አለ አሜን ብያለሁ እሺ፤ ታንክዩም ጭምር",
"አካሄደ ቅንነት ሆነ ፈለገ አጣ ነገር ራስ ፈለገ መጣ",
"አንተ ሰው አለ ንዴት ነው አከከ አንተ አለ ነው አሁን ቸገረ ጥልዝ",
"ተከላከለ ምኒስትር ማ መገርሳ «የኢትዮጵያና አሜሪካ የሁለትዮሽ ከለከለ ትብብር ጠነከረ ዛሬ ጠዋት ዋሽንግተን ዲሲ» ገባ አምባሳደር ፍጹም ረጋ አወቀ",
"ፈጠረ አለ ወሰደ ሁሌም ፊት ሰጠ ተሻለ ላቀ አሰበ ነው እሱ አየ በዛ ትእግስት አደለ አንተ እንኳንም ወለደ",
"ጥላቻ ምንጭ ወይም ፈጠረ ችግር ባሰ ጥላቻ ምንጭ ከመካከላቸን ወጣ",
"ኢትዮጵያ ዜና አውታር ቀጠለ መስጅዶች እና ቀጠለ ሙስሊም ሱቅ አየ ቀጠለ ቤተክርስቲያን ግን አየ ቻለ እስከ መጣ ነው እኛ ግብር ገንዘብ ደሞዝ",
"ጌታ ብልጽግና እንግዲህ ወደ ብልግና ቀየረ ሆነ ይሄው ነው",
"ብልጽግና ፓርቲ አሁን መሰረተ መሰለ እና ገና ብዙ ድራማ አለ መሰለ እኔ ብቻ ነው",
"የኣርሰናል ደጋፊዋች ግን ማንችስተር ተሸነፈ ሻምፒዮን ሊግ ወሰደ ነው መሰለ አየ ትንሽ ከለበ ደጋፊ",
"እንኳን ደስ አለ የአፍሪካዉ አልማዝ",
"ሁሉ ቁጥጥር ስር ነው ፊት አለ አረፋ ነው አለ",
"ጀመረ ብልጽግና መንገድ ለሁላችንም እዉን ሆነ ጽኑ ምኞት ነው",
"ወሎ ዩኒቨርሲቲ ተማረ ማረ ስራ አወከ አለ ተማሪዎች፣የአስተዳደር ሰራተኛ መምህር ላይ እርምጃ ወሰደ አወቀ",
"መልካም ስራ ነው",
"ንዴት ሰው ከዝንብ ማረረ ጠበቀ አለቀ ፈነቀለ ማረ ወደ ትጥቅ ትግል ሄደ ነዉ አለባቸው አለቀ አነሳ",
"ሻ ሰድጀ ትብስን መጣ ደረሰ ማን ሰገጤ ጨዋታ ህግ እንኳን አወቀ መሀይም ፋቲክ ለበሰ እና ኦሮሞኛ ተናገረ ሆነ ማን መብት ሰጠ",
"ጻድቅ ጻድቅ ስም ተቀበለ ጻድቅ ዋጋ ወሰደ መአት ፲፵፩",
"ጫካ መነጠረ አለ ጀመረ የዋህ የአዴፓ መራ ተንሳፈፈ ቀረ ውን ሆነ መሰለ",
"ነጻ ተማረ ገጨ ትውልድ ቀረ አላህ ሆነ",
"በረታ አብዛኛው የአዲስአበባ ነዋሪ አንተ ጋረ ነው ጨረሰ ሰአት ድል ዲሞክራሲ",
"ነበረ ኖረ ዛሬ አመት ተባለ የማንሳታውስበት ዘመን መጣ አሜን",
"ጠነከረ ተማረ ወይም ስራ",
"አቶ ወርቅ አየ ቃል ገባ አምስት ሚሊዮን ብር ገባ ተደረገ ድጋፍ ሰበሰበ ኮሚቴ አወቀ",
"ጣለ ሰው ልጅ ራስ ድክመት አየ ሰው ጅምላ መፈርጅ ምን አለ ቻለ ሁሌም ቅን ታጋሽ አሰተዋይ ጠራ ሰው ሆነ ሞከረ",
"ጤዛ እና ገደለ ረፈደ ምርጥ ነው",
"ምን አጭሶ ነው ግሽጣ ራስ",
"የቤኒሻንጉል ጉሙዝ ባለስልጣን አሶሳ ወደ ነቀምት ተጓዘ ታጠቀ ገደለ ክልል አወቀ አቶ አብዱላሂ ሶጃር ገደለ ጥቃት ሁለት ሰው ቈሰለ ሆነ ክልል «የሸኔ ታጣቂዎችን»",
"እሱ በmillion ዋጋ አለ ቤት ውስጥ ቦሌ ተንደላቀቀ ኖረ ባዶ ሆድ አንድ ጎኗ አለቀ ኢርገንዶ ለበሰ እሱ ዳነ አለ",
"ይህ ወቅት፡ ኢትዮጵያ ገጠመ ብዙ ፈታ ወቅት አንድ ነው፡፡ ውስጥ አለፈ ሆነ ያስፈራል፡፡ ኢትዮጵያ ታላቅነት ተረት ነው አለ አሰበ በስተቀር፡",
"ግብጽ አገዘ ሀገር ፈረሰ ተግባር ላይ የተሰማሩ ሸቀጠ ወሎ ወለጋ ሸዋ ኢሊባቡር ጎጃም ሶማሌ አማራ ኦሮሞ ትግሬ አለ እኛ ጠማ ውሀ ያለተቀናቃኝ",
"ጆርዳና ኩሽ ጋረ ቀጠረ እንዴ ምግብ ግን አበደ ነው",
"ታላቅ እስክንድር ታሪክ ሰራ ተናገረ ያላንዳች ተጠረጠረ ነው ድል ዲሞክራሲ",
"አንተ ኦሮሞ ህዝብ ብዙ ተስፋ ጥሎብክ ነበረ ነገር ግን አንተ ሁሉ ነገርለነፍጠኞች መልእክተኛ መሆንክን አሰዝኖኛል ሌላ ቀረ እንኳን የመጠክበትን አካባቢ መርሰትክ የመል",
"ቴሌግራም ቻናል ቀላል ረዳ ተገኘ ይህንን ሊንክ ተከተለ ድርግ መልካም ምሽት",
"እንደ ድሮ ፍቅር እግዚአብሄር የመልሰልን ገጨ ለየ ተጨነቀ እባካቹ ምን አይጠቅማቹም ወደ ቦታችው መለሰ ምከሬ ነው ሰምታችዋል",
"ግን ከተማ ይህ ወንበዴ ወረረ ምን ተደረገ እና አቀደ ሆነ ንክ ነገረ ምን አለ ተሳቃቀቅን እኮ",
"ቃልቻ ነው ዘፍን ምነው መላቅጡ ጠፋ",
"አዲስ ውህድ ፓርቲ ፕሮግራም አምስት ዋና መሰረታዊ ጉዳይ ላይ አተኩሯል",
"ስም እንጂ ግብር ቀየረ አዴፓ አመት አማራ ህዝብ ስደት፣ መፈናቀል፣ እንግልት፣ እስራት፣ ሞት፣ ግዛት መሸራረፍ፣ አማራ ህዝብ ቁጥር ውክልና እልቂት ፈጸመ",
"እውነት ተደሰተ ስራ ነው ከተማ ወጣ አለ ህብረተሰብ ሰራ ስራ በዛ ግድብ መስኖ ከብት ርባታ አካባቢ አለ ውሀ ጠቀመ አለ ነው",
"እኔ አለም ነው ነርስ አለም ነው እኔ ወደ አንተ መጣ ቅዱስ አባት ሆይ እኛ እንደ እኛ አንድ ሆነ ሰጠ ስም ጠበቀ",
"ንብ ብርጭቆ ላይ ምናምን አረፈ ማለ አለ ነገር እውነት ሆነ ኖረ አለ",
"ብዓዴን መቼ አማራ ህዝብ ላይ ሽብር እየፈፅመ በወያኔ ተላከከ ተጫወተ ቀጠለ በአርማጭኦ ውንብድና እኩር ተግባር ህጻን አፈነ ብር ጠየቀ ገደለ",
"ላቀ ስህተት ሰራ ፡፡ ድርጊት ሲኦል ዘላለም ተሰቃየ ፡፡ ስለ ሀጢአት ቤተሰብ እኛ ጠፋ ፡፡ እኛ እርስ መጣ ነው ፡፡ ተዘጋጀ",
"ኢትዮጵያ እናት ጸሎት ሳለ ነበረ እንዴ",
"እሱ እንኳን ነው፡፡ ምን አለ ቀልድ ነው",
"አንተ ነክ እንጂ ፀረ ሙስሊም ተባለ አንተ ነክ እንጂ ፀረ ትግራይ ተባለ ሁሉ አማራ ነው ዛሬ ጽሁፍ ላይ ጽንፈኛ ቄሮ አለ ጽሁፍ",
"ብዙ እንክብካቤ ጋረ",
"እረባክህ/ሽ ራቀ ነው እንዴ እንግሊዘኛ",
"የጋራታሪክማአለን ራስ ሚካኤል መራ ነበረ ኦሮሞ ፈረሰኛ ጦር በአድዋዉ ውግያ ላይ 'ኢባልጉሜ' ወይም ቈረጠ አለ ፎከረ የዳቦርሚዳን ብርጌድ ድባቅ መጣ",
"አንድ አላማ ነዉ አለ ምትሉት ባልድራስና ኢዜማ አበረ ቅእት አንድነት ሀይል ድምጽ",
"እንኳን ደረሰ እኔ መራ",
"ብዙ ደስ /ሉቃስ ፩፲፬/ ቅዱስ ደግ አቡነ ተክለሃይማኖት ታህሳስ ፳፬ ወለደ አባት ረድኤት በረከት አማላጅነት",
"አብቹ ለውጥ ምሳሌ ሆነ መራ ነው ለውጥ ደገመ የሁላችንም ሜዳ ውስጥ ገባ ተጫወተ ፈለገ ሂደት ነው፡፡ ሁላችንም መራ መልካም ተግባር ተከተለ ሀገር ብልጽግና ሰራ",
"ክርስቶስ መልካም አስተሳሰብ አድናቆት ኖረ ቻለ ይህ ሁሉ አለፈ ለቤተ ክርስቲያን ወንጌል አገልግሎት",
"እኔ ኢትዮጵያዊት ቆንጆ አለ ራስ አወቀ ኢትዮጵያ ዊነት ኰራ ባህል ትውፊት በለፀጋ ህዝብ ሆነ አወቀ ሴት ነው እኔ ቆንጆ ማንነት",
"እኔ ደገመ አበረ ማረ ሰው መጠን ሆነ አወቀ እኔ ጋረ ጠራ ተባለ ግንኙነት ነበረ እርግጥ ጻፈ ነጥብ ሁሉ ሰማ ስለ",
"ሞጣ አራት ጸጥታ ሀላፊ ቁጥጥር ስር ዋለ",
"እኔ ማዝነው ምን ያህል ሰው ሳተ በቃ እሱ ላይ ቀረበ ትችት ሀይማኖት ላይ ሰጠ መሰለ ክርክር ገጠመ እኛ ሆነ ፈረሰ አለ ናችው",
"መላ ከፍተኛ ትምህርት የተንሰራፋውን ችግር አንዳንድ ዩኒቨርስቲ አለ ዘገበ",
"ይህ አገር ነጻ ወጣ በዛ ምን ነጻ ወጣ አወቀ ነጻ እያወጣን፣ እኛ ኑሮ ነጻ ተደረገ ሀይል ገብረስላሴ",
"ምን ችግር አለ ጋላ ሆነ ደም አለ",
"ተሸማቀቀ ጭቆና ታሪክ ሁሌ ፈጠራ ነው አለ ነው እነሱ ተረት ግን እውነተኛ ታሪክ ነው የሄ ለመደ ባህሪ ነው ምን አዲሰ ነገር አለ",
"ይሄኔ የወደፊት ሚስት ሀብታም አለ ነው ማገባው አለ ሳበ ሆነ",
"ጅማ አባ ጅፈር አስተዳዳሪዎች፣ እግር ኳስ ፍቅር ላይ ቀለደ ነው ከተማ ከንቲባ ኖረ ከለበ ፈረሰ ነበር ነገ ጨዋታ ዛሬ መንገድ ላይ አለ ጅማ አባ ጅፋሮች",
"ጠቀለለ ሚኒስትር አቢይ አህመድ ቦረና ዞን ያቤሎ ከተማ ጉብኝት ላይ ነው",
"ደህና አደረ",
"ሉቃስ ወንጌልuke እነሆ፥ ህዝብ ሁሉ ሆነ ታላቅ ደስታ የምስራች ነገረ አትፍሩ፤ ዛሬ ዳዊት ከተማ መድሀኒት እሱ ክርስቶስ ጌታ ሆነ ወለደ",
"የኢዜማን ቴሌግራም ቻናል ተከተለ ፖሊሲ ደንብ ተዘጋጀ እና እውቀት ላይ መሰረተ ነው የሃገሪቷ ችግር ስሜት ነዳ ፈታ ገባ አየ ሞከረ",
"ህዝብ ፈለገ መራ እንጂ ፈለገ መራ ነው እሱ መረጠ ህዝብ በግ ነው ህጻን አስተሳሰብ መራ መረጠ ስልጣን",
"ሰው ሳበ እግዚአብሄር ፈጸመ",
"ገረመ የሰልፊ ዘመን ወጣ ሆነ ደበቀ ብዙ ተአምር ሰራ ለክሬዲት ተሻማ",
"ቀድሞ ተባለ ነበረ ነፍጠኛ ፓርቲ አሁን ወለደ ተባለ አብይ ደመረ ፍልስፍና ልዩነት ምንድን ስያታልሏት",
"ኢትዮጃዝ ፈጠረ አመት ጋሽ ሙላት አወቀ እርስ ሙዚቃ ቀልብ ሰበሰበ ለማንበብ እጅጉ ረዳ አንዲት ግለሰብ እኛ አመት ገና በአል",
"ምንሊክማ ቋንቋ ለዛ ደስ አለ ነበር",
"እረ በአላህ ይሄ ልጅ ገመተ ነዉ",
"እንዲህ አለ እራስህን አጽናና ቅን ገባ የሌንንም ልክፍት ለቀቀ አስክታሸልብ ለፈለፈ እንግዲህ",
"ጋዜጠኛካንተ ሰራ አቅም አንጻር የፃፍኩዋቸው መፅሐፍት በቃ ነው አለ አመነ ጋሽ ስብሐትአዎ በቃ ናቸውበየሳምንቱ ጋዜጣ ላይ ወጣ ጽሁፍ ሰበሰበ ብዙ",
"ታከለ ኡማ እና ካቢኔ ህዝብ ተወካዩች ምክር ቤት አባል ጋረ ተወያዩ ህዝብ ተወካዩች ምክርቤትም ከተማ አደረ ከተማ ነዋሪዎች ህይወት ቀየረ ተደረገ",
"እርግጥ አብይ ፋሽስታዊ ስርአት ፈረሰ ቀረ ነደደ ነገር ግን በላ እንደ መንግስት ፈረጠጠ እለት ነው",
"ከመጅሊስ መፍትሄ ጠበቀ ድሮ ምናቀቻው ችግር አንድ ሁለት ተባለ ዘረዘረ መጣ",
"«አንቺኮ ቅኔ ነሽ» ፈጠረ ጀመረ ጠቢብ ሰው ሆነ ማን ፈታ ይህ ነው እምዬ ህመም ገባ ፈሰሰ እምባሽ",
"ሙስሊም ጃንሆይ ዘመን ንክ ደረሰ ተገለለ «መገለል አይደለም» አለ አበለ ሰጠ ሰው ጋረ ጭቆና ምንነት ላይ ገባ ራስ ከባድ ነው",
"እንክዋን ደረሰ ጥር ቀን ሰማእት ቅዱስ እስጢፋኖስ አለ እረፍት ነው ዛሬ ግፍ አእባን ወረደ ቀዳሜ ሰማእት ማለደ አሜን",
"ክልል ተነሳ አጎራባች ክልል ተደረገ ትንኮሳዎችና ፈጸመ ጥቃት በርካታ ንጹሀን ዜጋ ውድ ህይወት ተነጥቀዋል፤ ከፍተኛ መራ ግፍ ገደለ አለ ይኸን",
"ባህል ህክምና መልክ",
"ከጃል መረረ ከፋ ከተማ ውስጥ አለ ጃዋር ተባለ ሽፍታ ነው እሱ ላይ ደንብ ሰራ አሪፍ ነው",
"በአላህ ስም እጠይቃችሁለው ዛሬ ቀን ኋላ ዘመድኩንን ጨመረ ሌላ ዘገምተኛ ጻፈ እንዲሄ አለ አለ ጻፈ ነርስ ፖስት ስር አየ ሰጠ በቃ",
"ጠንቋይ ነው ግን ልደት አያሌ ያዘ ፓርቲ አዲስ አበባ ላይ አንድ የምክርቤት ወንበር ነው ታክሲ ረዳት አጠገብ አለ ኩርሲ እንኳን ተገኘ",
"ጣም ደስ አለ ጨለማ ውስጥ አሰረ ፈታ",
"ፈታ መድሀኒት ለየ በአል ምግብ ብሗላ",
"ግሩም ስራ ሆነ ተጠረጠረ ናሙና ራስ ተናገረ",
"ኖኖ ፖለቲካ ነው ፖለቲከኞቹህ ነው ይህ ቀውስ ዳረገ ቀጠለ ኤርትራ መነመነ ተባለ ስርቅአት ቀረ እኛ ራስ",
"ተሰጥኦ ነው አለ እንዳታፍ ብቻ",
"ምን አንድ ሰው መታ ይአ ምኤ ልቭፓዶ አነሰ ተናገረ ቻለ ውነ ኝልገረደያእ ንም",
"ሕወሃት ላይ ነጠረ ንግግር ቈሰለ አንተ ዘረኝነት ተጠናወተ አለ ነው",
"እኔ እኮ ምን ደህና ነገር ሆነ ነው አየ አለ በዛ ላይ ደገመ ድሀ ማረ ወጣ ነው ይሄን ተደረገ ምን አለ ነው ውስጥ ሱሪ",
"ዘንድሮ መንግስት ተወራ ብቻ ህዝብ ይሁንታ ሚያገኝ መሰለ",
"እኔ እኮ አንች ተወራ ጊዜ ጠየቀ እንኳን ገባ ጎበዝ ነው ማንኛውም ፈጠነ ሞከረ",
"እና ሚስት ቡዳ በላ አለ ነው ልጅ ፎቶ ተደረገ",
"ኢኮኖሚ ሀይል ገነባ ልሂቃን ምች ሁኔታ ፈጠረ አብዛኛው ድሀ ምስኪን ድህነት ምክንያት ሆነ ሌላ ብሄር ቋንቋ ሀይማኖት ተከተለ እሱ ቢጤ ድሀ ምስኪን ሆነ",
"ልደት ዝማሬ ከበረ ላቀ ስጦታ ሰጠ ቅዱስ ኤፍሬም እንዲህ አለ ሄሮድስ ልደት ከበረ ልጅ ደስ ተሰኘ ክፋት ሞላ ስጦታ ይህውም የመጥምቆን አንገት በውጪት",
"ጀመረ ሰው ነው ቤት ልብስ ላይ ተደረገ ከጏደኞቼ ጋረ ባትጌ ተባባለ ረሳ",
"ትራምፕ ሰቀቀ ህውሀት መቀሌ ደሞ አልወሀድም አለ እና አሁን ህውሀት ብልጽግና ሆነ ሌላ ድርጅት ነው አለ ይህ ያዘ ስልጣን ብልጽግና ለቀቀ ወይስ አነቀ",
"ታህሳስ ሀገር በቀል ኮንስትራክሽን ኢንዱስትሪ ኢትዮጵያ",
"ትክክል ይህ ገጠመ ሰይፍ ምን ያህል ሰው ፍቅር አለ አየ ነው",
"ከበረ አፋር ክልል ር/መ ዛሬ አማራ ክልል መጣ ልዑካን እንኳን ደህና መጣ ንግግር ተደረገ አማራ ህዝብ እና የአፋረ ህዝብ አበረ ኖረ ዘመን ወግ እና ስርአት",
"ወንድም አሁን ሰአት ከፍተኝ ትምህርት ቤት አለ ይህ ውስጥ ላይ ነው ችግር አለ ይህ ተቀበለ አቅማችው ውስን እና አዳዲ ሆነ ችግር",
"የበፊቱ ካልኩሌተር ነው አሁን በcientific ካልኩሌተር ነው አለ ጠበቀ",
"የትራፍክ አደጋ ድሮ በለጠ ዜጋ ህይዎት ቀጠፈ ነው ሁሉ የበኩሉን ወጣ ገባ ክ/ ምንስትር ደግማዊት ተመሰገነ ጠራ ስራ ነው",
"ኸረ እንዳታስለቅሰኝ አለቃ ከበረ መጣ ከባድ አቀባበል ተደረገ",
"አየ ግዜ መረተ ኩናትን ቀረ ሰላም መረት ኩናት ዝሰገሮ ቀረ ሰላም መን ይነግሮ",
"እኔ እንኳን ወደ ሊቨርፑል",
"ኦሮሞ ተረተ «በቀን ጮኸ ጅብ ማታ መጣ ሆነ እወቅ» ዛሬ አወቀ ከለከለ መንግስት ነገ ምርጫ ኮሮጆ ሰረቀ ዋስትና ለም ሳይንቲስቱ",
"ምስራቅ ኦሮምያን ቅጥ አደረ ቻለ ዘለለ ደመረ ምስራቅ አፍሪካ ጠቀመ አለ ልጅ ደህና ነው ንዴት ነው",
"ጾም እኮ ነው ችግር ጾም ወቅት እንዲህ እንቁልልጬ አለ ሰው ኖረ ነው ከበደ",
"መንግስት ባለአደራ ተዋከበ የከረመው ህገወጥ ነው አለ ነበር አሁን ህጋዊ ፓርቲ ሆነ አለ ምን ሰበሰበ አዳራሽ ከለከለ ይህ ዲሞክራሲያዊ መብት አፈና",
"ይህ ቁመት ልዩነት ጉዳይ ንዴት ንዴት ነው የሚያካሂዱት በላ ራስ ጠየቀ ጨረሰ ጥበብ ጀመረ እግዚአብሄር ፈራ ነው፤ሁለተኛው ጥበብ",
"ይህ ቤት ከፈለ ጨረሰ ውለታ አለ ሌላ ኢትዮጵያ ከተማ ይህ አይነት 'ቤት' ኖረ ዘንድ ምኞት ሰኞ",
"እኔ ደነዝነት ደሞምን አለ ሆነ ብይ ፈለገ አለ",
"ጎሳ አልበም ወደደ ምን መሰለ",
"በአል ምክንያት ተደረገ ታላቅ አወቀ ቀና ተደረገ አወቀ",
"ፍተሰአ ፍቅር፣ ተስፋ፣ ሰላም እና አንድነት",
"በር ዳር ተቀመጠ አትዉጡ ገባ አለ ፈራ ኤርትራ ህዝብ ነዉ",
"ጠበቀ ፡፡ ምናልባት በር ላይ ሆነ ቻለ",
"ታሪክ ገና ተበዉዞ ሰራ አለ አሁን አለ አንድ ወገን ታሪክ ነው",
"ውሸታም አማራ ኦሮሞ ብቻ ነው ችግር አለ ኢትዮጵያዊ ማረ እንጂ",
"ተሸከመ ግብዳ ጥንት ክላሾኮቭ ራስ የማይስታውሱት በዛ ዱኑዛዜያቸው እና ግብዳ ጡንቻ ላይ ጨመረ ጌታ ሆነ ግኡዝ ነው እኮ ሆነ",
"ትልቅ ነገር መጣ ፡፡ ተዘጋጀ",
"አየ ቀለለ ሸለመ ሆነ ነው",
"መልካም አክሱም",
"አለ መራ ቃል ሀይማኖት አባት መራ ተሳተፈ ምክክር መድረክ ተካሄደ ነው",
"ሺ",
"ንባብ በቃ መጽሄት አዘጋጅ ጠራ ጸሀፊ አለ ውጭ ዜጋ ቀጠረ አለ አንዳንድ ጅል ሰጠ አየ ተመለከተ ኢትዮጵያ",
"እነሆ እግዚአብሄር ቃል ጌታ መልአክ ዮሴፍ እነሆ፥ ድንግል ትፀንሳለች ልጅ ትወልዳለች፥ ስም አማኑኤል አለ ተባለ ፈጸመ ዘንድ ይህ ሁሉ ሆኖአል፥ ትርጓሜ",
"ልብ ሰበረ ጥንቃቄ አዳዲ ወለደ አየ ገባ ታሪክ",
"የኢህአዴግ አባል ፓርቲ ውህደት ወደ ብልጽግና ተደረገ ሽግግር የሳውል ወደ ጳውሎስ መሰለ ድርግ አሜን",
"ሜይዴይ ሜይዴይ ልጋልፈስያ ርገነ ኝሳወ ልህያ ቅለጥመለ ግን እናንተ ወገን ብቻ ነው ውሰ ውቀበደተየ",
"በአል ሆይ ፦ሚስቶቻችሁን ሰርፕራይዝ ተደረገ እኔ ተማረ",
"ነጣ ጋዜጠኛ ጥያቄ ፍራቻ ሸፈነ ይህ ሁሉ ጋጋታ",
"መድረክ መራ አርቲስት ከበረ ምስጋና",
"ህዳር ይህ ያ ከሰተ አለ ግጭት ጣለ ሀላፊነት ወጣ እንቅፋት ሆነ አወቀ አለ የእርቀ ሰላም ኮሚሽን ተናግሯል፡፡ ትእግስት",
"አዎ አነሰ ነካ እጅ ዘረፈ ህዝብ ንብረት ኢትዮጵያ ህዝብ መለሰ",
"ወደደ ጠቀለለ ሚኒስቴር በረታ",
"ባለሙያ አለ አንቺ ጥግ ደረሰ",
"አዲስ አበባ ሾላ ገበያ ሰአት አደጋ ከሰተ ጉዳት ደረሰ",
"ፀባዬ እንዲህም ነው አመመ ነው ብይ ወለም ዘለም አለለ ላከ ሆነ ላከ አለዚያ ማደርገውን ማቅ እኔ ነው መሬማ ማረ ማንኛውም በርሶ መጀን ጆን",
"ችግር አወቀ ፈለገ አዲስ አበባ በስተደቡብ ተገኘ አባ ሳሙኤለ ግድብ ያቆረውን በከለ ውሀ አየ የጠ/ሚንስትራችንን ላቀ ስራ ከፍተኛ",
"ሆነ እነደ እግዚአብሄር ፍቃድ",
"ጥያቄ እግዚያብሄር ሁሉ ቦታ አለ ምን ሰማይ ኖረ አል ጸለየ እግዚያብሔር ሁሉ ቦታ ተገኘ ሆነ ምን ቤተ መቅደስ ሰራ",
"ንጹሀን ህይወት ጠፋ ምክንያት ሆነ ግለሰብ ይፋ የኦፌኮ ፓርቲ አባል ሆነ",
"ሀትሪክ ስፖርት ሀትሪክ ስፖርት ሀትሪክ ስፖርት ወደደ ጋዜጣ ሀትሪክ ነገ እትም ምርጥ እና ወደደ ዘገባ ይዛሎት ብቅ አለ",
"ሺ ቶን ላይ አረረ ምርት ተገኘ አማራ ክልል እንስሳት ሀብት ልማት ፋፋ ኤጀንሲ አወቀ",
"እኔ ቀን ጊዜ ላይ አነጠሰ ላቀ ሰለቸ አለቃ አነጠሰ ቁጥር አለ አለ ነው",
"አውስትራሊያ አለፈ መስከረም ቀሰቀሰ ሰደድ ሰአት አሁን ቁጥጥር ስር አልዋለም፡፡ እሳት ቈጠረ እና ጉዳት ካሰ ድጋፍ ሰባሰበ ጀመረ",
"ይህ አህያ ነበረ ነው ወይስ ውርንጭላ ነገር አንድ ነው",
"ነፈዝ ትግራይ ህዝብ አታቂውም ማን ጎን ቆመ",
"አቤቱ አምላክ ሆይ እነ አጠበ ጭቃ ሰራ አወቀ ቀረ አለ",
"አንድ ደወለ ይህ ሰአት ተዋናይ ፍቃድ ምንድን ነው ዘረፈ አለ እኔቅኔ",
"ተጋዘ ሚኖርህ ጠንካራ ሆነ እንጂ ፈረሰ ሁሉ ከዳ ከጎናችን ነበረ ሱዳን ግብጽ ጎን ሆነ",
"ኧረ ምንድነው ጉድ ፈታ አለ እንቆቅልሽ አዘነ",
"ሺ ተጋ በረቀ መራ ነው መልካም ስራ ቀጠለ ኢትዮጵያ ወደ ብልጽግና",
"ይህ ቪዲዮ ዘና አለ አመነ መልካም ስራ ሳምንት ሆነ",
"ለውጥ ሮትራክት ከበበ ገና በአል እድገት ስራ ትምህርት ቤት ተገኘ ልጅ ጋረ አበረ እይተጫወትን በላ ጠጣ ከበረ ጋበዘ ሰአት ጥዋት",
"ግንኮ እኛ ሀበሻ ብዙ መሰለ እንጂ ሴት ከበረ ከበረ ቆንጆ ሴት ነው",
"መጥፎ ከበበ መጥፎ ተሻለ መጥፎ መረጠ ድል እና ብልጠት ሰጠ",
"ግል ጥረት ከባድ ብቻ ሆነ ዘላቂነት ኖረ ነው አለ አምባሳደር ህብረት ቆመ ገፋ መሰለ ተራራ ገፋ ቻለ አለ አምባሳደር ዝግጅት ተሳካ",
"ደመረ ሰው ሰራ መዋቅራዊ ጭቆና ተወገደ ብሄራዊ ተግባባ መጣ ዕርቀ ሰላም ፈጠረ ፍትህ ርትዕን ሰፈነ አላማ አለ አለ",
"አባይ ፈሰሰ ልማት ጽህፈት ቤት ተፈጥሮ ሀብት ጥበቃ ትኩረት ሰጠ ሰራ ሆነ ቆመ ኮሚቴ ገለጸ",
"አመነ ሰማይ አምላክ ብቻ",
"ጣም ደስ አለ ዜና ነዉ ገታ ህግ ቀረበ ተመሰገነ ተከላከለ /ፖሊስ በቀሪዎቹንም ቅርብ ጠበቀ ተማረ መታገት ፖለቲካ ትርፍ",
"አዲስ አበባ ከተማ አመት አማካይ ላይ ሰው እብድ ውሻ በሽታ ህይወት አጣ ኢትዮጵያ ህብረተሰብ ጤና ኢንስቲትዩት አስታወቀ፡፡ ተጨማሪ አመት አማካይ",
"አንድ እናት ልጅ እኮ ነው ደም ደም ቀዳ መምህር አየ ቦጋለ ደነቀ ንግግር ክፍል",
"ይህ ደሞ ሁሉ ቁጠባ ሆነ ተመቸ",
"እኔ ብሩክታዊት አክሊል አደገ እናት ቤት ጥጋብ ልብ ንፍት ተደረገ ቻለ ቻለ ገዛ ፍቃድ ተማሪነቴን ለቅቄአለሁ",
"እኔ አሁን ሆነ ቀጣይ ምርጫ በላ ብልጽግና ብቻ ነው እናንተ",
"አማራ ክልል ፕሬዝዳንት አፋር ክልል ከባድ ተቃውሞ ጥያቄ ቀረበ ወደ አፋር ደወለ ልዩ ዝግጅት ሼር ተደረገ",
"ማረ ወደ ዩኒቨርሲቲ ገባ ገባ ፈተና ኖረ ይሆናል፡፡ እኛ ክፍል ሀገር ቀፈፈ ፈተና ተጨማሪ",
"ቀን ልብ ሰበረ ሰው ሞት ወይ ሀጢአት ልክ አለፈ ወይ ይህ ሀገር ገባ ደም ጠማ ጋን አለ ንስሀ እና ጸሎት ነው ወጣ በእግዜር ፊት ተንበረከከ",
"ላስኪትaskit አለ መንግስት ባለስልጣን ደክስ አለ ናይጀሪያዊ ላይ ተበሳጨ ምን ለም",
"ተሸነፈ ፈለገ ሰው ሆነ ተሸነፈ ፈለገ ነገ ነው ጀመረ ጨረሰ ሪቫን ቈረጠ እንጂ ተስፋ ቈረጠ",
"መልካም ስራ ዘመን",
"የኢራን ሁለተኛ ከፍተኛ ባለስልጣን አሜሪካ ገደለ አል ቁድስ ልዩ ሀይል ዋና አዘዘ ነበረ ቃሲም ሱሌማኒ ጥቂት ሰአት ፊት አሜሪካ ወሰደ አየር ድብደባ",
"ኢዜማ ዘረኛ ምን ኢላማ ተደረገ",
"ምክር ቤት ሶስት ሚኒስትር ሹመት ጸደቀ",
"አሁን አየ ነው ስለ ህገመንግስቱ ተናገረ ፍጹም ውሸት ነው",
"ቤጣም ጠራ ናው አብቾው ምንያዳሪጋል አንተ ከውሲጥና ከውጫ ጣለ ደላ አወቀ ከውዲምክ ጋረ ምን አትሲማማም ያ ክፉ ዛማን አብራቹ አሳልፋቹው",
"በጄነራል ከሊፋ ሀፍታር መራ እና ትሪፖሊ ላይ ከተመ ሊቢያ ተፋላሚ ሀይል ተኰሰ ቆመ ተስማሙ፡፡ ሀገር ሙአማር ጋዳፊ እኤአ ገደለ ወዲህ ግጭት ነጻ ሆነ",
"ይሁዳ ለካ ወደ ሴት ቀየረ ይሁዲት ዮዲት ነዉ",
"ቀድሞ ደቡብ ቴሌቪዥን ስራ ባልደረባ ጋዜጠኛ ትእግስት ገንታ አደረ ህመም ህክምና ረዳ ቆይታ ታህሳስ ቀን አመመ ይህ አለም ሞት ለየ ፈጠረ",
"እዉነተኛ አብይ ባህርይ ርካብ ነበረ መጽሀፍ ላይ አለ ነው",
"ሞጣ ላይ ፈጸመ ሙስሊም ጸዳ ዘመቻ ከሚ ብር ላይ ገመተ ንብረት ወደመ ቦታ ቀና ጠራ ኮሚቴ ይፋ ተደረገ",
"መልካም ሁሉ ተመኘ",
"መጣ ለፃርቃን በእያለንበት ጸለየ ለሀገረ አቤቱ ጌታ ሆይ ማረረ ቀረ አለ ምህረት ወረደ እናት አለ ጥፋት አደገ",
"አዲስ ፈረንጅ አመት ሰላም ሰላም ሰላም ኢትዮጵያ",
"አሻግሬ ይህ ወንበር በቃ ማን ለመደ አሽሙር እንዲህ አለ ዘለፈ እና ተጋ ሰነፍ እኛ ጋረ ቀጠለ",
"ትክክል ነው ተከለ",
"ኤረ የት ነው መጣ ይህ ከብት ኤርትራ ትምህርት ጀመረ እስከ ሃይ ለበል ዩኒቨርሲቲ እስከነ ምግብ ነጻ ሆነ አወቀ ዝም አለ",
"ዶርደብፂዮገብሚካዔል፤ አንተ አሰበ ቢችላሉ ኑሮአገር መራ ተወ ኮነው ክልል አሰገንጥዬ አባ ለበሰ መራ ቀለለ አለ ፖሊቲካዊ አሟሟትየገባቸው መሰለ",
"እስክንድር ነጋ አዲስ አበባ ገባ ደማቅ አቀባበል ተደረገ",
"አማራ ብሔርተኝነት ላቀ ተግዳሮት",
"ከርካሶች አሁን ኋላ ነው ውሸታቹን እውነታቹንም አመነ አለ",
"እንግዲ ቻለ ነው ምን አለ",
"ዘመን ቴክኖሎጂ ነው ረዳ እና ረዳ ነው አንተ እውቀት ነጻ ሆነ ፈረደ ፈለቀ ጋዜጠኛ መጣ በር ክፍት ነው",
"ሸረሪት ቅጥ ሸፈነ ምድር ሸፈነ አለ ሀገር ሰው፣ ሀገር ህዝብ ፍቅር ሰላም ቅእት ለውጮችን ሰላማዊ መሰለ ውሸታም መሰለ ነው",
"ጥምቀት ድምቀት",
"መንግሰት አለ ሀገር ፍርድ ተገኘ እንዴ",
"ቤት ቈረጠ ብዙ ታማኝነት ነው ሃአ ላቀ ሰው ነው ህነማ",
"አጭበርባሪ ነው ተወ ሙስሊም አዘነ ሆነ ምክኒያት ተደረገ አማራ ተጠቃ ነው ሆነ አለ ቀውስ ፈጠረ ተደረገ ተውተረተረ ነው አማራ",
"ባለቤት ራቀ ፡፡ ኋላ ቈየ ወይም ተደረገ ቁጣ እና ስቃይ ወሰን አለ ፡፡ ደም መንገድ ቀይ ተደረገ ስቃይ ብቻ",
"እናት ተገኘ ላይ ምን ተደሰተ",
"ዱላ ጨበጠ ሰው ገደለ መንገድ ዘጋ እልፍ ነጻ ወጣ አእላፉን መንጋ አንቀጠቀጠው እስክንድር ነጋ ድል ዲሞክራሲ",
"ጦርነት በአስተዋዬች አቀደ አጀማመሮን ብቻ ሆነ አጨራረሶን ጭምር ወሰነ ተጹኖቸወን በለጠ ያሳስበቸዋል እባካችሁ ሰለ ጦርነት አትስበኮ ጦርነት",
"በራ ኃይልማ መንግስት አለ ሀገር ይሔን ስህተት ሰራ ግን በራ ሀይል ራስ መንግስት አቋዋቁሞ ሆነ እጥፍ",
"ገረመ አርቲስት ወጣ ነበር ያለቦታው ገባ ሀገሪቷን ተጨማለቀ",
"ባህርዳር የሁላችንም ሀይማኖት ብሄር ከተማ ሆነ ገባ",
"ኢትዮጵያ ፈረሰ ፈለገ እሱ ራስ ፈረሰ አላህ ኢትዮጵያ ባረከ በእምዬ ድርድር ለም ሆነ እምዬነቷ ሁሉ ሆነ እስመጨረሻ እስትንፋስ ታገለ",
"በውጭአለምየአለም ፍጻሜ ይህ ሰሞን ነውበሚል ሰበከ አባት ልጅ ምሽት ራስ ገደለ፣es ምን ይሳቀቅአክራሪ ምእምን ፈጠረ ይህ ቀቢፀ ተስፋ ስብከት እኛ አልተተገበረም አለ",
"ወሬኛ ወሀቢ ለማ ኦነጋዊ ፀረ አማራ ፖለቲካ ሆነ ተጋልጧል ማረ ቀረ እንጂ አማራ ሙስሊም መጅሊስን አንድ ወሎ መጅሊስ አንድ",
"አሜን አሜን እኔ መልካም",
"አዎ እሱ ነው ገብያ ዘጋ",
"ግልጽ እኮ ነው ሁሉ ነገር ፖለቲካ መዘነ በስተቀር ይህ እረኛ ጣም ያሳዝናሉ፣ ግን አልተጮሄላቸውም",
"ሰመሃት ጎበዝ ነው ጣም ጠራ ዘፈነ ሆነ ብይ ጠበቀ ነው",
"ቻለ ተካሄደ ማራቶን ውድድር ኢትዮጵያዊ አትሌት ሁለት ጾታ ተሸነፈ",
"ተጨማሪ ጸሀፊ ብዙ ጥቂት ዓለማያን፣ ሆላንድን፣ አርማጭሆንና ሱዳን መሰጠ የአጻጻፍ ስልት ዳሰሰ ጸሀፊ ገራ ልጅነት ጉርምስና ዘመን",
"ወይን ይህ ሰው እቃ ለየ አለ ነው አንድ ኤልቲቪ ወቅታዊ ላይ ቀረበ ትግራይ ወለደ ሆነ ብቻ ብዙ አሰረ አለ እንደ ምሳሌ ማን ጠቀሰ ጠራ ነው",
"ጎረቤት ሀገር ጠቀለለ ሀሳብ ጤነኝነት ነው አለ እንዲያውም ሀገር ቈረቈረ ነው፤ ታሪክ ተማረ መከራ ተረፈ ፈለገ እኛ አነሰ ሰላም ገባ",
"እኔ ደገመ የባርሳን አንተ ከነትርጉሙ እችለዋለው እንቁልልጭ",
"ይህ ውህደት ሩጫ ሆነ አለ ችግር ፈጠረ ራስ ኢህአዲግ መፍትሄ ሰጠ ሆነ ኖረ ስኬታማ ሆነ ድል ላቀ ነው፤ አሁን ግን ችግር ፈታ",
"ናደ የአክስትነትሽን አካል ተገኘ ዘመረ ጣም ደስ አለ ነበር",
"ጨቋኝ ሰራ በለበት ዜግነት ቀረ ሁኔታዎሽ አሉመሰደድ አንድ ነውያንኑ ዜግነት ሰደበ ኖረ ሌላ ነውበምርጫው ተወዳደረ ህግ ከበረ ነው ሊገሉኝ ነው አለ",
"ሀበሻ አለ ተማረ መጣ ወንድም ፎቅ ላይ ወረወረ ጣለ አውስትራሊያ ካንጋሮ ያዘ ጸሎት ተደረገ ድንቅዬ ህዝብ ነው",
"ጠዋት እንደሚንቀረፈፍ ታክሲ ሹፌር የሚስጠላ ነገር ለም እኔ ሰአት ደረሰ ወይም መሞተ ነው ፈለገ",
"ታክሲ ውስጥ በግ ወንበር ላይ ቁጭ አለ ገዛ ሰውዬ መሬት ላይ ነው",
"አንተ ሰው ነው አሁን በክት ይህ ፖለቲካ ትርፍ ፈለገ ቆሻሻ አንተ ጋረ እኩል ቈጠረ አመመ እንከፍ ሰው ውዳቂአረ ጨመረ",
"ሌላ ረስተሃል፣ ፀረ ዴሞክራሲያ ነው መጣ አንድ ሰው ተሸነፈ ሞተ እገኛለው አለ አማባገነን ነው",
"መንግስት ግል ተቋም ኢትዮጵያ ኤሌክትሮኒክስ አንድ መስኮት አገልግሎት ተግባራዊ ተደረገ ፈረመ",
"ለአሻሚነት ቀረበ ጥያቄ ሆነ ሶስት ሆነ ጠራ መልስ ነው",
"አወቀ የአልሃዳዝ እና የአልአረቢያ ቴሌቪዥን ዜና ፕሮግራም ቀረበ ናደ ካሴ አመት ዛሬ ጠዋት ይህ አለም ሞት ተለየች፡፡",
"የት ኢትዮጵያ ንጉሰ ነገስት መንግስት ህገመንገስት ገባ ላይ ኢትዮጵያ ታሪክ አረመኔ እስላም ተጨነቀ ኖረ አለ",
"ስራ ፈት",
"አማራ ጎጠኛ ነው አማራ ነው አለ በጎጥ ተወራ እውነተኛ አባት ፈለገ መለለ ኢትዮጵያ አማራ እና ሌላ ሁሉ ሀገር ነው",
"ሌባ እኮ ሰረቀ አለ ገረፈ ነው ሰረቀ ተናገረ ቤተሰብ እሄ ጠፋ ነው እንዴ በላ ዲሞክራሲ አለ ኖረ ገረፈ እንደ ሰረቀ ተናገረ",
"እኔ ምን ጊዜ ልዩ መራ ነው እባክህ ክቡር አቶ ማ ጋረ ያዘ ረገበ አለ ወር ህዝብ መካከል ለየ ፈጠረ አስቸኳይ ሁኔታ",
"አቅመ ደካማ አዲስ አበባ ከተማ ነዋሪዎች ገነባ ቤት አስተዳደር ም/ከንቲባ ዛሬ ለነዋሪዎቹ ተረከበ",
"ዉድ የፊስ ቡክ ጓደኛ እንኳን አዲስ የፍርንጆቹ አመት ሰላም ደረሰ አዲስ አመት ሰላም አንድነት ፍቅር ብልጽግና ሆነ ዘንድ አለ መሀደረ ዜና ተመኘ",
"ተለማመጠ አቅም አለ ናና ተጋፈጥ እንዴ አሁን ምን ተደረገ ሆነ ጠፋ ነዉ",
"እስክንድር መልካም ልደት በአል ሆነ",
"አለቀ አለ በሽታ",
"ተወ አንተ ትብስአንተ ባሰ ከተማ ለሁላችንም በቃ",
"መሰለ ቃል አሁን አለ ሰማይ ምድር እሳት ተከማቸ ፈሪሃ አምላክ አለ ሰው ጠፋ ፍርድ ቀን ደረሰ ጠበቀ ጴጥሮስ",
"ከፖለቲከኞች ጠበቀ ዘለቀ ታማኝነት አንዳንድ ህልም ብቻ ተደረገ ጋራ አላማ ከፍተኛ ግል መስዋእትነት ከፈለ አለ ኖረ ግልጽ ሆነ ነው እኛ",
"እንጀራ ወጣ እጅ ተተራመሰ መጣ ቢላ ፈተፈተ ነውር",
"ጣም ደስ አለ ይህ ሰማ ውድ መራ ምስጋና ደረሰ ጀመረ ይህ ሀሳም መጣ ሁሌም ከጎኑ ነው",
"ጭራሽ ሰማ እዚ ሰፈር ከበደ ነው ሰማ",
"አንተ ዶማ እስክንድር ማን ፈለገ ብቻ ያርበደብድሀል ላቀ በላ ፕሮፌሰር አሰረ ነቃ ዥልጥ",
"ጥንብ ዘረኛ ይሄ እናንተ ስራ ነው ሌላ ማን ነው ቀጠለ ደሞ አማራ ሙስሊም ክርስቲያን በላ ያሰባቹሁት ሴራ ከሸፈ ምድረ ዘረኛ",
"ሙስሊም ራስ ሚዲያ ተቋም ፈለገ ሙስሊም ሆነ ሚዲያ ጀርባ ማህበር ርኩስ ነው መራ ይህ ነው ራስ",
"እውነት ተነጋገረ ተባለ ሹመት አለ ሹፈት ብንልው ተሻለ አንድ ወታደራዊ ሳይንስ ከፍተኛ ጀነራልን እንዲሁ ጣለ ሆነ ክብር ጡረታ",
"ዋዉ ደስ አለ እኛ ጀግና በረታ",
"መስጊድ ቀጠለ ውግዝ ምስጋና ውጭ ሌላ ግብረ መልስ ሰጠ ረዳ ቻለ ሆነ እኔ ረዳ ሞከረ ገጠመ ጠቀመ አማራ ክልል ማህበረሰብ",
"ዘር ዛር ያዘ ህሊና ሞተ ዘር ፖለቲካ ነጋዴ ኢዜማና ብልጽግና ተወሀደ ነው አለ ሀሰት ራስ ፈብርከው ራስ መልሰው ድሮ እንዲህ ሆነ ገማ አለ ደነዝ ሁላ",
"ምን ተደረገ አለ ነዉ ራስ አረረ ሰው ድስት መሰለ ሆኖባቸዉ ነዉ አትፍረጂባቸዉ ሰራ ረጋ ቆመ",
"ህጻን ጥይት ደበደበ ገደለ ተባለ ሰማ አላውቅም፡፡ ይህ ጭካኔ ወደር ተገኘ ነው፡፡ ሰው ግን ንዴት ነው እንደዚ አውሬ የሆነው፡፡",
"ቤት ውሀ በጀሪካን ሞላ ችግኝ ጠጣ ኢትዮጵያዊ እንዲህ አይነት በጎ ተግባር ሳለ ኢትዮጵያ ቀጠነ የማትበጠስ፣የደከመች መሰለ ሞተ ሆነ ሰማ",
"ሀያል ፈጠረ እጅ ብቻ ነው",
"ችግር አለ ኢትዮጵያዊ ቦኩሃራም ሆነ ራስ መንግስት ነው ንዴት ሀገር ምድር ይህ አከለ ቀን ሲታገቱ መንግስት ዝምም አለ",
"አንተ መልካም ምኞት ቀቀለ አለ ወረኛ ጥንብ ዘረኛ ጠፋ ይህ መርዝ",
"እኛ በቃ ውሀ ተገኘ ጠላት አረብ ጠጣ ጐደለ ቆመ ገባ እኛ ጠጣ አተን፣ ሰውነት የምንጣጠብበት ውሀ አጣ ገማ ኖረ እኛ ውሀ አረብ ቀን",
"እግዚአብሄር ይህ የዋህ እንግዳ ተቀበለ ሰው ከበረ ኢትዮጵያ ህዝብ ተማረ ማሀይሞች ርካሽ ፖለቲካ ላቀ ሰላም መጣ",
"እኔ አየ ሰረቀ ፡፡ ተልእኮ ሰጠ ይህ መራ ሰማእትነት ቀረበ መጽሀፍ ከበረ ንግግር ሰጠ ተልእኮ ሰጠ ተልእኮ",
"ማን ነበር ጌታ ረዳ አወቀ ነበር ሞቀ ቦታ ጠፋ አላዛኝ ጥግ ተቀመጠ ማላዘን",
"ሉቃስ ነፈሰ ቅዱስ ያቺ ሰአት ተናገረ ገባ አስተማረ",
"አደረ በቃ ሀገር ትርፍ ብቻ ሰደደ ድንበር የለሽ ካፒታል አለፈ ሰጠ ዛሬ የቤተ መንግስት ሰው አንድ ተመቸ ነገር ኖረ አንዳንድ የጎንዮሽ ኢእኩልነት",
"ሆነ ተባለ አማራ ኦሮሞ ህዝብ ጠላ በወያኔው ካድሬ አሉላ ሰለሞን ድብቅ የተምሰረትውና እውር ትግራዋይ",
"ከፍተኛ ትምህርት ተቋም ጸጥታ ችግር ፈታ ሰራ ሆነ ገለጸ",
"ፕላኔት ተነተነ ህጻን ሮቤል አምላክ እና እኛ ክፍል መረመረ ህጻን ቅዱስ እንቁባህሪ ጋረ ተደረገ ወይ ኢትዮጵያ ይህ ልጅ ተመለከተ ህሊና ብዙ ነገር እናንተ",
"እግዚአብሄር ባረከ",
"እንኳን አመት ኋላ ጀመረ ጊዜ አዲስ አበባ ተከበረ የሀላባ ብሄር ዘመን ለወጠ በአል ሰላም ደረሰ መልካም አዲስ አመት ቅንፍ ሆነ ቀረ አለ ጨመረ ነው",
"ሰበር ሰበር ዜና ማ መገርሳ ትናንት ስራ ወደ ውጭ አገር ሄደ ኤርፖርት ለመደ መስመር ገባ ሞከረ ከለከለ ተራ ሰፈረ ጋረ ተራ ያዘ ሰፈረ",
"ታህሳስ ጉራጌ ዞን አደረ የጉራግኛ ቋንቋ በሥርዓተ ትምህርት ውስጥ ከተተ ሰራ ነው አለ",
"ጌታ እናት እመቤት ፍጹም እሩሩህ ነው ስም ጣእም አለ ጭንቀት በዛ አንቺ እፅናናለሁ አለም እርጋታ ሰላም ውጥን ነው ጊዜ ጣለ ሰው ጨከነ ልብ",
"ገረመ እኔ አንድ ወገን ሰራ አለ ነገረ ወዲያው ብሎክ ተደረገ",
"አመት ፊት ሰራ ነበረ አጠቃላይ መጣ አለ ፈቃድ ቀረ ተደርጓል፡፡ ንግድ እና ኢንዱስትሪ ሚኒስቴር አለ ንግድ ስርአት ችግር አለ ረዳ",
"ብርሀነ ልደት ኢትዮጵያ ኢትዮጵያዊ ፍትህ ዲሞክራሲ ነጻ ተጭበረበረ ሰው ህይወት ከንቱ ጠፋ ግልጽ ምርጫ",
"የቮልስዋገን አፍቃርያን ታህሳስ ነበረ ድሮ ዘንድሮ ፕሮጀክት ላይ ግል ላከ ፎቶ አንድ ነው እነሆ ድጋሚ በቮልስዋገን ኢትዬጲያ ቤታሰብ እና አዘጋጅ ስም",
"ማህሌታይ ያሬድ አንተ ታላቅ ነው ኢትዮጵያ ሰው ምግብ ሰጠ መዝ አለ መጽሀፍ ቃል ፍጻሜ አየ አንተ ነው እኛ ሕጹጻን ዘመን ሰው ግን ይህ",
"አነሰ በዛ ሁሉ ፓርቲ አለ ቻለ አማራነትን ጠላ ኢትዮጵያዊነትን እንደ ወደደ አይነት ሞኝ አባዜ",
"ሰርድ ሃንድ ካድሬ አለ እነዚህኞቹን ደገመ ሰከንድ ሃንድነት ሆነ እንኳን ንቃተኅሊና አለ",
"ቆንጆ ሆነ ቆንጆ ነው አለ አመነ ለየ በልዋት አስቀያሚ ቁጥር አንድ ነው መልክ መልክ አለ ስራ ስርአት ስርአት አለ ገምጭ",
"ነብሰ ገደለ አንድ ቀን በእግዚብሔር ፍት ፍርድ ቀረበ",
"ሰውዬ ችግር ውስጥ",
"ታህሳስ ኢትዮጵያዊ ባለሀብት ውጭ ኩባንያ ጋረ በሽርክና ተከናወነ ፕሮጀክት ላይ ሆነ ወደ ምርት ገባ ተባለ",
"እስይ ጎሽ",
"ቅዠት ተባለ ለም ተግባርreality እና ቅዠት ለየ አወቀ አለ ነው ወይም ጣም ንቅልፍእ",
"እነ ጃዋር እንደ ልብ ተንቀሳቀሰ እየፈቀደ፣ እነ እስክንድር አዳራሽ ንክ ጠቀመ ከለከለ መንግስት ኖረ ምንኛ መልካም ሆነ ነበር",
"ደመረ ለኢትዮጰያ እድገት",
"ዌል እንግዲህ ከሜሞሪ ሎስ እና ስኳር በሽታ መረጠ ነው አለ ነው",
"ሚያሳዝነኝ ኦሮሚያ ውስጥ ስንት ተማረ ይህ ሰው ተሻለ ሀገር ከፍ አረገ ህዝብ ከፍ አረገ ሚችል ሰው አለ ጥላቻ ርጅ* ሀሳብ ውስጥ አለ ሰው ያዘ መቶ ይህ ህዝብ ላይ ማላገጥ አዘነ ጣም",
"ሁሌም እንቅልፍ ተነሳ ይህ እውስ አንተ ፈለገ ሆነ አስፈላጊ ነው",
"ቁራጭ እናንተ ነው እንዴ ተተራመሰ የማትቆፍሩትጉድጏድ ምን ቀረ ዘረፈ ገንዘብ ምን ሰራ አመት",
"አደራ ሀገር ልጅ አደራ አየ ሳቀ ጨዋታ እንጂ ጭፈራ እኛ ፈለገ ጥማድ በሬ ላም ሳይነካ፤ እምነት ጠበቀ ነው ሞተ ለካ",
"ሰራ ክፍያ ከፈለ ፡፡ አደባባይ ጅምላ ጨረሰ ነፍስ ያዘ እና እሳት ኖረ ፡፡",
"ሰው አጣ ኤርትራ አስመጪያ እንግዲህ",
"እግዝያብሔር መልካም ሰራ ብቻ ሆነ ክፉ በጎ ቀየረ",
"ኢትዮጵያ ኖረ ድጋፍ ተባበረ ፈለገ ይህ ኢትዮጵያ ንግድ ባንክ አካውንት ቅርብ ተገኘ ባንክ ቅርንጫፍ ሄደ ድጋፍ ተደረገ",
"ደባርቅ ከተማ ላይ ነገ ተደረገ ሰላማዊ ሰልፍ መንግስት ይሁንታ ድጋፍ ተገኘ",
"እንኳን እውነት ምስኪን ህዝብ ታገለ ንጹህ ኢትዮጵያዊ ቀረ በግ ለምድ ለበሰ መጣ ኳለ",
"ጉዞ አብቹን ያዘ አብቹ ውጪ ለምኖሩ ኢትዮጵያዊ ፈረንጅ አዲስ አመት ተመለከተ እንኳን ደረሰ መልእክት አስተላለፉል",
"ዘው ዘው አለ ፈራ ላይ ተቀመጠ ይህ ያዘ ለቀቀ ብይ ነበር ጠቀምጣ ተነሳ ደሞ ጣለ ነው",
"ሰው ሆነ ሰው ኖረ ፈለገ የትኛው ሰው ሰማ ምርጥ ሀሳብባባት ተከለ ችግኝ አደገ ልጅ ፍሬ ሰጠ መብል ሆነ ጣለ አረፈ",
"ደስ አለ ወግ ሳቅ ፈገግታ",
"ማ መገርሳ መድረክ ላይ ሆነ ውህደት አስፈላጊ አይደለም፤ ደመረ እሳቤ አያስኬድም አለ አማራጭ አየ ደንደአ",
"እኔ አመት ምርጥ ጋዜጠኛ ዋልታ ጋዜጠኛ ስሜነህ ፈረሰ ነው",
"ሳይንስ ከፍተኛ ትምህርት ሚኒስቴር ስድስት ወረረ ፈጸመ",
"አንተ ልጀ ግን ጤና ነው ወይስ አማ በላ ተባለ ሰይጣናት ከፋ ደሞ ራስ ብቻ ምን ነው ተወራ ከበረ እነማን ጋረ ነው ከበረ",
"ውድ ኦስማን፤ ቴሌኮም አገልግሎት ወርሀዊ ሂሳብ ከፈለ አማራጭ ሁሉ ሀገር ክፍል አገልግሎት ቀረበ ነው፡፡ ቀዳሚነት መረጠ ከፈለ አማራጭ ጠቀመ ከፈለ ይችላሉ፡፡ ተመሰገነ",
"ለም ፓርቲ አቋምማ አቋም ነውበፓርቲው ውስጥ አንድ ሰው አንድ ድምጽ አይደል ሌላ ነገር ፓርቲ እኩል አለ አላፊነት አገር ቀፈፈ ሆነ ስራ ምድብ ላይ አለ",
"አርቲስት አስቴር በዳኔ አሁን ደሥ አለ ሁሎም ረጋ ሰከነ ሕሣቤሽ እና አንደበት መለሰ ሰው ናፃ ፍጡር ነው ጠንካራ ጎሽ በረታ ጠነከረ በላቹሕ ስር ግድፈት",
"ወንድም ጋረ ኖረ ጎረቤት ጋረ ቀጠለ ሀገር ሰላም ኖረ አንደበት ወንድም ላይ ከፈተ ንግግር ወንድም እንደ ተረጐመ ነው",
"ክልል አብይ ቁጥጥር ውጭ ነው",
"ምክር ቤት ነገ ደበነ ጉባኤ ጦር መሳሪያ አደረ ቁጥጥር ረቂቅ አዋጅ መረመረ ጸደቀ ጠበቀ",
"ሀገር ሰላም አለ መስጂዶቻችን ቀጠለ አለቀ ፈቀደ እምነት ክብር ሰጠ መራ ነገ ተሻለ ነገር መጠጠ ብይ ጠበቀ",
"መርዝ ጀመረ ጐዳ ተቀመጠ እቃ ነው ጥላቻ እና ክፋት እንዲሁ እኛ ውስጥ አደረ ቁጥር ቀደመ ጐዳ እኛ ነው እስኪ አዘነ ሰው ቀረ እስኪ በጎ",
"ኦሮሚያ ነጥብ ቢሊየን ብር ተካሄደ ንጹህ መጠጥ ውሀ ፕሮጀክት ኮንትራት ስምምነት ፈረመ",
"ህገወጥነትን ተከላከለ የሁላችንም ድርሻ ነውህገ ወጥ ደላላ አበረ ህግ ቀረበ",
"አንተ ሰው ተቆጥርህ ምድረ ጠበበ ዲያቢሎስ ምን መሰለ ሴይጣናም",
"አምላክ ሆይ ረሳ",
"ሌላ ብሄር ጓደኛ አለ አለ ተናገረ ሰው አመነ",
"ፍጹም ፍርድ ፈጠረ ብቻ ጠበቀ",
"ኢትዮጵያ ስጦታ ገነነ ኰራ እኛ መፀሀፍ",
"የሰገጤ ትርጉም ገባ ነዋ መለሰ ጥቅም ላይ ዋለ አንቺ ዥልጥ",
"አክሱም ሀውልት ጥገና ቀጣይ ወር ይጀመራል፣ ጣልያን መንግስት ታሪካዊ ቤት አደሰ ቃል ገባ",
"እ/ር ዘመን ሁሉ ባለቤት ዘላለማዊ ነው የእ/ር ዘላለማዊነት ነበረ ነገር ሳያጎል አዲስ ነገር ጨመረ ለወጠ አለ ነው እ/ር በግዜ አይሰፈረም ምክንያት ግዜ",
"ክፍያ ስርአት በያለንበት ቦታ ሆነንበስልካችን ከፈለ መንገድ ተመቸ ጣም አሪፍ ነው",
"ኢትዮጵያ ሰራ እጅ ሀሳብ በሚያመነጬ አእምሮ አለ ሰው ትበለፀጋለች",
"አጭበርባሪ ሌባ ውሸታም በጥራቃ አንተ አለ አማራ የኦነግ ቡችላ ጠፋ ይህ መርዝ",
"ይኼንስ ታዝበህልናል አዲስ ትራፊክ በራ ተከለ ቁጥር ገመድ ቀበረ በቱም አቅጣጫ ቈፈረ ሁሌም ደፈነ ተወ በራ ጀመረ መኪና",
"ነው አለ ነው ነፍስ",
"ቀን እኮ አዘነ ዜና ሰማ ነው",
"በለጠ ተስማማ ቻለ",
"",
"እንኳን ደስ አለ ጤና ሚኒስቴር አዲስ አበባ ዩኒቨርስቲ ለዶ/ር ዋቅጋሪ ዴሬሳ አመንቴ የፕሮፌሰርነት ማእረግ ሰጠ ሰማ ደስታ",
"እንኩዋን ወደ ተሻገረ ተሻገረ ሁላችንም አለፈ አመት ተሻለ አመት ተደረገ እግ/ር አመት",
"ለ፪፩ኛው ክፍለ ዘመን የተቀናጀ ዘመናዊ ጥያቄ ስለ ራስ ነው ኤኤሜሪካ ቀረ ገና ለእንናንተ አለ ብቻ ሁሉ ሰውቼላቹህ ጥዬላቹህ መጣሁኝን",
"አዲስ አበባ ኦሮሞ ሆነ ኮተቤ ካራቆሬን ቀላቀለ ነገ ቡራዮን ቀላቀለ ኤርሚያስ ለገሰ ባልደራስ ምክትል ሰኔ ተስቦ ሆድቃ ጠቀለለ ፈነዳ የት መጣ ነው ቀደደ አንተ አሳማ",
"ተከላከለ ሚኒስትር አቶ ማ መገርሳ መራ ከፍተኛ ኢትዮጵያ ልዑካን ቡድን አሜሪካ ገባ",
"ለበኒያ ድሮ ልጅ ሆነ ጣም ወደደ እና ለመደ ጀላቲ ዋጋ ጣእም ላቀ ነበር አብዛኛው ጊዜ ወይ ለአመትባል አሊያ እንግዳ መጣ ብር ሰጠ ነበር ገዛ",
"ሰው ነገረኛ ነው አንድ ዛሬ እንኳን ከቲም ማ ወደ ተወ ማ ሰላም ተሻገረ አለ",
"ሚኒስትር ምክር ቤት አዲስ ተዘጋጀ የኢንቨሰትመንት ረቂቅ አዋጅ ጸደቀ ወደ ህዝብ ወከለ ምክር ቤት ላከ",
"እንኳን ብርሀነ ልደት ደረሰ ዉድ እዳ ቬለ ተከታታይ በአል ንዴት ነዉ ሀገር ኢትዮጵያ ሰላም፤ ፍቅር፤ አሰበ በዛ ዉድ ወደደ ገና በአል ምኞት ገለጸ",
"ምን ተደረገ መርህ አለ መደዴ ፖለቲከኛ በዛ ሀገር ጥቅም በኢጎ ቅርጫት ውሰጥ ከተተ የሚያላዝን ውስጥ ጉዳይ ከሃገረዊ ጥቅም ለየ ሚሊዮን ህዝብ ተሸከመ",
"የሞጣውን መስጊድ ቃጠሎ ዘገበ አከለ ደገመ ፍጹም ስነ ስርአት ጐደለ ሆነ ግልጽ አየ አሁን ሰራ አለ ስህተት ሰራ ሙያ ሆነ ጨዋነት ብቻ በቃ ነበር",
"መሬቱማ ድነጋይ ነው ውሀ አለ ይሆንአሱም ግመል ሆነ",
"አክሱም ከተማ ተገኘ ጥንታዊ ህንጻ ከፍተኛ ጉዳት ዳረገ ነው ተባለ",
"አሜን ሰላም",
"ኦዴፓ ብቻ መለሰ ቻለ ሌላ ጋረ ተወሀደ መለሰ ኦሮሞ ጥያቄ ለሚነግርኝ ውለታ ታላቅ ምስጋና ቀረበ ነበር",
"ኦሮሞ ተናገረ በኦሮሞኛ ጻፈ ብዙ ህይወት ዳነ",
"ህይወት እድሜ ሁሉ ማን አይቋቋምህም፥ ሙሴ ጋረ እንደ ሆነ",
"ኢትዮጵያ ምጣኔ ሀብት ያዘ አመት መቶ አደገ ቻለ ተባለ",
"ነፍስ መለሰ ተገኘ ወጣ መጽሄት ቀላል ነው ሆነ አነሰ ተገኘ ተደረገ ጥረት እና ሌላ ሙሉ ሙሉ እና ሙሉ ሙሉ ትርጉም የለሽ ሆነ ፡፡",
"ትክክል አለ ዶክተር እናተም አንድ ሆነ",
"ፍትህ ህሊና እስረኛ",
"የፓለቲካ ሰራ ሁሉ እኩል አየ እይቶ ትክክለኛ ፍትህ ወሰደ ቻለ ንብረት",
"ሀገራዊ ምርጫ ዘንድሮ ሆነ ሞተ ተገኘ አለ አለ ነገር ነው",
"እኔ መረጠ በቧንቧ ወተት እስከ ቤት ድር አለ ፎከረ ግን ምን ሳበ ነው እድሜ ላንታ ራስ መራጭነት አግልያለው ውሸት ቃል ብቻ አራ ሰለቸ እህህህ ፈየ ህንደሩ የባድ ወልድ ይሴማን",
"አማራ ክልል መንግስት ገለጸ ኢጅነር ተመኘ እራሱን ጠፋ ነው አለ ቀልድ ሙስሊም መስጅዱን ቀጠለ አለ ጋረ አንድ ነው",
"ድል ለብጽግና ፓርቲ",
"ኣቦይ ስብሀት እውነት ተናገረ ጆሮ ዳባ አለ አሁን አቶ ትራሞ ድምጽ ጐላ ሀቅ ነው አለ ይሆንዝቃጮች",
"ትእግስት አለ ትእግስት አለ ብቻ ነው",
"ያዘ አለፈ ጠንካራ",
"እኛ መጠጠ ሀበሻ ሴት ረዳ ልብ አለ ብይ እንዲሁ ልማድ ሳበ ነገር አለ መሰለ",
"ውይይት ሆነ ተግባር ነው ምንፈልገው ጠቀለለ",
"እና የትኛው ሸውራራ ዞረ አሳ ጠበሰ አለ ሆነ ዘረኛ ወግ ደረስ፣ ፖለቲከኛ አወቀ ተብዬዋቻችን ሁሉ አለም ቀፈፈ ከተማ እንዲህ አደገ ግን",
"ዛሬ እንደ እኔ ምህረት በዛ ማን ነው",
"ምነው ወንበር ላይ ቁጭ አለ መሐሙድ ጣም እድለኛ አዝማሪ ነው ጤና ሰላም ተመኘ",
"የድብርት ስሜት ተወገደ መንገድ አለ መጽሀፍ ተገኘ",
"ልዩ ዝግጅት ግጥም እና ወጎች፤ በአል እና ናፍቆት ተመለከተ ጋራ ትውስታ፤ ጉራጌ ማህበረሰብ ዘንድ ገና ዋዜማ ከበረ ዳሰሰ ሸለመ ጥያቄ አለ",
"tWስtWስ ረሳ ፊልም ብቻ አየ ምን አለ ፋሶ",
"ኮንሰርቱን ገባ አየ አሁን አልወጣለህ አለ ስልክ እያንጫጫሃት ነው ቈየ አቦ",
"ይኼ በጎ ጅምር ነው ይቅርታ ደረሰ",
"አማራ ክልል ጠቀለለ ዐቃቤ ህግ ሺ አረመ ይቅርታ ተደረገ",
"ይህ በታርክ ማህደር ላይ ይቅመጣል ግን",
"አንድ ሰአት ፊት ምሽት ላይ ብር ብድር ጠየቀ ምን ረገጠ መልእክት ደረሰ ሂሳብ ደገመ ቼክ ተደረገ ብር አመነ",
"ወለጋ ውስጥ ጦርነት ለም ጦርነት የለው መዋጮ ሰብሳብዎች ምላስ ላይ ነው ሽፍታ ግን ህዝብ መሀል ለቀመ ገደል ኖረ ለም",
"ግፍ ወሰደ ኢትዮጵያ ባህር በር መለሰ አለ ዲንጋይ ራስ",
"ትዊተር እንደ ዛሬ ደባሪ ሆነ አያውቅምህዝቤ ወጠረ ጭራ ቆላ ነው",
"ተመለከተ ያ ጠላ ሎጋ አንጀት በላ ሰጠ ጸጋ አንቺ ነው አለ ለት ጣም ተደሰተ ነቃ ሳምንት ከጎንህ ተኛ እትት በረደ ደረሰ ዋስ ፍቅር",
"ጫት ሃራራ ያዘ እንዴ አንቺ ጀመረ ሺ ህዝብ ወሰደ ከዛ አፍ ከፈተ",
"መንግስት ቃል አቀባይ አቶ ንጉስ ጥላሁን ስራ ገዛ ፍቃድ ለቀቀ አለ ህዝብ ዋሸ እንደ ገደለ ወንጀል ቈጠረ ዜጋ ላይ ውሸት አጀንዳ ቀለደ",
"በረቀ ሰው ፈጠረ እድሜ ጤና ሰጠ",
"ትምክህት ነው ይህ መናገሬ፤ ቀና እንጂ ሰነፈ ገበሬ፤ ሀዋርያ ሴጥፍ አርድእት መንጋ፤ ቀና ቀና ላላ በለጠ ጸጋ አለቃ ኪዳነወልድ ክፍል",
"ምርጫ አገር ሰላም እና ረጋ ፈተና ሆነ ቻለ ጠቀለለ ምኒስትር አቢይ አህመድ ተናገረ ምርጫ መጣ ግንቦት አሊያ ሰኔ ወር ተካሄደ ቻለ",
"ቀን ይቅርታ ለመነ እና ህመም እና ተስፋ ቈረጠ እንጂ ሌላ ምን ተወ ቀን መጣ ክፉ መጣ አመመ ህይወት ጨረሰ ቀስታ እና አሳዛኝ",
"በራ ኖረ ምን ነው ሚቆጥሩት",
"አንድ ነገር አለ እና ማረ ነገር",
"ኢትዮጲያ በአውሮፖውያን ቀና ገዛ ገዛ ብቸኛ ጥቁር ኰራ ሆነ ሀገር ነው",
"ለወደፊቱ ይህንን ተናገረ ተጸጸተ ፡፡ ያ ብርድ ብርድ ብቻ ኖረ አመመ ይህ ጊዜ ደረሰ ቻለ ነገር ሳበ ፡፡ እና ያ",
"ምቀኛ እኮ ነው",
"በቤቴክርስቲያን አሁን ቅስቀሳ ቪዲዮ አየ ነው ነዋሪዎች ተናገረ መንግስት ምን ቆመ",
"ቁጠባ ተሻለ ነገ ቁጠባ ራስ መልካም ቢሆንም፤ ሽልማት አጀበ ደገመ አለ ተሰኘ ነው ዕጣ፡ ዘመናዊ ቤት አውቶሞቢል ኒሳን አልሜራ ሲሲ ዕጣ፡",
"ተስፋ ጠበቀ እናት ሰላም ላከ ልጅ ሬሳ ሳጥን ጫነ መጣ ሰማ ሀዘን ስሜት ከባድ ነው ይህ ማረ ብለሁ አለ ሄደ ሬሳ",
"የሎዛዋ እመቤት አንተ ጋረ ሆነ",
"ጣም ገረመ ሰው ውስጥ ከፊሎቹ፤ አቻምየለህ ታምሩ፣ ብሩክ አበጋዝ ስዩም ሾመ ስለ አህመዲን ጀበል ትችት ጻፈ ከጎናቸው ሆነ የሚያሽቃብጡና ጨበጨበ ሱፍዮችና አሕባሾች ነው",
"አክሱም ጽዮን ማርያም እናት ሀገር ባረከ አሜን",
"አረ ጨከነ",
"ማንኛውም ህዝብ ከፍ አለ ደረጀ ላይ ኖረ ውክልና አወቀ አለ",
"አንድ ጊዜ ላይ አየ ፈራ አለ",
"ምናገባን ታድያ እኛ",
"ወደደ ሳበ ሳሳ ተጨነቀ እንኳን ሰላም መጣ ድጋሚ መልካም አዲስ አመት",
"ክርስትያን ታደለ የቁጭ አለ ተታለለ ፕለቲክኞች ሁሉ ፈራ አብይ አህመድ አይነት ጫት ተራ ኡስታዞችን በፓለቲካ ጢባ ጢቤ ተጫወተ ጠበቀ ቀለለ",
"ራስ እናሰተዳድራለን አለ አቋም ግልጽ ተደረገ ስለተናገርን፤ ድምጽ ከፈ ተደረገ ተናገረ ብቻ ተሳካ ቻለ አይደለም፡፡ ኢዜማ ይሄንን ውን ተደረገ ታታ ጀመረ",
"ትግራዋይ ግፍ አሰረ ሁሉ ድምጽ ሰማ ነግበኔ አለ ኖረ",
"ሀገር ቴክኖሎጂ እድገት ምክንያት እርስ ቈረጠ ድጋፍ ቅንነት ሁሌም ገረመ",
"ውድ ኦስማን፤ ስለ አየ ልብ እናመሰግናለን፤ ሰራ እንገኛለን፡፡",
"አቦ ናደ ምን ድርግ አንተ ፍቅር ሰራዊት",
"ወዬዬ ያ እሱ ሰራ ነገር ጠቀመ ቴክኖሎጂ የሰይጣነው አለ",
"ነብስ ማረ እግዚአብሄር ቤተሰብ መጽናናትን ሰጠ",
"ጤና ሰጠ መልካም ሳምንት",
"ይህ ደነቀ ነው",
"ይህ ሙሉ ኢህገመንግስታዊ ነው አለ ድምዳሜ ሰጠ ሳይሆን፥ ጥያቄ ግን እንደሚያስነሱ ግልጽ ነው ሌላ ጥያቄ የሚያስነሱ ጉዳይ",
"ጀብደኛ ነው አከከ አኒወይዝ ጊዜ ሄደ ነው ስራ ላይ ይህ ትኩረታችሁ ካድሬዎቻችሁን ተጠነቀቀ",
"ዋሽንግተን ዲሲ ዛሬ እለት ሞጣ ጉዳይ በኢትዮጲያ ኤምባሲ በፈርስት ሂጅራ ተዘጋጀ ዝግጅት",
"ጀግና ኢትዮጵያዊ ሁሌም እናንተ ጋረ ነው",
"ብልጽግና ፓርቲ አፋን ኦሮሞ ተረጐመ ነው",
"ይህ ፊት ተከናወነ የኃጢያት ማንነት ሁልጊዜ ሰውነት ውስጥ ኖረ",
"ፍትህ ጐደለ ግፈኛ እና አንባገነን ተደላደለ ሹመት ላይ ሹመት ተዳበለ፡፡ በደለ ሾመ ለውጥ ደጋፊ ተጎሸመ ገደለ ሸለመ",
"ሀዋሳ ከተማ ድሬዳዋ ከነማ ቀጥታ ውጤት ገለጸ",
"ኢትዮጵያ ፈጠረ ሄደ ልክ ነበረ ለመስተካከልም ፍቃደኛ ሆነ አወቀ ይህ ፈረሰ ምክንያታዊ ውጤት ነው",
"ሰራዊት ጌታ እግዚአብሄር ፈጠረ ሆይ እባክህ ዘረኛ ተንኮለኛ እድገት ፈለገ ስደት ድህነት ምክናያት ተደረገ ተደረገ አለ ፖለቲካ ጎጠኞች ውብ ኢትዮጵያ",
"አሰበ ላቀ እያደረክልኛ አለ በለጠ ተመሰገነ",
"አቤት ጥርስ ንዴት አማረ እኮ",
"ይቅርታ ተደረገ ለመደ",
"ሰው ደከመ ይጥላልእግዚአብሔር ግን ተሸከመ",
"አቋም አለ ሁሌም ወደቀ ነው ለብ አለ ነገር ወይ ወጣ ወይ ተፋ ነገር ነው",
"መንግስት እኛ ዞረ",
"ትንቢተ ኢሳይያስ ፊተኛው ነገር አታስተውሉ፥ ጥንት ነገር ሳበ እነሆ፥ አዲስ ነገር አደርጋለህ፤ እሱ አሁን ይበቅላል፥ እናንተ አታውቁትምን",
"ከፍተኛ ሊግ አራተኛ ሳምንት ውጤት ምድብ እሁድ ታህሳስ ቀን ለገጣፎ ለገዳዲ ወልዲያ ደሴ ከተማ ኤሌክትሪክ ሰ/ሸ/ደ/ብርሀን ደደቢት",
"ይሄ ስድብ ሆነ ለእንዳንቺ አይነት ደደብ ሚሰጥ መልስ ነው",
"ማንነት አፈረ ግም አለፈ ጊዜ ጉራጌነቱን ሸፈነ ብርሀን ነጋ ተማረ ቢሾፍቱ ናዝሬት ነው አለ የት ወለደ ደበቀ አረገ ጥረት ስልጤዎች ንዴት ተመለከተ ሆነ ለወጠ አለ",
"በረታ መራ አብቹ ሁልጊዜም አንተ መራ ጋረ ሆነ ኢኮኖሚ ይህ ሳይንስ እንዲሁም አካባቢ ወንድም እህት አገር ጋረ ሆነ አመነ",
"አሜሪካ ውጭ ጉዳይ ቢሮ ኢትዮጵያ አለ ዜጋ ፓስፖርታችሁን ሰረቀ ተጠነቀቀ አለ",
"እንኳን ሳተ የሚያስብል ነው ቆንጆ ተደረገ ነው ተጫወተ ዩቱብ ላይ ጫነ ደገመ አየ አለ ነበር አየ ቀረበ ጊዜ",
"አነሰ ተናገረ ቻለ ትነኝጠግርእበ ዴንእ ጓደኛ ነው ኝሩገን ኔባ ለስ",
"ተገኘ መሰለ ክፍተት ሙሉ እንደ ጠራ ድል ጠቀመ ሰአት ተቀበለ ኋላ አለ",
"ህወሓት ፊት መሬት ወረራ ነጻ ነበር ራስ ኦሮምያ መራ ነበር ዘረፈ አሁን ያ ነው",
"ተገኘ ተቻለ ቆንጆ ነው",
"እህት መቅዲ ይህ አባት ገጠመ ፈተና በቃ አወቀ ከተማ ትራንስፖርት ቸገረ አለ አደራ ላከ ገንዘብ መሸ ፈለገ ደረሰ እውነት ጣም ልብ",
"ቁምነገር የሌለው፥ ዝም አለ የሚያወራ፥ ከንቱ ውዕቱ",
"ዳዊት አንድ ነገር ጠየቀ ኦሮሞ ይህ ያህል ሰራዊት ሰለጠነ አብይ አማራ ገንዘብ ጠቀመ ነው ነገ ወሎ ወረረ አሰበዋል ምን ነገረ",
"መሰረተ አመት ቈጠረ አዋሽ ባንክ ነገ ጥር አዲስ አበባ ሦሰት ወለድ ነጻ አገልግሎት ብቻ ሰጠ ቅርንጫፍ ከፈተ ሆነ አወቀ",
"ደነባ ዶሎ አለ ማህበረሰብ ራስ አውሬ ጨከነ ነውምስኪን ድሀ ማረ ታክሲ ሸቀጥ ገዛ እጥፍ ከፈለ ተደረገ ደነበረ ማረ ራስ",
"የእምቢተኝንት ትግል አስቸኳይ ጀመረ ፈጠረ ከሸፈ አብይ ስርአት ፈረሰ ተደረገ ትግል ጠነከረ ቀጠለ",
"አሁን ተደረገ አለ ግልጽ ዘር ጠፋ ዘመቻ ነው ዘር ጠፋ አንድ ግለሰብ ማንነት ምክንያት ገደለ ጀመረ ነው ኮፊ አና",
"ጀመረ እውነት ዘገበ የጋዜጠኝነትን ሞራላዊ ግዴታ ወጣ ይህ አየ ሌላ ይህ ማረ ጠበቀ ፕሬስ ነጻነት ከበረ ተባለ",
"ዱላ ጨበጠ ሰው ገደለ መንገድ ዘጋ እልፍ ነጻ ወጣ አእላፉን መንጋ አንቀጠቀጠው እስክንድር ነጋ",
"ደነቀ መስህቦች አባያ ጫሞ ሀይቅ መካከል የእግዜር ድልድይ በደኝነት አስቀመጠ በደርና ደር እግር ኳስ ተመለከተ መሰለ ተፈጥሮ የተቻሩት የመልካዓምድር",
"ትንታኔ ጠላ ደገመ ጸሎት ደገመ አንድ ቃል መዘህ ምን አለ ነው አለ መለሰ",
"ያ ክልል ምክር ቤት እና ምርጫ ቦርድ እኩል አሻችዋለሁ",
"መራ ነገራ ኤርትራ ተመለከተ የተናገረዉ ስህተት ነዉ፡፡ መራ ግል አስተሳሰብ ነዉ ያንፀባረቀዉ ይህ እንጂ ተደማጭነት ያለው ግለሰብ ሆነ ጥንቃቄ ተደረገ ነበረ",
"አበረ ሰራ ነዉ ያለው አሁን ራስ ዩኒቨርስቲ ዉስጥ ያለው ግድያ መንግስት ከለላ ሠቶአቸዉ ነዉ አረግ አለ እስቲ ነገረ",
"እና ተግባባ ምን ሆነ ነጻ ጋዜጠኛ ነው አለ ለመጀመርታ ጋዜጠኛ ሆነ ነጻ አለ እንዴ",
"ኦቦ ዳውድ ኢብሳ ኦነግ ላይ ኢህአዴግ ነዛ ፕሮፓጋንዳ ኢትዮጵያ ህዝብ ስለ ድርጅት ሳተ ግንዛቤ ኖረ ተደረገ ጋዜጠኛ ጭምር እንደሚፈሩዋቸው ገለጸ ሙሉ",
"አየ ምህዳር ነውእኛ እርስ እርስ በላ ቁጥር ሀገር በቀል ድንበር ተሻገረ በዘበዘ በለጠ ገለጸ ሆነ የተዋረድ ኢእኩልነትን አየ እሱ ጋራ",
"ዝምተኛ ልብ ምን ሆነ ቋንቋ",
"ባህል መሰረት ተደረገ ገለጸ አለ ገለጸ ደበነ ኢመደበኛ ሆነ ስርዓታት ስር ሰደደ ጐላ ሊይታዩ ቻለ የጎንዮሽ ኢእኩልነት አብላጫውን ፖለቲካ ንቅናቄ",
"ጻፈ ሁሉ ነው ጠላ ጥንብ አላህ ስራ ሰጠ ዘረኛ ወራዳ",
"ታሪክ ሰራ መለፍ ጠራ ነው አንቺ ዳግም ፀሀይቱ ነሳ ጀግና",
"ደረሰ ተከበረ ወረረ ዳግማዊት ሞገስ ጣፈ ተመንዝ ሰው ጉዳዪ መንገድ ወይ በግ",
"አሜን አሜን ሚኪ እንኳን ደረሰ ወንድም",
"አገር ውጭ ያሉትሳእንደውም አነሰ ነው የባሰባቸውእርስ እርስ ሰፈር ከፈለ",
"ይሄ አጋሰስ ራስ ተከላከለ አለ ኤርትራ፣ አርሲ ከምንትስ ተሻለ ኤርትራ አለ ግም አፍ ሲከፍት፣ ሆነ ንጹህ",
"ላይ አለ ልምድ ግን ውህደት ቡድን ጠቀመ",
"አለ ጣት ራስ መከረ ሰው ክልል መጣ በጠበጠ ሞከረ ወረኛ ሴረኛ አማራ ሙስሊም ክርስቲያን ሴራቹ ገባ መሰለ ዛሬ ሰካ ጠፋ ይህ መርዝ",
"እንዲህ ጤናማ እና ትክክለኛ ነገር ተናገረ ማረ ሁላችንም ዩኒቨርሲቲ አለ ዘር ጠየቀ ልብ ጓደና ፈራ ዶርም ዲፖርትመንት ወይም ኳስ ግኝ*",
"እረ አሰበ ፈለገ እኔ ጥያቄ ምን ሚመክረው አንድ ወደደ ነበረ እንዴ",
"መልስ እ/ር ፍቅር ሆነ ተገደደ ገዛ አምላክ አደለ ነገር ግን በጎ ሆነ መጥፎ ተወ ደግ ያዘ ተለያየ ግዜ አስተማረ ይህ ክፉ ነገር",
"ታህሳስ በርካታ ወጣት ለየ ሳይንስ ፈጠራ ውጤት በረከተ ነው፡፡ ወደቀ እቃ የዲ ህትመት ማሽን ቴሌስኮፕ መሳሪያ አዘጋጅ ወጣ ፈጠራ",
"ዜጋ ሞት ቀን ተቀን ዜና ሚሆንብሽ ሀገር ነገ ማን ሆነ ሞተ",
"ኢትዮጵያዊ ወገን ሁሉ ልብ ተደረገ መቀሌ የመሸጉት ወያኔዎች ጠበቀ ጮቤ ረግጠዋል፣ ሰርግ ምላሽ ሆነ ሰሞን አቶ ማ መገረሳ የፓለቲካ እርምጃ",
"ህዳር አክሱም ጽዮን እመቤት ጽላት ገባ አመታዊ ታላቅ በአል ነው በዚህች እለት ታቦተ ጽዮን ነበረ ድንኳን ወጣ ማን ካህን ተሸከመ ተአምር አብርሀ አጽብሀ ሰራ",
"ሰበሰበ ቻለ ይሄ በላይ አካል የሚባለዉ አቶ ጌታቸው ሰፋ ሆነ ቀረ",
"የኢህአዴግ ውህደት ጽንፈኛ ብሔርተኝነትን ገታ ሆነ ክፍል አሀዱ መድረክ",
"ፓርቲ መረጠ ስልጣን ላይ አለ የአአ መስተዳደርም ሰው ተናገረ ሰበሰበ ደረጀ ተደራጀ ፓርቲ የማቆቆም መብት ነው ነፈገ አለ እሄ ደገመ ህገወጥነት ብቻ",
"አየ ልደት አያሌው ፖለቲካ ተማረ ሰው ሰበሰበ ሆነ አለ አለ እሱ ተማረ እንዴ ማትሪክ ደቅ አለ ታክሲ ሢሾፍር ነበረ እንዴ ነው",
"ሌባ ዘረፈ ሰዶማዊ ዘረኛ ወያኔ ጋረ ኖረ ቀረ ተባለ ጸሀይ ወጣለን አለ ነው",
"ምን ተደረገ ግን ሰሊ ጋሽ ጸጋ አየ ሀፍረት ምን ሸመቀቀ ምን ውለታ ቢስነቴን ገለጸ ምን ጋሽ ጸጋ አለ ዕዳክ ነው ነፍስ ሰላም አረፈ",
"ብያለው ልጀ ፈራ ኣይዞክ ምንልክ ከጎንህ ሆነ ምን",
"እሱንኮ ነው ስህተት ነበረ አለ",
"ውድ ደንበኛችን፤ እባክዎ አገልግሎት ቁጥር መልእክት ይላኩልን፤ እናይልዎታለን፡፡ ተመሰገነ",
"ሰው በላ አውሬ መርዝ ደሞ አፍ አለ አለ ታወራላህ ጭራቅ ዲያቢሎስ ሴይጣናም",
"አለ ብዙ አትገረምየኢዜማም ብዙ አማራ ነው የሚሆነውይልቅ ብዙ ፎከረ ፖሊሲ አማራጭ አየ እኔ",
"እውነት ፍቃድ ምናምን ተሰጥቶትታል ጥር ላይ ቀረበ",
"ጠንካራ ሆነ ሽንኩርት እንጂ ወንድ ልጅ እንዳያስለቅሳቹ",
"ጠማ ብሄራዊ ደህንነት መከረ ማን ሆነ ጠየቀ",
"ኤጄቶ አለ ወንጀል አሰረ ተገኘ ምሁር ጥየቃ ወደ ሀዋሳ አረመ ሄደ ነበረ ልጅ ከለከለ ከተማ ፖሊስ ደበደበ በመነሀሪያ ፖሊስ ጣቢያ",
"አመነ ልጅ አባት አባት ደስታ ምክንያት አለ ጥበበኛ ልጅ ኖረ ንዴት ደስ አለ ፡፡ ይህ አባት እና እናት ደስታ ሰጠ ወለደ ሴት ደስ አለ ምሳሌ",
"ኢትዮጵያዊ ወጣት ምሁር ታላቅ ስልጣኔ ምድር አፋር ተገኘ ሚልኒየም አዳራሽ በአፋን ኦሮሞ ደመቀ ነውበሚገርም ሁኔታ ላይ ሀገር ውስጥ ቋንቋ ተናገረ",
"እውነት ነው ክብር ሰፋ ድንግል ማርያም ልጅ",
"ከተቀላቀለኮ ቈየ ለየ ፈጠረ ላከ አሪፍ እይታ ነው",
"በነ ሳለ አብረሀ ጊዜ ተደረገ ተራ በቀል ሹፌርና ቁልፍ ቀማ ቢሮ አሸገ ውሸት ህግ አንድ ሌሊት ወጣ ስር ቤት",
"የጀዋር እና አብይ ደገፈ እውቀታቹ ስድብ ነው ገረመ",
"ሁሉ ዲስኩር የት ደረሰ ውድ ዶር ቴድሮስ አዳኖም",
"ከዛስ ቀጣይ ምርጫ ብቻ ተወዳደረ ነው ምን ሳበ ሆነ",
"አበረ የምናዬው ሆነ ማን አለቀሰ ኖረ",
"ሸኖ ላይ ህዝብ ታግቷል በድንገት ከበቤቱ ወጣ ሰው አለም ዝግጅት ብርድ ላይ አደረ ተገደደ ጊዜ ወደጌ ዜጋ መሰላ ወጣ ገባ ነገር ጥያቄውስጥ ገባ",
"አላህ ሆይ ገባ ጠራ ትዳር ገባ ጠራ ፍቅር ጠራ ልጅ አመመ ፈወሰ ዳነ ቸገረ ራበ ሀላል ርዝቅ ተገኘ ደስታ አጣ ደስታ ሰላም ነፈገ ሰላም ለመነ አላሁመ አሚንንንን",
"ነፍስ ስጋ ለቀቀ የአዱ ገነት ልጅ ሆነ ራቀ ነው እንዴ ደገመ አዱ ገነት ወከለ ነው እንዴ ሚንስትር ሆነ ሰለቀ አማራ ህዝብ ወከለ እንጅ",
"ለፉቶ መና",
"አንተ ራስ ደህና አደረ ፈተና ደረሰ ተጠና",
"የኦነግጦር ገታ የደንቢዶሎ ዩንቨርስቲ አማራ ማረ ዝርዝር ገለጸ እንኳን መንግስት ተባለ ቀረ አማራ አክቲቪስቶችም",
"ይህ ወቅት ዩኒቨርሲቲ ገባ ሊቢያ እኩል ሰደደ መረጠ",
"አቤል ብርሀን ወይን ልጅ ዛሬ አስቸኳይ ተጠነቀቀ ሰጠ የባህርዳሩ ገረመ አመነ",
"ተመሰገነ ጋዜጠኛ ኤልያስ መሰረት",
"ኢቲሳ በሳ ፣የወንጌል ገበሬ፣ሐዋርያው መነኩሴ ጻድቅ አቡነ ተክለ ሀይማኖት በረከት ረድኤት አመነ ላይ አደረ አሜን",
"ጽንፈኛ ትክክል ራስ ወዳድ ራስ ተመነ ተጠቃ ነው ህዝብ አለ ምን ሰራ ነገር ለም /ጅብነት ይህ አለ ሀገር አለ ሰማ",
"ሁሌም አላህ ሀቅ ጋረ ነዉ",
"ድንቅ ኢትዮጵያ ህዝብ ሀብት ነክ ብሬ በረታ ፈነዳ በተነ ወንድም ከጎንህ ነው ጊዜ ስራ ነው",
"አየ ቻይና ተቀበለ አለ",
"ውስጥ አቅም አለ ስድብ ቀና አለ ሰማ",
"ዛሬ አማራ ክልል እንፆክያ ወረዳ ደረሰ መኪና አደጋ ሰው ላይ ሞት አደጋ ደረሰ ሰው ላይ ደገመ ከባድ ቀላል ጉዳት ደረሰ መኪና አደጋ እጅግ ጣም",
"ተመጻደቀ አለ ለእኔ፣ አወቀ አጉል ሚዛናዊ ሆነ ወይም ሰማእት መሰለ አየ",
"እግዚአብሄር በዛ ባረከ እኔ ቆንጆ ቃለሂወት",
"እውነት ሆነ ያአገራችንን",
"ደደብ ንፍጥ ጭንቅላት ብቻ",
"ተመቸ ተመቸ ሀብታም ሆነ ሆነ ሰላትን አላህ ገራ ከዚውጭ ላቀ ደስታ ሰላም ተገኘ ነገር ለም",
"እድል ተገኘ ሰአት እና ገጠመ ሁሉ አዳዲ ሰው ፈራ በእርግጠኝነት አንድ ቀን ጠቀመ",
"አማራ ህልውና ኢትዮጵያ ልእልና አለ መራ መልእክት ውይይት አትላንታ ጆርጅያ ተካሂዷል፡፡",
"ምናልባትም ግል ትውስታውን ጻፈ ሻ ሰው ይህ መጽሀፍ አየ ጥቅም ላይ ዋለ ቻለ አለ እምነት አለ ተረፈ መጽሀፍ አነበበ ነባ ዘንድ",
"እስኪ እንደዛ ተናገረ ቪዲዮ ገራ ገረመ እኮ ነው",
"ጀዋር ኦሮሞ ነጻ ወጣ የቄሮ መራ ነው አለ ቡፋህን ጠራራ ጸሀይ ደለቅክ ሀቅ ግን ኦሮሞ ህዝብ ጮኸ ነበረ አሁን ነበር አሁን ወድያ ኳለ ብየሃለሁ",
"ተስፋ በሌለበት፣ አብርሀ ተስፋ አመነ ብዙ ህዝብ አባት ሮሜ አዲስ መት",
"ፈጠረ መጽሀፍ ቅዱስ ውስጥ ተካተተ የእስራኤላውና ታሪክ በየነ ሞከረ ትንሽ አይሸግርም ነሳ ሆነ መታ አነሰ",
"ጥርሳም",
"ግንቦት አሁን ኢዜማ ፖርቲ ኢህአዴግ አሁን ብልጽግና ፖርቲ ሁለት ፀረ አዲስ አበባ ፀረ ኦርቶዶክስ ፀረ አማራ ነው ይሄ ሀቅ ነው አለቀ ሰአት ስም እየቀያያሩ መጣ",
"ተራ ስዎች",
"ሸገርን ተዋበ ፕሮጀት ስር፣ ወንዝ ጸዳ ወንዝ አከመ አለ ገለጸ ጣም ተመቸ ሺ የሚቆጣሩ ስራ ድል መፈጣሩን ሰማ ተደሰተ ይህ ከፕሚ",
"ህዝባዊ ስብሰባ ኢትዮጵያ ዜጋ ማህበራዊ ፍትህ ጥር ወቅታዊ ጉዳይ ዙሪያ የፓርቲዉ ከፍተኛ መራ ተገኘ ህዝባዊ ውይይት ኪሎ በሚገኘዉ ስብሰባ መዕከል አካሄደ",
"ሰለቸ ግን ዲሞክራሲ ዲሞክራሲ አለ ሰው አገር አለቀሰ ለዛውም፡",
"ረዥም እድሜ ሰጠ ጊዜ ጉዳይ እንጂ ይሄ ነገር ውን ሆነ ቀረ",
"ጣም ደደብ ነው ፡፡ ይቅርታ",
"ሺ ሼፉ ከኮመንትህ ተነሳ አንተ ገመተ ረዳ ወይን ከረከረ አመነ ቅእት ስድብ ሚደበቅ ጭንጋፍ ሽል ሆነ ነው ምገምተወ",
"በላ በገነ ነው",
"የነ ጥያቄ ግን ከዚ ሁሉ ወቀሰ የት የደርጅቶቹ ወከለ ተገኘ ግልጽ መድረክ ተዘጋጀ ምን ፈለገ ነው",
"ወደ እናት አገር መለሰ",
"ተከበረ የፊስ ቡክ ወደደ እንኳን ለፍርንጆቹ አዲስ አመት ሰላም ደረሰ አዲስ አመት ሰላም አንድነት ፍቅር ሁሉ ላይ ብልጽግና ሆነ",
"አለ ሲሳይ እንግሊዝ ሀገር ተገኘ ውጭ ሀገር ተወዳጀ አሰተባብሮ ስለ ገታ አማራ ድምጽ ሰማ",
"ተለያየ ጊዜ ጠየቀ ሠወችን ተከታትየዋለሁ ጣም ወረደ የጋዜጠኝነት ሙያ አለ ቀጠረ እንጅ ሌላ አየ ሆዳም ጋዜጠኝ",
"ጠቀለለ ሚንስትሩ ኦሮሚያ ክልላዊ መንግስት ርዕሰመስተዳድር ጋረ ቦረና ዘለቀ ተደረገ ደማቅ አቀባበል ሁሉ ህዝብ ጋረ ገባ ተገኛኘ እና ተወያይተው",
"ሰላም መልክተኝነት መለኮታዊ ጠራ ሆነ ተሳካ እርግጠኛ ላይ ነው",
"ሆነ ፍጹም ፈቀደ አለ ስልጣን ያዘ በለው፣ ቈረጠ ፈለጠ አለ ስልጣን ላይ ወጣ ለየ ትርምስ ከተተ አጠራጠረ",
"ኧረ ተይ ነካ ኮሪደር ላይ ወጣ ተወራ ኔትወርክ ዘጋ",
"ደረቅ ወደብ ጀመረ ምእራፍ አገልግሎት ዝግጁ ሆነ ኢትዮጵያ ባህር ትራንስፖርት ሎጀስቲክስ አገልግሎት ድርጅት ገለጸ",
"ሚሊዮን ህዝብ አጣ ፈንታ ጥቂት ውር ውር አለ ጎሳ ክርር እብደት አይወሰንምኦ ኤም ኤንሸኔ ደፈጣ ውጊያ ኦሮሚያ ሲኢያደርግ እነ ጃዋር ለውጥ መጣ ነጻነት ከተማ ሆነ",
"ሀmeme ስጋ ተዘልዝለው ጨረሰዋል አሁን ተራ በየቲቪው ቀረበ ቅሌት መከናነብ",
"ሰው ሆነ ቀደመ እኔ ሰው ነው ብሄር መጣ ምርጫ ነው",
"ይሄ ጅማሬው ነውገና ድንቅ ታሪክ ሰራ",
"ጥፋተኛ በዳይ ተቀመጠ ተበዳይ ቄስ ሽማግሌ ፓስተር ጭምር እየተላከባቸዉ ይቅርታ ጠየቀ ተባለ አገር ኢትዮጵያ ብቻ ሆነ አለባትትናንት ይህንን አየ ዛሬ እያየንነውአስተዋዮችና",
"ህግ ፍጹም ነው፤ ነፍስ ይመልሳል፤ እግዚአብሄር ምስክር አመነ ነው፤ ህጻን ጠቢብ /መዝ ፲፱፯/ ኢትዮጵያ ሰላም በዛ",
"አብይ ላከ መንግስት አለቃ አፍንጫ ካልተገደደ፣ ምርጫ ሄደ ፍላጎት አለ ፍትሀዊ ተሳተፈ ምርጫ ተደረገ ወጤቱ ከሁኑ አወቀ ግዜ ገዛ እንጂ በዛ",
"ኢሳያስ አፈወርቅ የጀነራል ሰዓረን ገደለ በኣስቸኲይ ፈታ አብይ አህመድ ትእዛዝ ሰጠ ጌታ ሰፋ ማህደር ቁ/የተወሰደ",
"እንኳን ደረሰ ታላቅ አዘዘ ከምጽዋት በለጠ እኛ ብርቱ",
"ኢምፔሪያሊስቱ ታሜ ምን ማድበስበስ የለ፣ ሀቅ ሀቅ ቁጭ ብዙ ሰው የታሜን ትክክለኛነት ዘገየ ነው ረዳ",
"ለኢትዮጱያ ህዝብ አለ ተጥዶ አደረ መራ አለ እና ልል አለ ናደ አለ ሁላ ህዝብ ክብር አለ ይኮምታል",
"ረዳ ተመሰገነ",
"እሱ እኛ ጀግና ጀግና ነበር ሱነይሳ ምን ቀጠለ ሞከረ ፈለገ ማን ነው ይላ ጥበልገመበ ንላፕሮውአ ንህይ",
"ኔቱ ግን ምንድነው ሆነ አለ ደወለ ተወራ ስቃይ ሆኖል",
"ኦሮሞ ነጻ ወጣ ግንባር ኦነግ ኦሮሞ ፌዴራሊስት ኮንግረስ ኦፌኮ ኦሮሞ ብሄራዊ ፓርቲ ኦብፓ ጥምረት ለመመሰረት ስምምነት ደረሰ ድል ዘመን ድል ነው ድል",
"አማርኛ ግን ምን እንዲህ ስድብ ብቻ ጥቅም ላይ ዋለ መታ ሆነ ሞራል ለበሰ",
"እ/ር በበሀሪው ረቂቅ ነው ነፈሰ ነው አይታይም፣ ረቂቅነት ወደር አለ ከንፋስ፣ ከመለአክት፣ ከነብሳችንም በለጠ ረቀቀ ነው መልአክት ረቂቅነት አንድ አንድ ውስጥ",
"ህዝብ ሀገር ህልውና ተባለ ፋኖ አማራ ልዩ ሀይል በዓስቸካይ መለሰ ቃመ አለበትእኔ ይህ አላማ ረዳ እርሶስ ይህ ሆነ ግን ላይ ታታ",
"ኬር ይህ ሰላም ይህ ሀገር",
"ደገመ አንተ የትኛው ፋብሪካ መራ ወጣ ደደብ ነው ጽንፈኛ ብሄርተኞች ህሊና እና ሰውነት ሞራል ወደ ገማ አረንቋ ያዘ ወረደ አንተ",
"ታህሳስ ፣/ ወደ ሀገር ውስጥ ገባ ነደደ ስርጭት ቈጠረ ጠቀለለ ሚኒስትር መራ ኮሚቴ ቆመ ሰማ",
"ጠፋ ሆነ ሞተ ሞተ ልሳሰመደይ ውዶረበ መነም እኔ ምን ተናገረ ርበነ ቅውአ ንትንዴ ይቬርሃ",
"ክህደት ጎሳ ሀገር በለጠ አዎን ያ ተደረገ",
"ትምህርት ተጠነቀቀ ጠራ ደረጃ ደረሰ አለ ነገ ተስፋ ሰንቆ ዩኒቨርሲቲ ገባ ተማረ ድንገት ጠለፈ ራስ ጫካ ውስጥ ተገኘ ሰማ ስሜት ጠቀለለ ሚኒስትር ጨከነ",
"ጻፈ ታሪክ ህጻን ት/ቤትን አንድ ሁለት መለሰ በክላስተር ቦምብ ደበደበ መራ እና ድርጊት እንኳን ውግዝ ተጨማሪ ክላስተር ቦምብ ገዛ ወጣ",
"ድል እውነተኛ ዲሞክራሲ",
"አንቺ ልጅ እረ ተይ ግን ተይ ያ ጁአናም አለ እኛ ሰፈርኛ ሆነ ሰው ሚስት ስያሜ ነው ነቀርሳ",
"እስኪ አንድ ሴት ጀግና ጠራ ተባለ ሁሉ ተስማማ አንድ ጠራ አትችይም የሚኒሊክ ቤተመንግስት እና አ/አ ውስጥ ምን ጣይቱ እና ሚኒሊክ",
"ከፍታ ተረት ወዲያ ተወ ለማይጨበረበር እውነተኛ ምርጫ ተዘጋጀ መተግበር ዝግጁ ሆነ ገባ ተከናወነ ከፈተ እሱ ነው፡፡",
"ዝንጀሮ ቆንጆ አለ በኢህአዴግና ብልጽግና አለ ልዩነት በኢማሌዲህና ኢሰፓ ነበረ ልዩነት እይነት ነው",
"እንኳን ደረሰ ስለ ጽዮን ዝም አለለ ኢሳ ድንግል ማርያም ህያው ሁሉ ደስታ ነው ምድር ሁሉ ደስታ ጽዮን ተራራ ነው መዝ ተባለ ጻፈ",
"ጀመረ እንኳን ደስ አለ ምን አይነት ችግር ውስጥ ሆነ ተለያየ መልክ ተበላሸ ቈሸሸ ነበረ ግንባር አዲስ ብልጽግና ፓርቲ አደሰ",
"ሺ አከከ ቀመር አነሰ ገና ሸለለ ወላፈን በላ",
"ከበደ እንዴ አለ ነው",
"ዩክሬን አውሮፕላን ስህተት በሚሳይል መታ ኢራን አመነ ጉዳይ ተነገረ አያቶላ አሊ ኻሚኒ ጸጥታ ጥበቃ ባለስልጣን ተደረገ ውይይት ኋላ ረዳ ይፋ ሆነ",
"ራስ ጋረ ጠላ እንዲህ አለ አስነዋሪ ንግግር ንዴት አፍ ወጣ",
"ራስ ቀን ጊዜ ምክር ፈለገ ፉዞ ቀን ጊዜ መከረ አለ ምን ተባለ",
"thiopiaየመንግስት ዋነኛ ስራ ዜጋ ደህንነት ጠበቀ ነዉ ዛሬ በሁዋላ አንድ ተማረ ሞተ አለ እኛ",
"ሳንጅዬ ህይወት ኑሮ ሆነ ረገጠ እለት እሁድ ታህሳስ ታላቅ ቅዱስ ጊዮርጊስ መቐለ እንደርታ ፍጹም ሊያመልጦት ገባ ታሪካዊ ጨዋታ እኔ ትኬት ቈረጠ እርሶስ",
"እንኳዕ ናብ አክሱም ፅዬን ህዳር ፅዬን ሰላ ኣብፀሓና ናይ ኣዴና ቕድስቲ ድንግል ማርያም ጸሎት በረከት ምሳ ይኹንኣሜን",
"የኢዜማ ደጋፊ ሰሞን ማ መገርሳ ለቀቀ አየ ደስታ በር ቆለጥ ሆነ ነው",
"ሰራ እርምጃ ምክንያት ቤተሰብ ደም ፈሰሰ ፡፡ ድርጊት ዘላለም ስቃይ ሰማ ፡፡ ፈሰሰ እንባ ወደ ደም ለወጠ",
"ጻድቅ መታሰቢያ በረከት ነው",
"መሰረታዊ ጥያቄ እስካርፉ ስንት ብር ወጣ ሆነ",
"ማ መገርሳ መድረክ ላይ ሆነ ውህደት አስፈላጊ አይደለም፤ ደመረ እሳቤ አያስኬድም አለ አማራጭ አቶ አየ ደንደአ",
"ፈረንጅ አስርት ጀመረ ፊት ነበረ ፈረንጅ አገር ትምህርት መልስ አዲስ ስራ ከዛ ጠራ ስራ አለም ጉዞ ተኛ ስራ ላይ፣ ሁለት ቆጃንጅዬ ልጅ ኋላ ተመሰገነ ግን ንዴት ነው",
"እንኳን እመቤት ለቅድስተ ቅዱስ ለንጽህተ ንጽኋን ጽዮን ማርያም አመታዊ ክብረ በአል ሰላም ደረሰ እመቤት ፍቅር ምልጃ ከሁላችን ጋረ ይህ አክሱም ጽዮን",
"ፎቶ አርበኛ",
"ሌላ ሙስሊም ህ/ሰብ ጥያቄ ያነገቡ በአል ከበረ ቦታ፣ መቃብር ቦታ መፈክር ደመቀ መዳረሻዉ ቀበሌ መስጊድ ሆነ ኢትዮጵያ ስም ከፍ",
"ውይ ቻለ ውይ መጣ ነው ግን አንቺ ደህና ነገር",
"ከኢዜማ ተሻለ ፖሊሲ አለ ለም አለ ኢትዮጵያ ተሻለ ህገመንስት አለ ሀገር ለም አለ ነበረ የወያኔ ካድሬዎች ነው እውስ",
"ለሌዎች መነዘረ ህይወት ትርጉም አለበ ነው",
"አባት አምላክ ቸርነት በዛ",
"ለማ መገርሳ ነገር ግራ ገባ ድርጂታዊ ሄደ ተከተለ ሆነ ጀርባ አለ ለማዎቅ ጋለ በትንሺም ሆነ የፌደራሊስቶችን ቀልብ ገዛ ማንኛውም ሁሉ",
"ደስ አለ ራስ ጉዳይ ራስ ይወያዩ",
"ጀመረ ሞተ ድርጅት ንዴት አለ ነው ስለዚ ጉዳይ አበለ እሚችሎው",
"ውሸት ነው አባት",
"ነገር ላይ እኔ ጌታ ፈቀደ አዲስ አመት ከች ወደ አገር ቤት",
"አንተ መርዝ ሰይጣን ሬሳ ጥንብ ዘረኛ ከብት ሰው በላ አውሬ",
"ነርስ ሽልም ያዘ ሞከረ ነበር ልያታይ ጥስው ዶረበ ጽርቅ ድንአ እሱ ጣም ጠራ ነበረ ውሰ ውቀበደተየ",
"ኦሮሞ ህዝብ ጥያቄ ፍትህ ነው እንዴ አማራ ለየ እንዴ እኩል ተጠቃሚነት ነው እንዴ ዲሞክራሲ ጥያቄ ነው እንዴ አኝዋኩም፣ሀመሩም ፣ሱርሚውም",
"እውነት ጥበብ",
"አመት ግፍ ድርጊት በዛ ያለአንድ ጥይት ስልጣን ቀማ አሁን ደገመ እነኚህን ድሀ ገበሬ ህጻን ሜዳ ገደል",
"ሴራ በአል ምክንያት ተደረገ ትውልደ ሀላባዎች አጋር ጋረ ሀዋሳ ከተማ ደማቅ ሁኔታ ተከብሯል፡፡",
"እዝጊ ይሓግዝካ እምበር፡ እዚኣስ ከባድ እያ",
"ዛሬ ገባ አለ ገባ ቻለ አለ ነው",
"ደመረ ሀሳብ ጨረሰ ነው ተባለ ነው የት ሄደ ፈነዳ",
"የኢዜማን ቴሌግራም ቻናል ተከተለ ፖሊሲ ደንብ ተዘጋጀ እና እውቀት ላይ መሰረተ ነው የሃገሪቷ ችግር ስሜት ነዳ ፈታ",
"ሴት ደህንነት እንደ ዜጋ ቅድሚያ ይልተሰጠ ችግኝ ያህል ግድ ያልሰጠው፤ከአሸባሪ እና ገታ ጠበቀ ቻለ መንግስት ምን አይነት ተሳተፈ ኢኮኖሚያዊ ብልጽግና ነው",
"አንተ ልዩ መራ ወደደ እውነት አንተ ኢትዮጵያ በረከት ነክ",
"ሰካ ትክክለኛ እና ሀቀኛ መራ ተገኘ ብቻ ነዉ ህዝብ ደበቀ ሩቅ እና ቅርብ አለ ገራ ምስጥራዊ ግንኝነት እና ስምምነት ተደረገ ቆመ አለ",
"ወለጋ ላይ አስፓልት ሰራ ለኦነግ ጫማ ገዛ ማጫመት ነው መለስ ዜናዊ",
"በፍቄ ትርጉም ምንሼ ነው ግን ተመሰገነ ሞቅ ተደረገ ኮምፕሊመንቱ",
"እሱ ጣም ጠራ ነበረ ፅምድ ሽሳፍየ መልካም እንኳን ደስ አለ ውነ ምመህ ድባከ ምጣበ",
"እንኳን ጌታ አምላክ ብርሀን ልደት ሰላም በጤ አደረሰን/ረሳችሁ ፮ትንቢት ኢሳያስ ህንጻ ተወልዶልናልና፤ወንድ ልጅ ተስጥቶናልና፤ አለቅነት ጫንቃ ላይ ይሆናል፤ ስም ድንቅ",
"እሱ ጥውልውል አጼ ድሮ ስርአት አማረ ከዙፋንቸው ተከስተ አየ ልብ ቀጥ አለ",
"ደንብ እንጂ ዘረኛ ነው",
"ባለስልጣን መንገድ ድልድይ ፕሮጀክት ዛሬ አስመርቋል፡፡ መንገድ አጠቃላይ ርዝመት ኪሜ ሆነ ግንብ ቢሊዮን ብር ላይ ወጣ ተደርጓል፡፡",
"ላቀ ሰው ነው ህደ በሃርቬይ ዴንት አመነ ይላ ጥበልገመበ ንላፕሮውአ ንህይ",
"ልዩነት ሰርግ ምላሽ ሆነ ከፈለ ጥቅም ተመኘ ነው አናሳ አስተሳሰብ አለ ጐላ አየ ትንሽ ስብስብ ውስጥ ሆነ ሀገር አነሰ እነሱ",
"አማራ ሽንፊላ አጠበ ጠራ ተባለ ነበርእኛ ግን እኮ ዘፍዝፈን ነበር አጠበ በበረኪና እስክትበጣተሱ",
"ንዴት ነው ውድ መልካም እሁድ ተመኘ ደብረሊባኖስ",
"ሰበር ዜና ኢትዮጵያ ግብጽ እና ሱዳን መካከል ህዳሴ ግድብ ዙሪያ ተካሄደ ቈየ ስብሰባ በአመዛኙ ገባ ላይ ደረሰ ቀረ",
"እግዚአብሄር ዋለ ይስጥኝ ስድብ ጥቅም አየ ሀሳብ ሞገተ ተሻለ ኢትዮጵያ ዘላለም ኖረ",
"ትናንት ታላቅ ነበረ ዛሬ ግን",
"ውይ የኔጌታ ይቅርታ ስድብ መሰለ ሻረ አስር ደቂቃ ውስጥ ፎሮፎር ሆነ ተደረገ በጠበጠ ወጣ ሙያ ኖረ ነው ብይ እኮ ነው",
"ታኬ ጉቦ በላ ቀበሌ ሊቀመንበረስ መጣ ነው ፈረሰ ጉቦ በላ ደንብ ከበረ መጣ ነው ህግ ቀረበ ፈረሰ ገንዘብ የት ነው መጣ",
"ደሀ ስንት ደሀ ደም፣ ሰርክ አጠበ ፍርድ ቀረበ አለነ ፣ለምርጫ ላይ በቀለ ወያ ቈላ ሚስት ወለደ",
"ነው አየ አየ አየ ልላችይ ንሆሊ ሚራገስአ ሱእ ትባልናም ደህ ውነ ንማ ውገልፈሚየ ርከሞመ ሎጥቀ",
"ጥቂት መከራ ተቀበለ ኋላ ክርስቶስ ክርስቶስ ዘላለማዊ ክብር ጠራ ጥበብ ሁሉ አምላክ ራስ መለሰ ጽኑ ጽኑ ተደረገ እሱ ዘላለም ሀይል ይህ አሜን ጴጥሮስ",
"ቡና እንዲህም ተደረገ ነበር ኢትዮጵያ ቡና አገር ውስጥ አሰልጣኝ ብቃት እምነት አጣ ገለጸ",
"አንተ ልዩ ሰው እግዚአብሄር ዘመን ባረከ አለ ቻለ ይህ ብቻ ነው",
"ኢትዮ ቴሌኮም መላ አገር ዩኒቨርስቲ ተማረ አራት አማራ ኦሮሞ ወለደ ማረ ጠቀመ ተደረገ ሚሊየን ብር ድጋፍ መርሀ ግብር ይፋ አደረገ፡፡",
"ምን ዛገ ብቻ",
"ቀን ውስጥ እንዲህ አለ ስነምግባር ጐደለ ዜና ርእስ ጠቀመ ሁለተኛ ጊዜ ሆነ ነው ጠለምት ላይ በአጋቾች ገደለ ህጻን እንደ አንድ ተራ",
"ፍቅር እንዲህ ነው",
"ኢዜማ ሴት የኢዜማ ዞናል ሴት ስብሰባ አምስት ዞን አለ ከጋሞ፣ከወላይታ፣ከሰገን ሕዝቦች፣ከሀድያከካጠና እና ጎፋ ዞን ወጣ ሴት ወከለ ተገኘ ዛሬ",
"ዶ/ር ጸጋ አራርሳ፡ ግንባር አይዋሀድምአዲሱ ውህደት ምን ህጋዊ መሰረት አለ",
"እሾህ እሾህ ብዙ ሺ አመት ሞከረ ቆመ ቀረ",
"ይህ እውነት እናንተ አዘነ ነገር ግን ገና አየ ጊዜ አለ ሀሴት ተደረገ አመመ ደስታ ማን ከእርሶዎ ወሰደ ፡፡ በዚያን ቀን እኔ አንዳች ለመነ",
"ገባ አለ አናት ላይ ትምህርት ቤት ሰራ",
"እውነት ሆነ ነገር ካደ እንጂ ተወ",
"ምን አለ አወቀ",
"ጉድለት ቢያወሩት፣ ምን ይሄ ሆነ አለ ጠየቀ አለቀ መልስ ተገኘ እኔ ምን ላድርግ' አለ ተነሳ መሰለ እርካታ ምንጭ ግን ፍጹም ለም በረታ ወደደ",
"ማንኛዉም ኢትዮጵያዊ ድርጅት አባል ሆነ ቻለ ወንጀል ሰራ ፕ/ር መረራ ጉዲና የኦፌኮ ሊቀ ነበረ",
"ሰልፍ ምነው አቤት ሰልፍ ከበረ ነው ህግ እና ደንምብ ከበረ አይይይይ የብሽሽቅ ቦለቲካ ደሞ ክልል ሰላም",
"እስከ ድል ቀጠለ ድል ለዴሞክረሲና አዲስ አበቤ",
"በአዋልድ ስም አሰረ ሶስት አጋንንት ይህንን ሰው ዘለፋ ስቃይ ውስጥ በመንጽሔ ነበልባል ረገመ ሰይጣን ሰማ ወይም ጸለየ",
"እኔ እንዳንቺው ርግብ ኩስ ጣለ ሀብት ነው አለ ነገር እውነት ሆነ ኖረ እኔ አለ ልጥጥ ነበረ",
"አሜን አሜን አሜን ጄሪ ክብረት ሰጠ",
"እሱ ጓደኛ ነበረ ውሰ ውቀበደተየ እቅድ አካል ያዘ ምለደይአ ዜጊ ትሃርፍየ ንሁአ",
"ኦቦ ማን ገፋ ጽንፈኛ ተደረገ እኛ ነው ኢትዮ ዊኪሊክሶች እቺ ትንታኔ አሁን ፈገግ ተሰኘ አለ",
"ተባበረ መንግስት ድርጅት አመለካከት እና ሀሳብ ነጻ ያዘ ገለጸ መብት ልዩ ዘገበ ራፖርተር ሆነ ዴቪድ አየ ህዳር እስከ ቀን ኢትዮጵያ",
"እንዲህ እቅጭ እቅጩን ግልጽ አደባባይ ተነጋገረ ውሸት መደመር፣ ብልጽግና ምና ምን አል ቃል ደረደረ ችግር ባሰ ወጣ መፍትሄ መፍትሄ አካል ከተተ ሆነ",
"እውነት ነው ኪስ ውስጥ ያዘ የኤርፎን እድሜ ረዘመ መንገድ መሀል ዋነኛ ሆነ ደረሰ",
"ትምህርት ድል ተገኘ ብዙ ወጣ ውረዶችንና እለታዊ ኑሮ ፈተና ተሸነፈ ታገለ አገዘ ቻለ ያህል ሰጠ ጽሁፍ ምን የounde አካውንቱን",
"ትግል ጀግና ክብር ነው እውነት አርነት ወጣ",
"ብልጽግና በስልጤ ህዝብ ላይ ሰራ የለ ብልግና",
"ኢትዮጵያ ሰራ አመት ዘር ሀይማኖት አክራሪነት ለዘበ ሰላም ምርጫ ተጠነቀቀ ፍትህ ፈጸመ ጠፋ የደናቁርት አጀንዳ መከነ ህዝብ",
"ጋዜጠኛ 'ከምርጫ ኋላ ኢህአዴግ ተሻለ ተባለ ይህ ላይ አለ አየ ምንድን ነው' ኦቦ ቡልቻ ደመቅሳ በጣ ተሻለ እንጂ በለጠ አምባ",
"ብርሀን ጀግና ሆነ አገር",
"ወረረ አይጠረቃ ዘር ነው ድሮ በዚህች እናት ሀገር ላይ ተምች ነው ለቀቀ",
"ይህ ቆሻሻ አስተሳሰብ ነዉ፣ ኢትዮጵያ የሚለዉን ጠላ የሚየደርገኝ፡፡ እኮ ኦሮሞ ህዝብ አንድነት አለቀሰ ኢትዮጵያ ጠላ ነዉ ርኩስ ህልም ኑሮ ቀጥሉ፣",
"ጠቀለለ ሚኒስትር አቢይ ደመረ ኢትዮጵያ ሴት ሰላም ጥያቄ ህሊና ብርሀን",
"ወሎ ክልል ሆነ ጠራ ነው",
"ህወሀት እድሜ ጠገብና አላማ ጽናት አማ ነበር አገር እርስ እሱ በማፋጠጥ፣ ዘረፋ ኢፍትሀዊነትን ታገለ ረከሰ እንጂ መስዋእትነት ድርጅት ሆነ ካደ",
"ዘመን ወረተኛ ጎጠኞች አለ ስም ስም ተስጧችሁ ገፋ ወንድሞቸ እንኳን ብርሀነ ልደት ደረሰ እውነት ነጻ ዋጠ",
"ሌላ ሀገር ሆነ ኖረ ደመቀ መኮንን በላ ጨመረ ስልጣን ለቀቀ ነበረ ሀገር እና ህዝብ ጠበቀ አቅም አለ",
"ሰላም ለኢትዮጽያ",
"መሰለ መሰረታዊ ነገር ኖረ ጥቃት ደረሰ ቡድን አባል ተጠቃ ካስቡት ቡድን ግለሰብብሄርን ቋንቋ ሀይማኖት አንጻር ሰማ ኢእኩልነት ነው አብዛኛው ጊዜ",
"ኢትዮጵያ ተሰፍዋ ፈጠረ ብቻ ነው",
"ጠ/ሚ አቢይ አህመድ ኦሮሞ ህዝብ አደራ በላ መራ ነው ህዝብ አደራ በላ መራ ዛሬ ወይን ነገ ኦሮሞ ህዝብ መራ በላ ምን ዋስትና ለም ጠንካራ ተባለ የኦዲፒ",
"ፈጠረ አለ ግን ንዴት ነዉ እነሱ አሰበ ቻለ",
"ነፍጠኛ አላማ ስኬት ቤ/ክርስትያንና መስጂድን ተቃጠለ አለመ ሀይማኖት ግጭት ተሳካ ዴሞክራሲያዊ ህዝብ",
"ክብርት ሚ/ር ወ/ሮ ዳግማዊት ምስጋና ጋረ የብርቅዬ ኢትዮጵያ አንድ ክፍለ ህዝብ ወከለ ብልጽግና ፓርቲ ከፍተኛ አመራርነተዎ",
"መልካም አዲስ አመት ለሁላችንም ይህ እግዚአብሄር ፍጹም ፍቅር ሰላም ጸጋ አንድነት ከሁላችን ጋረ ይህ መልካም አዲስ አመት",
"ሰንበት እረዴት በረከት አደረ መልካም ሰንበት",
"ሽንታሞ አማራ ጠላ እትም ደረሰ ግም",
"ቅዱስ ጊዮርጊስ እና ኢትዮጵያ ቡና እግር ኳስ ክለብ ወደደ ከተማ ክለብ ነው እግር ኳስ ውስጥ ጠንካራ ሆነ ቀጠለ ፈለገ",
"ገረመ ታሪክ ልብ ነው ነካ አንብቡት ቢቢሲ ነው ዘገበ እስቲ ለዚ ወጣ ለሳለፈው ወጣ ወረደ ስራ ፈለገ ሼር ተደረገ ተባበረ",
"ዩኒቨርሲቲ ገባ ሸሸ ሞት መንገድ ላይ ተገኘ ኧረ መፍትሄ አለ መቼ ሞተ ቁጥር ብቻ ሆነ ዘለቀ ዘለቀ መፍትሄ ኖረ መጣ ነው",
"ስንት አማራ ስንት ኦሮሞ አለ ሞት ሙድ ያዘ ነው ዛሬ",
"እኔ ጥያቄ እኮ ነብስ እረክሷል መሰለ አማራ እንደ ሰላም ሀገር ይህ ረዳ ሀገር ሄደ ዮንቨርስቲ ተማረ ገነት ገባ ተባለ ነው መሰለ አዘነ",
"ፈረንጅ ሁሉ ሀብታም ነው",
"ተመጫለሽ ብየ መንገድ ለመነ መለሰ ሌላ ሌላ ሰው ነው",
"ተገኘ ቆዳ ነው እንጂ ምን ስጋ ብቻ",
"ስትሮክ ውስጥ ገባ አገር ላይ ስቶክ አለ ለዛ ግንቦት ላይ",
"እዛው ቡዳ ዴመላሽ ዴምቀላሽ እየተባባሉይተላለቁ ነበር ልክ አሁን ጀመረ አለ ነው",
"ረጋ ፈለገ",
"ዛሬ ህዳሴ ግድብ ዙሪያ ወሰነ ወይይት ግብጽ ልሁካን ጋረ ተደረገ ዉጤቱ ምን ይህ ምን የዉስጥ ሰላም እና አንድነት ጠነከረ ግን ግድ አለ",
"ብዙ እሱ ሰው ጨፈጨፈ ስለነበር፤ አሁን ላይ እሱ ኖረ ለሱንና ሰው እረፍት ነው አልሐመዱ ሊላህ",
"እኔ ምኞት አገር እንደ ያኔው እንደ ድሮ ፍቅር ሰላም አሰበ ሰፈነ ብና ጠጣ እንደያኔው ተባባለ አንድነት አገር ሆነ አየ ብቻ ነው ሰላም ሀገር ወገን",
"እኛ መዘመን ፈለገ አለ አለ ሰማያዊ ቀለም ታክሲዎችእውነት ነው ዘመንኛ ሆነ መሰለ ለም",
"ታሪክ አወቀ አህመዲን ጀበል እስልምና ወደ ኢትዮጵያ ገባ እኛ ክፍለ ዘመን ነው አለ ይበጠረቃል መንግስት እና ታሪክ አለ አስተሳሰብ",
"ልክ ነው አይን በስተጀርባ ነገር ያዘለ መሰለ",
"ህብረተሰብ ጥቅም ነው ሰራ አለ የምትምሉ፣ ተገዘተ 'ሚዲያዎቻችን' እስቲ አንድ እንኳን ለቀቀ አመነ የጋዜጠኝነትን ሀሁ ወጣ",
"ሱፐር ስፖርት ስመጥር ስፖርት ጋዜጠኛ ወደ ኮሜንታተር ፖናሉ ይፋ ቀላቀለ ይህ መሰረት ሃይለእግዚአብሔር አድሃኖም፣ ማርቆስ ኤልያስ ግርማ እንየው እና ዮናስ አዘዘ ዛሬ",
"ሰብሰብ አረገ ወቀጠ ነው ያኔ ገፋ አለ ወያኔ ተባለ",
"መከራ ሰንቃ አበባ ከተመ ህወሃት ንብረት ህግ አስመለሰ አለ ባዶ ቀረርቶ ቀረበ ሰማ የህወሃት ንብረት ሆነ ጥፍር ነቀለ ፒንሳዎቿና",
"ተአምረኛ ሆነ ሰው እኮ ነው ፈለገ ፈለገ",
"የኢዜማ አዲስ አበባ ምርጫ ወረዳ ከአባላት፣ ደገፈ እና አካባቢ ነዋሪ ጋረ ተደረገ ውይይት ዛሬ አካሄደ ምርጫ ወረዳ ስራ አስፈጻሚ አሁን ተከናወነ",
"አንተ ሳበ ኖረ ውይ እኔ አሰበ አብሽር ሞተ",
"ሺ አዲስ ቅንጅት ሆነ ነው እረ አሸ አለ አለ አዲስ አበባ ላይ ተሸነፈ ለም አራዳ ልጅ እኮ መረጠ ከእንጅባራና ነቀምት መጣ መረጠ ሁለት",
"እሱ ይሄን አለ",
"መሰለ ሰአት የሸገሯ ብሌን ዮሴፍ 'አምሳሉን' ተጫወተ ነፍስ ዳነ ማን አደገ ነበር እኮ ማን",
"ነፍጠኛ የመኪናአደጋ እንጂ የሃይማኖትግጭት አገር ፈረሰ የሚገባውሥነልቦና የለውም፣ሥነልቦናው ሌላውንበሽብር",
"የአማራክልል መራ እንዲ ጭንጋፍ ሆነ ሆነ መቼ ወዲነው ብልህነቱም ጥንካሬ ህግ ከበረ ማስትዳደሩ ተሳነ",
"ታህሳስ ሰሞን አንዳንድ ዩኒቨርስቲ ሰማ ወር ማረ ብሏል፡፡ ወሰነ ዩኒቨርስቲ ዘጋ በቋፍ ላይ ሆነ ተናገረ ነው፡፡ ዘጋ",
"በኤፍራታና ግድ ወረዳ በካራለጎማ ቀበሌ አራት እግር አለ ዶሮ ጫጩት ፈለፈለ",
"ፈረንጅ ጋረ አለ ቆንጅዬ ይሄን ትዊት አየ ጊዜ ኮሚቴ ወጋ አለ ተባለ እውነት ነው እንዴ",
"ለመላውየክርስትናእምነት ተከታይ በዉጪም ሀገር ውስጥ አለ ሀገር ሰው ወምድሞቼና እህት አባት",
"መንግስት ዝሆን ጆሮ አለ አጨብጫቢ ሞላ እና ህግ እንኳን ከበረ ቻለ በተረኝነት ስሜት ናወዘ ስብስብ ሆነ ዛሬ ለታገቱ እህት ድምጽ ሆነ ሁሉ",
"ተምታታ ይሄ ለጠፈ ዶክመንት መጣ እና ማን አተመ የሚግልፅ ፊት ገጽ አለ ለጥፌልሃለው አየ አለ ፊት ገጽ ቁጭ እዚችው",
"መለለ ኢትዮጵያዊ አመጽ በቀለ ተወ አገር ሰላም ረጋ ተጋ ሀይማኖት አባት ጠራ አቀረቡ፡፡",
"ተወራ ጣት ጫማ ተሰናበተ አለ ነው",
"ወጣት ተማረ ሁሉ ኢትዮጵያ ጥግ እጅጉ አዘነ",
"መልካም ገና መላ የኦርቶዶክ እምነት ተከታይ",
"ህልም ንዴት ጠራ ነው አሁን እናንተ ተመኘ ረሳ መለሰ መለሰ ድሮ ትውስታዎችን ተወገደ ጨረሰ ተመልሶ መለሰ ደስታ ነገረ",
"ታህሳስ፳፬ ጻድቅ አባት አቡነ ተክለ ሀይማኖት ልደት አመታዊ ክብረ በአል እንኳን ሰላም አደረስን/ረሳችሁ እግዚአብሄር ጻድቅ ተመሰገነ አወቀ መዝሙር",
"የኢፌዴሪ ጠቀለለ ሚኒስትር በላ አህመድ ዶክተር ልደት በአል ተመለከተ የእንኳን ደረሰ መልእክት አስተላልፈዋል፡፡",
"አቶ ደመቀ መኮንን የና እህት ደርጅቶች ጉዞ መወሃድን ተመለከተ ዋልታ ማብራርያ ሲስጥ አለፈ አመት ጨለማ ዘመን ብቻ ነበረ በራ",
"የኢራን መንግስት በቀል ምን አልበት ስህተት መታ አዉሮፕላን ሆነ ህዝባዊ ቁጣ የሚቀለብስበት መንገድ ተደረገ ፋርስ ይህ አለ",
"እምነት፣ ተንቀለቀለ ደመራ፣ ንጹህ ውሀ ሞላ ገንዳ ዘለለ ገባ ቻለ ልበሙሉነት ሰጠ",
"አማራ ህዝብ ችግር አስተሳሰብ ድክመት ነው መንግስት ሆነ ቀና ገዛ ነው አለ ቅኝ ገዛ ደገመ ትግል እንጂ ልም ሰራ",
"እውነት አለ እኔ ዋለ ሰላም አደረ",
"እንደ ኤርትራ ህዝብ አከለ ብዛት አለ ጎዳና ተዳደረ ህዝብ ይዛቹ እርስ በራሳቹ እንደ እንስሳ እየታራረዳቹ መሀይም",
"ቀጠለ አመት ሞተ ፡፡",
"የገንዲ መድሀኒት እንደ ወጋ በር ፈዘናልተስፋችንን ለኢዜማ ተረከበ ከህወሓት ባሰ ዘመን በቁዘማ ጠበቀ ነው",
"ለከት አጣ አልጠግብ አይነት ፈራ ዘረኝነት ትእቢት እና ድንቁርና ደረጀ ቡድን ዛሬ ከፋ ክፉ ቀን መጣ ይህ ከፋ መጣ ሆነ ነገ ንዴት አረገ ሆነ",
"እኔ ቆንጆ እህት እንኩዋን ደረሰ",
"መልካም ልደት ፍትህ ነጻነት አንተ ጋረ ይህ",
"ሁሴን ወንድም ባረከ እንሱኮ ደግ ሙስሊም ህዝብ ጠቀመ ተደረገ ነው ብዙ መንገድ ሞከረ ተሳካ ሀይማኖት መጣ እሱ አይሳካለቸውም",
"አሁን ብዙ ድርቅ ሞተ ለም",
"ልክ ብልሀል ማን ይስማናል",
"ሞት ዩኒቨርስቲ አመለጠ አለ መንገድ ላይ ወገን ሞት ደነገጠ ደረጃ ላይ ደረሰ",
"ጥር ሞጣ ሽብር ሰለባ ተደረገ ድጋፍ ዘረፈ ወደመ ሀብት ንብረት ብቻ ሆነ ጭምር ጠገነ ሆነ",
"ዳመጠ የት ብሄር አለ መልክ ተነገረ የህወሃት ወይም የኦነግ ጭፍን አየ ወጣ ክስ ሆነ በተቀር አሁን ክርክር ሆነ ምርጫ ስለሆነያኔ ዝም አለ መለደፍ ተቻለ",
"ኢትዮጵያ ወጣ ሞተ ፖለቲከኛ ሞተ አዛውንት ሞተ ህጻን ሞተ ነገር ግን ኢትዮጵያ ፊት ወሰደ ቻለ አዳዲ ሀሳብ ጠቀመ ሀሳብ እኩልነት መጣ ሀሳብ",
"ያሬድ ዘውድነህ ውጪ ሙከራ ድል አግኘቷል",
"ዶርዐቢይ፤ ጠራ ተገለገለ ክብር ዘበኞችንየመንግሥት ሠራተኞን ጭምሮ ማመሥገን/መሾም/መሸለም አመመ መሻር/ከሥራ በረረ መራ ጥንካሬ አየ ድክመት ነው",
"ይሄንን ነው አሃዳዊነት አለ እንደዛ ሆነ አሃዳዊነት ይለምልም፤ አደገ ይመንደግ አሃዳዊነት ይህ ሆነ አዎ አሃዳዊነትን ደገፈ",
"አብንን ምርጫ ገባ ተሻለ ውድድር አየ ነበር",
"በሕወሃት ገዛ ዘመን ይህ ኦሮሞ ልጅ እንኳን ሀገር አበረ ተቀመጠ ስደት ሀገር እንኳን አበረ አየ ሽብር ከሰሰ ተገኘ አደነ ነበር ዛሬ ደገመ ሕወሃትን ናፈቀ አጃኢብ",
"ስዩም ሾመ እብሪት አየ ጉዳይ ውስብስብነት ተገነዘበ ደረሰ መካከለኛ ፣ሚዛነኛ ተጫወተ ተወ ፍየልንኳ ቻለ ስትታሓለል ጮኸ ፌር ነው",
"ነዚ ናይ ብልጽግና ፓርቲ ነገር ብኽመይ ትግልጽዎ ማንቲለ ዘሊላ ዘሊላ ናብ መሬታ ቆልዓ ይጎይሞ ኣይቅድምን ብምስላ ትግርኛ ኣቢልኩም ግምትኩም ኣቕምጡ",
"የቤኒሻንጉል ጉሙዝ ክልል ወደ መሀል ሀገር ወሰደ መንገድ ፈጸመ ጥቃት ዜጋ ቦታ ቦታ ተንቀሳቀሰ ሕገመንግሥታዊ መብት ተነፍገዋል፤ ስጋት ውስጥ ወድቀዋል፤ መንግስት",
"አሁን እጅግ ጣም ምሬት መንግስት አለ ወይ ተሰኘ ነው",
"ሰው ውለታ አላማ ጣመ ዘገየ እንዲያውም ደከመ ይገላል ለየ ለየ እንደ ጠሚዶ አብቹ ልጅነት ጀመረ አገር ራይስ አለ መራ በረታ መራ",
"ኢትዮጵያ ህልውና እግዚአብሄር እጅ ነው",
"የአጋንንት አለቃ እሷ ላይየሚነሱት ሁሉ ነፍሳት ውግዝ በአስሦስቱአጋንንት ስም ነፍስ በገሃነ ሰአት ነበልባልውስጥ ለዘለአለም ስቃይ",
"ትንቢተ አብድዩ ምዕ ቴማን ሆይ፥ ሰው ሁሉ ኤሳው ተራራ ገደለ ጠፋ ዘንድ ሀያል ደነገጠ ወንድም ያእቆብ ላይ ስለ ተደረገ",
"ገረመ ትዝታ",
"ጅማዩንቨርስቲ ወለጋ ገጂ ላይ ከፈተ መጠነ ሰፋ አየር አገዘ ጭፍጨፋ በመቃዉም ላፈ ወጣ",
"እውነት ነው እሱ",
"ጠፋ ሰውዬ ጻፈ ጉዳይ አለ ከኮስሞስ እስከ ኮስሞቲክስ ጸፏል ፈለግ ፈለግ ተደረገ ነው",
"ሰው ደም መጠጠ ደላ ስራ ዘረጋ ፈለገ አሳማ",
"አማራ ጥገኛ ሆነ ህዝብ ነጻነት ተወራ ተስፋ አለ",
"ይህ ሳተ ተመለከተ ነው፡፡",
"ዶ/ር በላ ሺአመት ይንገስ፦ ብልህ፣ ጀግና ደፍር፣ ፈጣን ፦አንተ ሀገር ምርጫ ሆነ ህልውና ጉዳይ ነው",
"ይህ ሻ ነፈቀኝ፡፡ ኢትዮጲያ",
"ምክር ቤት ሆነ ካቢኔ አባል አለ ስልጣን ሀላፊነት ሁኔታ ተካከለ ጠየቀ ጣረ አየ ም/ከንቲባው አለ ምን ህግ ወረወረ ፖሊስ ቆመ ሁለት",
"ፈታ አለ እና እንብቢው መንፈሳዊ መጻህፍነቱ ባሻገር አሪፍ አሪፍ መዝናኛ ትምህርት አለ መጽሀፍ ነው ብዛት በርግት ተጨነቀ",
"ልክአደላችሁም ንብረት ምርምር ስራ ከነፓተንቱ ሸጠ አለ ኦሮሞ ሆነ ነው ይሉናልእኛ ዶ/አብይ አለ ተናገረ ንብረት ሸጠ ቀረ ረዳ ብልጽግና",
"ጠቀለለ ሚኒስትር ዶክተር በላ አህመድ ሰላም ወደ ቤተ መንግስት መለሰ",
"ለንደዚህ ድንቁርና፣ ጥላቻ ደም ፈሰሰ አራራ አለ ግለሰብ ሆነ ተደራጀ ቡድን ወይን ፓርቲ የዲያቢሎስ ተጫወተ ሆነ ውጭ ሞት ብቻ ነው ሰጠ ትርጉም",
"እና ይህ ያዘ ገነጠለ አለ ማን ሰማ",
"ጥቂት እንዚህን ቁጥር ትርጉም ካለወቅ እንኩዋን ጥብቅ በፍርድቤት ደጃፍ አትለፍ፡፡ ይህ አለ እኮ ለኢንጂንር ላይቭ ሎድ እና",
"አክሱም ዛሬ ሰላም ለሀገራች",
"ይቺ ቅዱስ ቀን መዘገበ ያዘ አለ ነው",
"መስጂድ ቀጠለ ጨፈረ ቁጭት ሆነ ቻለ አለ እኮ ነው ይሄ ጎበዝ፤ ምን ያህል ርቀት ሄደ ይህ አስነዋሪ ድርጊት ተደረገ ሞከረ ተመለከተ አዘነ",
"መራ ጌታ ደም ይሸፍንክ አንተ ሳበ ደከመ እንደ ድፎ ዳቦ ሰአት ነደደብክ ጣም ነው አዘነ ዬethiopia መራ በላ አህመድ ጸሎት ድምጽ ከጎንህ ነው",
"ገረመ ገለጸ ማ መገርሳ ቆመ አብይ ብልጽግና ተመለከተ ሰጠ አዲስ ረዳ",
"አንተ ላይ ኧረ ፍጹም",
"ጸጋ መለሰ ድንግል ማርያም ሆይ ደስ አለ አሜን",
"ጀግና ትንሽ ጥል",
"ውጤት አጣ ምክንያት ተሰቃየ አለ ወላይታ ድቻ አሰልጣኝ ገ/ክርስቶስ ቢራራና ተሰናበተ",
"እኛ እኮ አሰበ ነበረ ረዳ ጀገነ ልዩነት ያልለያዬን ፍቅር ተሻገረ ውብ ቀለም ቀለመ ኢትዮጵያዊ",
"እሳቸው ቢዚነሳቸውን እንጂ ሀገር ግድ ሰጠ ተሸውደናል አቋም ደረጃ ከፅነፍኞቹ እኩል ነው",
"ባህርዳር እና ጎንደር ጠፋ ወደ መቀሌ እናንተ አለ ስልጣናት አታሳቡ፣ ህዝብ እንደ ዱርየ ለመሸዎድ ሱስ አይሁንባቹህ የአርማጭሆ ችግር እናንተ የአሳማነት እና የጎጥ መድሎ ውጤት ነው አለቀ",
"እኔ ገሀነም ጣም እኔ ክፉ ተሰቃየ",
"ቃል አጣ ጌታ ሆይ አንተ ጠበቀ",
"ሁለት ዘመን ለወጠ አለ ብቸኛ ሀገር",
"ወደደ አንተ ምን አለ ሚስማርህን ቃመ ነው እኛ ደሞ ኖረ ቃመ ነው",
"ይቅርታ ልማታዊ ጋዜጠኞች' አለ ተዋወቀ",
"መንግስት ሆይ ተቀበለ ተግብር እነሆ ህጻን ተናገረ",
"ጓደኛ ነው ትዎነ ውሰ ቅልት አሁን ፍርሀት ጊዜ ነው ልዋቸሻይ ንምለ ናእ",
"አማርኛ ኬንያ በአውቶብስ ላይ ፈጸመ ጥቃት ሶስት ሰው ህይወት አለፈ",
"ኢትዮጵያ ፖለቲካ በደመነብስ ሄደ ፖለቲከኞች ሞላ አማራ ባለቤት ቤት አስቀመጠ አማራ ወለደ ቆንጅየ ልጅ እቅፍ ያዘ",
"ምን ተወገደ ባለቤት ላላ",
"ጠ/ሚኒስትሩ አልኮል ሲጋራ ከኤክሳይዝ ካሰ የሚገኘዉ ገባ ህብረተሰብ ጤና ለማበልፀግ አለ ወደደ ነዉ ሆነ ገንዘብ ሚኒስቴር ይህ ሲጋራ ላይ ጣለ አለ ብር ፓኮ",
"ባተ ኤርትራ ጠፋ ቆቦሮ ጉድጋድ ውስጥ ቅዘን ቀዘነ እዛው ቀበረ አንተ ሻንቅላ ጋላ ምስኪን የኢትዬጵያ ህዝብ ድጋሚ ሰአት ውስጥ ከተተ ፈለክ",
"ጥያቄ ተመለከተ መለሰ ብይ ተስፋ ተደረገ እኛ አለ ኋላ ነው",
"ፊሊ ጣም ከበረ ልጅነት ትምርት ቤት ሙዚቃ ማረ ነበር ፍቅር ሆነ ሰው ነው ፊሊ ሙዚቃ ብቻ ሆነ በባስኬት ጨዋታ ለየ ብቃት ነበረ",
"ሀገር ከፍተኛ ስልጣን ያዘ ሴት ሰደፈሩና ገደለ ጆሮ ዳባ ለበሰ አለ ላቀ አንድ ሴት ወፈርሽ፣ ሰማ አለ ሰው በለጠ ይወገዛል",
"ድል ገጠመ ጨረሰ ዘነጠ ከሀፍታም ልጅ ጋረ ቀላቀለ ዘና ዝንቦች ወረረ አንተ ነው",
"ቅናታም",
"ሰለዚህ ሀይማኖት ክብር ሸጠ ኖረ ነው ምን ተጮከንን ተላላቹ አለ በራሱኮ ጭኮ ነው ሰለጠነ ተባለ ነገር ግን መጣ ሆነ ንፋሱንኳ የሚነካቹ",
"ጉራጌ ህዝብ ራስ ተመነ ተደረገ አሃዳዊነትን ጫነ ስም ጭምር ሙራጋ ነበረ አአ መጣ ሙሉጌታ ነው አለ ተናገረ",
"ኤርትራ እንደ አገር ኖረ አብዛኛው አረብ አገር ፍላጎት ስለነበር ይህንኑ አቋም ለዘበ ደገመ አቢይ አህመድ አረብ አገር ጋረ ጠራ የዲፕሎማሲ ስራ ሰራ ነው",
"ብልጽግና ፓርቲ ፊርማ ፈረመ መካከል ኦርቶዶክስ ተዋህዶ አመነ አለ አለ ክርክር ውሀ አነሳ ሆነ ተቋም ውስጥ መስዋእትነት ከፈለ ተዘጋጀ ሶፋ ላይ",
"ጴጥሮስ መልእክት ዳግመኛ ወለደ ጠፋ ዘር አይደለም፥ ህያው ዘላለም ኖረ እግዚአብሄር ቃል ጠፋ ዘር ነው እንጂ",
"ማነን ስንት በርሀብ ሞተ አለ ሀገር ስለ ጦርነት ተወራ እስቲ አንተ አገር ላይ ሰላም ኖረ ሳናቅ",
"መገናኛ ብዙሃን አባል ደምቢዶሎ የታገቱ ኢትዮጵያዊ ድምጽ ሆነ ጥር በአአ ተደረገ ሰላማዊ ሰልፍ ተመለከተ ተባበረ ኮሚቴ ነገ አርብ ጥር ከርፕፋዱ",
"የምወድሽ፣ የምሳሳልሽ፣ እናቴ፣ ሃገሬ፣ ኢትዮጵያ ላይ አረንጓዴ አለ መሀል ደሞ ቢጫ ስር ደሞ ቀይ እቃ ሁሌም እነሱ ነው ደመቀ ፈለገ",
"ይህ ቤት ከፈለ ጨረሰ ውለታ አለ ሌላ ኢትዮጵያ ከተማ ይህ አይነት 'ቤት' ኖረ ዘንድ ምኞት ሰኞ እስከ ቅዳሜ",
"ምን ብልጽግና ነዉ ፈለገ አንእቦራጨቅም ድጋሚ አለ የህውሃት ጉባኤ",
"ይሄ ጽንፈኛ ተመለከተ ብልጽግና አስተማረ ውጭ ሆነ ከካድሬ ሰራ ጊዜ አገደ",
"ኦሮሞ ሚባል ግሩፕ አለ የግሩፑን አባል አወቀ መልካም ነበር ንቀት ንክ ደበቀ ቻለ",
"ህም በሱ፡ ዘመን አየ ሆድ ፈጀ",
"ፍቅር አወቀ አለ ሰው መኪና ቀጠለ",
"ንዴት ባለምስጋና ድንግል ተመሰገነ ዘንድ ቻለ ፈጠረ ማህጸን ወሰነ ቅድስት ድንግል ማርያም ላይ አእምሮ ሀሳብ ከፍ አለ ተአምራዊ ንግስት ግን ዘለዓለም",
"ህውን አበረ ደረሰ አሜን",
"እብድ መጽሀፍ ጠቀሰ አበደ አንተ ጀመረ ነው",
"ባልደራስ ጥር እኔ እሷ ለእሱ' አለ አዲስ አበባ ገለልተኛ አካል ለተጠራዉ ሰላማዊ ሰልፍ ድጋፍ ሰጠ",
"አስራት ወደደ ሆነ ሰማ ጠቀሰ ፈለገ ግለሰብ አስራት ሚዲያ ብር ገባ ተደረገ ልብ ተመሰገነ",
"የአልዛይመር በሽታ ህሙማን ማህበር ጠቅላላ ጉባኤ ረሳ በሽታ ለም አለ ጸደቀ ገለጸ ጠላ",
"ድል ዴሞክራሲያ",
"አንዳንድ ሰው እንደ ደመና ነው ልክ ሄደ ቀን በራ ሆነ",
"ማህበረ ቅዱስ ደረሰ አለ ሙስሊም ሀገር የማዉደም ዘመቻ ድርጅት ሚና",
"ታኬ ጣም በረታ ሰው ተወራ እናንተ ስር ለሀገራቹ ሰርታቹም እያሳያቹን ነው ዶ/ር በላ ኢ/ር ታከለ እኔ ጀግና ናቹ መጣ ታሪክ አይረሳቹም",
"ጊዜ እኩል ተባለ የለ",
"እናንተ ግን ላቀ ሰይጣን አለ ደባርቅ ነው አለ ነበር",
"ቀራኒዮአምቦ ወጣ መንገድ፣ ካዲስኮ ቀለም ፋብሪካክራውን ሆቴል እና አለምጸሀይ ሸጎሌ መንገድ ፕሮጀክት ዛሬ መረቀ ፕሮጅከቶች መካከል ጠቀሰ ናቸው፡፡",
"የህወሓት ተላላከ ነበረ አለ ሰው ህወሓት ስራ ልምድ ሰጠ ንዴት ቀጠረ ሽግ",
"ሊግ ላይ ግልጽ የset እቅድ አለ ቡድን ቀላል ወሰደ ቻለ ብዙ",
"ኢትዮጵያ ህዝብ ሾርት ሚሞሪ ነው አለ አለ ግልጽ አወቀ በላ ወንበዴ ነው ንቀት ጥግ የትየሌሌ ነው",
"እርግጥ ነው እኔ ምርጥ ግን ዛቀ ነበር",
"አመት በኢህአዴግ ዘመን አመት ኖረ ነበረ አመት ጨመረ ደረሰ አለ አረ ፈጠረ ተታረቀን",
"ቀን ይቅርታ ለመነ እና ህመም እና ተስፋ ቈረጠ እንጂ ሌላ ምን ተወ ቀን መጣ ክፉ መጣ አመመ ህይወት",
"ምን ደሞ አዋቂ ዳይፐር ላይ ደሞ ሰራ አንድ ሶስት ወር በዛ ሴትዮ ሸለመ ትንሽ ቀረ ተጽተሽ ነበር አለ ምነው ግን አይደበርም",
"መዘገበ ብዛት ሆነ ጠራ ረጋ ብላችሁ፡ ጥንቃቄ ተራመደ ተዋከበ ነገር",
"ህወሓት ከኦፌኮ ጋረ ውህድ ገባ ላይ ደረሰ ገለጸ ኦቦ በቀለ ገረባ ፍቃደኛ ሆነ ሰማ",
"እኛ ቀበሌ እንደዛ ነው አሁን እያካበዳቹ መርፌ ወጋ በለጠ ተጸጸተ",
"ሸጌ ብዙአየሁ ላይ ደረሰ አበበ ብርሀን ምርጥ ስራ",
"",
"ይህ ሁሉ ሟርት ዳጊ ብርቅዬ የአዱ ገነት ልጅ ነው አለ ነው ግርም አለ ስለሸገር ልጅ ተወራ ተንጨረጨረ ነገር ነው",
"ፖለቲካ እውቀት ደሀ እና አድርባዮች ሰባሰበ ሆነ ዘመን ቈየ የገዥው ፓርቲ ሚና እጅጉ ከፍተኛ ነው ኢትዮጵያ ሆነ ተባለ ፍትህ ትምህርት ፖለቲካ እና",
"አማራ ክልል እና የመጅሊስ ድብብቆሽ ጨዋታ ጣም በዛ ነው ሞጣ ሙስሊም አሁን ከፍተኛ ሰጋ እና አስቸኳይ ገዛ ፈለገ ሰአት ምን ዝምታ መረጠ ገባ",
"አገር ይህ ቅን ሰው ተወ እኛ ዶክተር በላ ዉጭ ማን አመነ",
"ሌባ ጣለ ተካፈለ ነው አለ ነገረ ፈጸመ ሆነ ተጋ ጸለየ",
"አስተርዮ ቃል ግእዝ ቃል ሆነ ትርጉሙ/መታየት ወይም መገለጥ አለ ነው፡፡ጥር ቀን ነፍስ ስጋ ለየ ደመና ነጠቀ ወደ ገነት ገባ ሰማይ ምድር ሰጠ ጸጋ",
"ሀይማኖት እኔ ሀይማኖት ኖረ ቻለ ጠበበ",
"ቀን ይቅርታ ለመነ እና ህመም እና ተስፋ ቈረጠ እንጂ ሌላ ምን ተወ ቀን መጣ ክፉ መጣ አመመ ህይወት ጨረሰ ቀስታ እና",
"አጋንንት ወደቀ ጠራ ስም ልዩ ክብር አለ አምላክ ሰጠ ነይ መለሰ ገባ ቤት ህይወት ጽዋ ያዘ ለነብሳችን እንኳን ደረሰ ደረሰ ቅድስት አርሴማ እናት",
"የኢዜማ ካድሬዎች እኛ ላይ ፖለቲካ ሚገባው ለም ምትሉት ነገር ግን ምር ለትዝብት ጣለ ነው ኧረ",
"ኢትዮጵያዊ ሙሉ እንኳን መድሀኒት ኢየሱስ ክርስቶስ ልደት በአል ሰላም ደረሰ ደረሰ አሜን",
"እረ ሌላ መለስ ደገመ የት መጣ ምን ጉድ ነው ግን ዘንድሮ ሃይ",
"ብልጽግና ጽንሰሀሳብ ቁሳዊ፣ መንፈሳዊ ስርዓታዊ አለ ሶስት ከፈለ ዳንኤል ክብረት ሰው ሰውነት ብቻ ክብር ተገኘ ቻለ ነጻነት ረገጠ ወደ ብልጽግና",
"አለ ጭራሽ ግፍ በደል ሰራ አበረ አበረ ሆነ ልክ ነው",
"አበረ ሰማ አለ ፈለገ ገለጸ ቃል አጣ አወቀ ትክክል ሰማ አለ እሱ ነው አንዳንድ ሰው ቁስል በለጠ ደማ ዝምታ ወርቅ",
"ጣም ረዥም ነኝ፣ቀጭን ነኝ፣የደረቴ አጥንት ያምራል፣ቆዳዬ ጣም ንጹህ ነው፣አይኔ ጣም ያምራል፣ስለዚህ ደረሰ አለም ፋሽን ኢንዱስትሪ ባንኳኳ ከፈተ ቻለ ነገር",
"ዳነ ነው ግን በአል ገበያ ቀነሰ ኖረ ይህ ሀገር ጨመረ",
"እን ራስ አይድልም ጀመረ እንደ ስው ወደደ ውሽታም",
"ልክ ነው ግን አሸባሪ መንግስት ፈለገ ተደረገ ቻለ ህገመንግስቱ አነሰ ጋረ ሰራ",
"እንግዲህ፥ ወንድም ሆይ፥ ሰውነት እግዚአብሄር ደስ ተሰኘ ህያው ቅዱስ መስዋእት ተደረገ ቀረበ ዘንድ እግዚአብሄር ርህራሄ እለምናችኋለሁ፥ ሮሜ",
"ሞጣ ወገን ንግድ ሱቅ ቀጠለ ባዶ እጅ ሜዳ ላይ ቀረ መንግስት አነሰ ተቋቋመ ገባ ዝም አለ መፍትሄ ምንድን ነው",
"ወደደ ዳኒ አንተ አለ በዛ ውይ ተማረ ቀረ አንተ ባረከ እህምሮ ነው አለ እድሜ ጤና ለየ",
"ቤዛ ኩል አለም ዮም ተወልደ አለም ሁሉ ቤዛ ዛሬ ወለደ አለ ልደት ቅድስት ከተማ በላልይበላ ቤዛ ኩል በቤተ ጊዮርጊስ ዋዜማ እንኳን ደረሰ",
"ረዳ ገለበጠ ይበጠብጣል፤ አበረ ኖረ ባህል በጠበጠ ነው፡፡ ያ ጣለ አበረ ንውር ሆነ ጭራሽ መሰረት አለ አለ ነው",
"እኔ ምን ገባ ራስ ጉዳይ",
"እኔ ገረመ የጋሎቹ ተንጫጫ እንዴ ኢትዬጲያን እኮ እናንተ ብቻ ግል ንብረት አረጋችሆት ግን አንቺ አይነት ዝንብ መልስ ጨዋታዉ ገና ጀመረ ነዉ",
"ሁለት ስብሰባ ወግ ኢትዮጵያ",
"ግራ የገባቸው፣ የተታለሉ፣ ቅልጥ አለ ዘረኛ መሀይም መረጠ ቻለ ብይ አስባለው አእ ልዩ አዋጅ ወጣ እንደ ፩ክልል",
"ሰውዬ ስውዬው አለ ትንሽ አጥንት ጣለ",
"ለየ ጎጠኛውን አሰረ ወልደየስ ፎቶ ፕሮፋይል ተደረገ አቶ ቡልቻ በጎጠኝነት ስትቸት ትንሽ አፈረ",
"ዛሬ በሶሻል ሚዲያ ሀላፊነት ጐደለ ሁኔታ የምንጸፈው ጥላቻ ሴድብ ዋለ አደረ አገር ተሸነፈ ተሸነፈ አለ ፈረሰ እልቂት ተከተለ ደገመ ደገመ ገለጸ ሰማ ጠፋ",
"ሀገር ደህንነት ጠበቀ ቆመ ኢንሳ ንዴት ራስ ጠለፈ በኤመሪካ የሳይበር አለ ሞያ ዶ/ር ተ/ማርያም",
"እስቲ ትንሽ አፍታችው እኔ እስከ አያት ደረሰ ጠራ ወፍራም ኰራ ነው ሰማ",
"ኩላሊት፣ ጉበት፣ ልብ፣ ሳንባ እና ሌላ ሰውነት አካላት ለገሰ ሰውነት ወጣ ኋላ ወደ አከመ ገላ ገባ ደረሰ አለ ቆይታ ጥያቄ ፈጠረ ይህ ጽሁፍ መልስ",
"እናንተ እዛ በአል ጠላ እና ጠጅ እሽኮለለ ላላ እኔ ይህ አመት ኋላ ዶሮ ወጥ በላ አኰረፈ ነዉ መሰለ አጥንት ጉሮሮ ላይ ቁጭ አለ ድምጽ ሁሉ ተበላሸ ሁኔታ ነዉ የተፈጠረዉ",
"ጨመረ ይህ አይነት ከባድ ነው ብቻ",
"ጋሽ ትራንፕ ቀስ አለ ለውጥ መጣ እኔ ነው እኔ መራ በላ መራ ብይ ነው አለ አይቀሬ ነው ወይ ስልጣን ፍቅር ድራግ አለ አይደል እንዴ ስንት ዘላበደ",
"ቀረ እኮ ምግብ ህንጻ መሳሪያ ገዛ ነው",
"አይይይ ሱሪ ተበላሸ ነው ገባ",
"ማን ጠየቀ ፈለግ አይደል ፈነጨ",
"አንድ ወር ብዙ ሰራ",
"ዝም በይው አንደኛ አአወዛጋቢውእሱ ነው",
"እዛ ሄደ ጠፋ እሱ",
"ቀላል ፀረ ሙስሊም ነው ቀላል ፀረ ትግራይ ነው የድድብና ጥግ አለ አንተ ነው ጀመረ አንተ ፖለቲከኛ ሆነ ቻለ",
"ትግራይ ህዝብ አጋር እንጂ ጠላት ነው",
"ጀግና እና ሌባ ታጋይ እና ሽፍታ ተምታታ ዘንድሮ",
"እኔ ጣም ደስተኛ ነው",
"እኔ ማን ዘልዛላ ጋረ ንግግር አለ እግዚአብሄር ባረከ ስድብ ግን ምን ትምህርት ተገኘ",
"ፍቅር ያዘ አለ ሰው ልብ አሰረ ሳበ ተገለገለ ሰላም መንገድ ነው የት ነው አለ",
"ለክብርት ወ/ሮ ዳግማዊት ሞገስ፤ አለ አዲስ አበባጎሃፅዮን አለ መንገድ ገባ ነደለ እና ስለተገባበጠ ኢትዮጵያ ባህል ስፖርት ፌስቲቫል ተካሄደ ገበጣ ማጫዎቻ",
"ነዛ ደርግ ግዜ ኪሎ ቤተመንግሰት ነበረ ቅልብ ተባለ የት ገባ ይህ አመነ ሆነ ደምብ ተቀለበ ነው",
"እኛ ተገኘ መራ አገር ዞረ ወገን ችግር ፈታ ዳከረ መራ ነው ምስጋና ገባ",
"ጣም ቸገረ ሆነ ወለጋ እና ወያኔ ጠፋ አለ መንግስት ኃ/ማርያም",
"ጠቀለለ ሚንስትር አቢይ ደቡብ አፍሪካ ቆይታ ፕሬዝዳንት ሲሪል ራማፎሳ ኢትዮጵያዊ ተከበረ ኖረ ህጋዊ ፈቃድ ሰጠ ቀረበ ጥያቄ ተቀባይነት ተገኘ ይፋ አድርገዋልebc",
"አሁን ፍርሀት ጊዜ ነው ርበነ ቅውአ ንትንዴ ይቬርሃ ተጨነቀ ምን ክፍያ ፈለገ ስረድ ጉርደያኪስእ ልብምጭ",
"እሷ ደንብ ዳመጠ ጠራ ነበር",
"ይህንን ወር ተቸ ፊት ወሬ ምንጭ ጠራ ፈለገ",
"መልካም ግን ክቡርነቶ ባረከ በረታ ፍጥረት ከጎንህ ነው",
"ሃሃሃሃ ቀበሌዉ እንኳንም ትዊተር አለ ከፀብ ጫረ ቆጥረዉህ አወቀ ኖረ ነዉ ተደረገ",
"ሀዋሳ፡ ጥር አመመ ደሬቴድ አስር መኪና ጫነ ኩንታል አዮዲን አለ ጨው ወደ ለየ ሀገር ክፍል ተሰራጨ አለ ያዘ ኢትዮጵያ ምግብ መድሀኒት",
"ባላገር አለ ዘፈን በቀር ሌላ እንኳን አለ አወቀ ነበር ገረመ",
"ሁሉ አወቀ ነው ሆነ ቀደመ ያቃል፣ ሆነ አለፈ ያቃል፣ ሆነ ቀለለ አለ ነው ለእ/ር እውቀት ሰወረ ምን ነገር ለም መዝሙር አንተ ቀድሞ ኋላ አወቀ",
"ትክክል ነው ምናለበት ጉልበተኛ ነው አለ ሆነ በስተቀር",
"አባት ዘመድ ዛሬ ኰራ ደቡብ አቸፈር ዱርቤቴ ደብረ ሰላም ቅዱስ ሚካኤል ቤተክርስቲያን ዛሬ መረቀ ዱር ቤት ሙስሊም ሺ ብር አበርክተዋ ዝንታለም አማራ",
"ዛሬ ስቴዲየም ገባ ነጻ ነበር ዛሬ አይን ምስክር",
"ይሄ አንድ ምሽት በቃ ፍቅር መሰለ",
"ቈጠረ ፊት ቀጠለ መስመር ደገመ ቅርብ ሰማ እርግጠኛ ነው",
"እላለው ድል ዲሞክራሲ ድል ዲሞክራሲ",
"በአል ንዴት ነው ጠራ ነው አለፈ",
"ቤተሰብ ጨዋታ ፖለቲከኞች ጋዜጠኛ ጋረ ልዩ ገና በአል ዉድድር ግሩም ዝግጅት ሆነ ተጨማሪ በረታ ገባ ነው አዘጋጅ እሸት ለሰነ ተመሰገነ",
"ጠራ እይታ ነዉ",
"አንዳንድ ቅን ልብ አለ ወደደ ከፋ አለ ሄደ አለ ላይ ሄደ ማርያም አንቺ ንጹህ የዋህ ልብ አዘነ ጽሁፍ",
"መልካም ስራ ግዜ ሆነ የዘወትር ጸሎት ነው",
"እኔ እንኳን ደረሰ ዋና ነገር እንጀራ እንዲ በጠሰ ከበደ ውበት ሞገስ አለ ነው ፍሬ ሀሳብ",
"እንደ አንተ ያለው ዶማ ደብተራነትን የት ተገኘ ብለክ ደብተራ ሆነ መረጠ ፈለገ",
"ሀሳብ ነጻነት ከለከለ መንግስት ስለ ብልጽግና ተወራ እንኳን ፅን መሀል ወጣ ሰማ ትክክለኛ ማንነት ነው",
"ይሄን መልእክት ሁሉ ለመነ ደረሰ ሼር ሼር ሼር",
"የአብንኢዴፓባልደራስ አስፈላጊ ነው",
"አለ በስረአት አልተጠቀምንበት ሀገር ሀብት ባከነ",
"ባህል ተሸነፈ ተባለ ምን አለ ነው ትንሽ ግር አለ ነው",
"የጅዋር ፈጠረ ገረመ ጠራ መራ ጣለ ደፋ ቀና አለ ሰው ችግር ከምዬ ኢቲዬጺያ ነዉ",
"ጀለሴ ነገር ጠመዘዘ ነው ወደደ ራቀ መለሰ",
"እንዴ ደሞ ምን አለ",
"ግን ደሞ ንጉስ መልካም ስራ ኖረ ፈጸመ ኖረ ተንኮል ተራራ ገዘፈ ሆነ ረሳ ለየ ሙስሊም ኢትዮጵያዊ በአግላይ ፖሊሲ ብዙ ተሰቃየ ኖረ አመመ ቀሀ እጅግ ክፉ፣",
"አሜን ታታ ሌላ ትዊት መለሰ ድል",
"አሜን አሜን አሜን እኔ መልካም",
"የአፍላነት ፍቅር ህይወት ማህሙድ አህመድ ዘፈን ጋረ ቅርብ ተቈራኘ ነዉ መሃሙድን ሳበ ዛሬ ደረሰ ዘፈን ቦታዉና ያቺ ቆንጆ",
"እንደ በር ሻኛ ረጋ ነው",
"ሰማ ምነው አለፈ ቀለለ",
"አዋ ሰማ ሰው ሆነ ረገጠ ፈለገ ህዝብ ነዋ",
"ዝም አለ ነው ቀባጠረ",
"ጋሼ ዘመን አለ ያ ጃምቦ አለ ነው ብይ ሳበ",
"ብሽሽቅ ተመቸ መሰለ «መስጊድ ተቃጠለ ተወ እንጂ ግዴለም እኔ ቅጥል ልበል» ብይ ቀለደ",
"አየ መልካም ሁሉ እይው ግን ትዳር ቀልድ",
"ዛሬ// መዲና አዲስ አበባ/ፊንፊኔ ታላቅ አካል ብቃት እንቅስቅሴ ተካሄዷል በሁላችን ጥረት ስፖርት ህዝብ ባህል ሆነ",
"ክቡር ፕሬዝዳንት ማ መገርሳ ምእራብ ኦሮሚያ ወለጋ ከበበ ተደረገ ጦርነት ተቃወመ ግል እረፍት ወጣ ዛሬ እለት ውጭ ሀገር",
"ሰማ እምብኝ አለ ህወሓት",
"ላከ ቦርድ ጠፋ ዳስተር ረገፈ ወጣ ዞር ዞር አለ መጣ አለ ደስታ ትዝ አለ",
"እውነተኛ ዲሞክራሲ መሰረተ ግፍ አለ ፎከረ ድርጅት ለም እውነተኛ ዲሞክራሲ አበረ መሰረተ ሀገር አበረ",
"ተመሰገነ ድምጽ ሌላ ድምጽ ሆነ አፈነ ማረ መንግስት አስቸኳይ ለቀቀ",
"ሌላ ፍቃድ ክብር ገለጸ ተምሳሌት ሆነ ብቻ ነው ምክንያት እግዚያብሄር እራሱን በምልአቱ እንደ ስፋት ቢገለጥ ረዳ ቀረ ፊት ቆመ ኖረ ነበር",
"ሚድያዎችን አስፈጻሚ አከከ ጫና ነጻ ተደረገ አዋጅ ያስፈልጋል፡፡",
"ፖለቲካ እና ሀገር ህልውና ለየ እና መለስ ፕሮጀክት ቁርጠኝነት ጀመረ ሀገር የወደፊት ብልጽግና አስፈላጊ ሆነ ሁላችንም",
"ሀጢአተኛ ነፍስ ከድነት ላይ ነው አመመ ሰላም እና ህመም አወቀ ብቸኛ የባዶነት ቅዝቃዜ ብቻ ነው ንስሀ ጊዜ ተጠናቅቋል ምክንያት ጥፋት ክፉ አይነት ማንኛውም ተልእኮ",
"አማራ ብሄርተኝነት ለእንናንተ ምንድን ነው እኔ ሞተ ተኛ አማራ ተባለ አንበሳ ቀሰቀሰ ጅራፍ ነው እንደዛ ሆነ ደገመ እኛ ተገለገለ እንጂ መራ እንዳልሆንን አወቀ",
"ጋሞ ዞን ክልል ሆነ ቀረበ ጥያቄ ደቡብ ክልል ምክር ቤት ምላሽ ነፈገ ፌዴሬሽን ምክር ቤት ጣልቃ ገባ ደብዳቤ ጠየቀ ዞን ምክር ቤት ጋሞ ክልል ምሥረታ",
"አክራሪ አነሰ ታሪክ ጠመመ እዬሰራ አለ እኮ ይህ ድርጅት በላይ ጠበቀ ድርጅት ነው እንደጎንደሩና እንደዴሴው ዱቄት አረገ ተሰናበተ ነው",
"ጎንደር ዩኒቨ ተቀበለ ከሆበ መታ ዩኒቨ መሸኛ ሰጠ ቃል ገባ ጎንደር ዩኒቨ ፈቃደኛ ሆነ አማራ ማረ መሰለ ሁኔታ ውስጥ ተገኘ",
"ገረመ መቶ አመት ደፈነ ጥቂት ቀረ ቅደመአያት ኖረ ስልክ ተወራ ጆሮ ጥርት ተደረገ ሰማ ምርቃት የምታሽጎደጉድ ህይወት አመመ አታውቅም|ከዳማከሴ ያላለፈ|",
"አርባ ጉጉ በደኖ እኔ አይን አየ ልጅነት መጥፎ ትዝታ እንዲሁም ኦነጎች ሰው ሆነ ዛሬ ብዙ እጠራጠራለሁነብሰጡር አማራ እናት ቀረ ሆድ ጩቤ ቀደደ ወደ ገደል ጣለ",
"እሱ ጣም ጠራ ነበረ ይአ ምኤ ልቭፓዶ ሌሊት ወፍ ቅርጽ ሉላችይ ርገናመ ስንያቢ",
"አሁን ፓርቲ ስም ያዘ ነገ ምርጫ ቦርድ እዉቅና ሰጠ እራስን ግልጽ ሆነ ሁኔታ ህዝብ ቀረበ መልካም ነው ባለአደራ አለ ደነቈረ ከረምክ",
"ምርጫ መረጠ ጨረሰ ነገረ ግን ምር ይሄን ዜና ሳነብ አንተ ነው ትዝ አለ ተራ ግን አመለጠ ምን ሆነ ልምድ አለ ሰው",
"ምርጫ ፊት ልዩ ሀይል እና ሚሊሺያን አለ ሰጠ",
"ሀዘን ብዛት አይን ብርሀን አጣ አሁን ሀገር ሰላም ዘወትር ነባ እማሆይ",
"ዘመን መጠጠ ትግል አካሄደ ዘመን መጠነ ውጤት መጣ ቻለ",
"ኦሮሞ ህዝብ ትግል ግብ ደረሰ አለ ህዝብ ቃል ገብ አመት ሞላ ህዝብ ካደ ህዝብ ቃል",
"አብርሾ መልካም ሰው መልካም ልደት አለ «እድሜው ገፋ እንጂ ጣም ጠራ ሰው ነው» እንዲሰመርልኝ",
"እንዴ አወቀ አለ እኮ ሰውዬ ምነው እድሪስ አለበ ነው ተጫወተ",
"ጠባብ እና ትምክተኛ አጣ አለ ቻለ ያግዙናል፤ ቻለ ይተውናል፤ ገባ ይተቹናል፤ ፈለገ ቆመ እኛ ግን ወገብ ጠበቅ",
"አንተ ተስፋ ቈረጠ",
"ጣም ጠቀመ ትምህርት",
"መንግስት ተብየውስ ምን ይወጣለታ መልክ አጠበ ጠጣ መና ነው እንጂ",
"ህወሃት እንዲህ ፍጥነት እራሷን ወደ መቃብር ወረደ አለ አልጠበቅንምአብዛኛው ኢትዮጵያዊ ገላገለ ቅርብ ጋረ ይገላገልሻልአንቺም ታሪክ ውስጥ እኩይ ተግባር ሲዘከር ኖረ",
"አንድ ዘረፈ አንተ ነበረ ነገረ አለ",
"ምን ባለሙያ አለ አለ ነው ዱኩላ",
"ጨዋ ህዝብ እንኳን ሰው ሳር ረገጠ ተጠነቀቀ ባህር ዳር",
"ዛዲያ ድርጅት መታገታቸውን ሰማ ጀመረ ምን ተደረገ ነበር ህዝብ እኩል ይህ ላይ ጠየቀ አፈረ ነገ ብልጽግና ምናምን አለ ተወራ ተሳነ አሰረ",
"ሜድቬዴቭ ሩሲያ ጸጥታ ምክር ቤት ምክትል ሆነ ሾመ",
"አማራ ህዝብ ተስፋ ተባለ ተቋም ለማፈረስ ተጋ የሚሰራ፣ አውርጃዊ አስተሳሰብ አለ ህዝብ አንድነት ጸር ሆነ ድርጅት ነው አዴፓን አማራ ህዝብ ትክሻ ላይ ወረደ የክ/ዘመኑ አማራ ህዝብ ረፍት ነው",
"እውነት ሆነ ቻለ እናንተ እኮ ሰራ ላቀ ሌላ አማ እና ጣለ ላይ",
"ንዴት ነው ቁጥር ላይ ችግር አለ ወይስ ሰራ በት ስራ አቁማል",
"ኢትዮጵያ እስላም የክርስትያንም አገር ነው አለመ ድርሻ በለጠ አለ ነው ይህ ደገመ ማን ጤነኛ ሰዋ ሳያቅማማ ተቀበለ አለ ላቀ ሰው ሀይማኖታዊ አስተምህሮ",
"ድጋፍ ሆነ ነው",
"እንኳን ደረሰ ስም ሊጠለሽ ቻለ ሰራ ሁሉ ግልጽ ነው",
"በሚልዬን ቈጠረ ህዝብ የጃዋር ተከተለ ድንጋይ ታታ አለ ነዉ አየ እናንተ ምላስ ብቻ በቃ ብዙ አለ ቻለ ሌላ ተስፍ ቈረጠ ምልክታቹ ነዉ",
"አሁን ሁለት ሰው ኢትዮጵያ ታሪክ እንደ አቢይ አለ ቅን መራ ነበረ አለ ሀሰት ወር ተሰራጨ ተገኘ ገጽ በlock በረረ መሰለ እርምጃ ጠነከረ",
"ላቀ የምስራች ነው አብዮታውያን አቻ ቀላቀለ አለ ነው ነገር ቅርጽ ያዘ መሰለ",
"እኚህ ወለጋዎች ሸዋ ሳይገቡ፣በሕዝብ ፊት ሰቀለ እና እርም አስብሏቸው ቀ/አፄ ሀይለስላሴ",
"ድሮ ኬዝ ሆነ እንጂ መጣ እኔ ጋረ ተገኛኘ ሳጅን",
"መራራ ሳቀ ቡልቻ ደመቅሳ በለጠ ተግኘ ቡልቻ ቁም ሞተ ሆነ ጊዜ ኦሮሞ ተረኛነትን ተወ ሞተ ረዳ ስቅስቅ አለ አለቀሰ አስለቅሶናል አየ ቡልቻ",
"ቁም ቅዥት አለም መሸ ስር እውነት ተናገረ ከቅዥት",
"ምን አየ ነው",
"ህወሓትን ጠላ ሰው ህወሓት ብልጽግና ቀላቀለ ነደደ ነገር ነው ገባ አለ",
"ሆይ እውነተኛ ሆነ ነገር ሁሉ ጭምትነት አለ ነገር ሁሉ ጽድቅ ሆነ ነገር ሁሉ ንጹህ ሆነ ነገር ሁሉ ፍቅር አለ ነገር ሁሉ መልካም ወር",
"ህውሀት አልዋህድም አለ ተባለ ለየ ደገመ በአዴፓ ደገፈ ደነገጠ አየ ነው መረተ ያውርድላቹሁ፡፡",
"ገረመ ንግግር ደመቀ ኰነነ ስለ ውህደት ማ እውነት ተናገረ",
"አይን ተደረገ ተመቸ",
"ለውጥ ተባለ ነገር ተበሳጨ ህዝብ ላይ ግፍ ፈጸመ ሰው ምን ሰራ አሁን መንግስት ስልጣን ያዘ ተቀመጠ ነው የግፉአን ደም ጮኸ",
"ችግር ኦነግ ከነትጥቁ ገባ ነው ችግር ፍትሀዊ ሆነ ወለጋ ክልል ሆነ ጥያቄ አፈነ ሞከረ ነው ወለጋ ክልል ሆነ ጥያቄ አፋጣኝ መልስ ተገኘ አለ",
"ምክንያት ይህ ወቅት ቀላጺነት ብቻ ትርጉም አለበ ሆነ አየ",
"አዲስ አበባ ከተማ አደረ የነዋሪዎችን ህይወት ቀየረ ተደረገ አለ እንቅስቃሴ ህዝብ ወከለ ምክር ቤት ደነቀ",
"ወሰነ ሰው ነው",
"ሀገር አይገዳቸውም ሀብት እንጂ ምን አይነት ልክፍት ነው",
"ሰው ከበረ አመነ ፍቅር ሰው ዝቅ አለ የምታክር የምተስከበር ውድ መራ እንኳን ሰላም ተመለስክልንበ",
"ጥበብ ልምድ ነው ፡፡ ሞከረ ብዙ ጊዜ ጥበብ ጥረት ምክንያት መጣ ነው",
"እውነት ነው ፊት ላይ አየ ፈገግታ ተስፋ ልበ ሙሉነታቸው ሀሴት ያጎናፅፋል አሜን ዋለ አደለ",
"ዘመመ ይባረክ፡፡ ወደ ዲላ አካባቢ ብቅ አለ ጊዜ እግ/ር ይስጥህ፡፡ ለውጥ ናፈቀ",
"አንቺ ዱቄታም መጣ አነበበ ታሪክ አለ ነው ያሽው ደብተራ ነገረ እንጂ እስክንድር ደሞ ወያኔ ጥፍር እና ጸጉር ነቀለ ማንነው ፈታ",
"ዛሬ ሰው ሀብታም ጎሮቤት አለ ተደሰተ አወቀ ሰው ጎሮቤት አለ ተደሰተ ጀነት ላይ የነብዩ ሰለላሁ አለይሂ ወሰለም ጎሮቤት መሆንግን ሱብሀነላህ አደለ ነው አላህ ገራ",
"ሰይፍ ግን ዛሬ ጣም አመሸ ቤት ሚስት ተቈጣ እንዴ",
"በቀለ ገርባ ወደ አማራ ክልል ሄደ ተደረገ ሌባ ተደረገ ሞቅ አለ አቀባበል ተደረገ ሳበ",
"ህወሀት ብልጽግና ልማት መረጠ ኢዜማ በአሯሯጭነት ብልጽግና ጋረ ቀጠለ ነው",
"ስብሰባ ዝግጅት ቢኖረም ላይ መጣ ትህዛዝ አለ በቅድመ ስምምነት ከፈለ አዳራሽ ህግ ገባ ዉጪ መንግስት ጥብቅ መራ ተሰብሳቢዉ ገባ በር ላይ ሰበሰበ",
"ጀመረ እኔ አንተ ደበቀ",
"ከፍተኛ መንግስት ስራ ሀላፊ ከታገቱ ማረ ወለደ ጋረ ተወያዩ ጠቀለለ ሚኒስትር ዶ/ር አቢይ አህመድ ጨመረ ከፍተኛ መንግስት ሀላፊ ቅርብ ከታገቱት ደምቢዶሎ",
"ተለቀ ውጭ ጦርነት ተሸነፈ ተሸነፈ ለም",
"ሀገር ፈጠረ ችግር ላይ መረጠ ያወግዛሉ፣አንድ ህዝብ ላይ ጥላሸት ተቀበለ ሌላ አየ አለፈ",
"አሁን ቀጠለ ከዚያን ጭቅጭቅ ምርጫ ጊዜ ረዘመ አለ ስምምነት ጉልበት ቆመ መጣ አጓጉል ብልጥግናወለድ ሁከት አመነ ያኔ ነሀሴ አቀደ ምርጫ ረዘመ",
"እግዚአብሄር የማትችለዉን ነገር ሰጠ ይህ ተጨነቀ",
"አጠቃላይ ግማሽ ቢሊዮን ብር ላይ ገመተ ባእድ ነገር ጋረ ቀላቀለ ገመተ ቅቤ አረረ ምርት ተጠረጠረ ጋረ ያዘ ኢትዮጵያ ምግብ መድሀኒት ቁጥጥር",
"ኢዜማ ዋነኛ መንገድ በደለ መውቀስ፣የተከራየውን ሆቴል ከለከለ የት ገባ",
"አንተ ደገመ ከፕሬዝዳንቱአ ቀጣይ ሆነ ቻለ",
"ይሄ ቅዠታም ገና ምን አለ አለ አለ ነው መረጠ አለ ሰራ መልካም ነገር አለ መጣ ኢትዮጵያ ተነሳ ለም ዘንድሮ ወደ እኛ ዞረ ፈያመካ አለ",
"መንግስት ምንያድርግ ደረቅ አበለ ጽናት ሰጠ ለሰለሰ እኔ ገባ ህዝብ ደህንነት ጠበቀ ግዴታ ነውውውውው ቤ/ክ መስጊድኮ ነው ልመና",
"እኔ ዘር ተሻለ ነው አለ አሰበ ሰበሰበ ግብርና ሚኒስቴር መዘገበ",
"ህወሓትን ጠላ ሰው ህወሓት ብልጽግና ቀላቀለ ነደደ ነገር ነው ገባ አለ ህወሃትም ብልጽግና ገደል ገባ",
"አመት ሙሉ ፓርቲ መንግስት ደባልቀዉ ጠቀመ ቢሊዮን ቈጠረ ግብር ከፈለ ገንዘብ ከነወለዱ ቱም ድርጅት ከፈለ አለባቸው ለየ ህወሓት",
"አሜን ብያለው ዘመድ ግን ዋና ነገር ሽንኩርት ከተፈ ነው ሽንኩርት ከተፈ እጅ ባረከ",
"አንድ ጦር ጀነራል መንገድ እና ውሀ ስራ ላይ መደበ መደበ ስራ አለ ትንሽ አፈረ ወንድም አድርባይነትም ልክ አለ",
"ሙስሊም ጠል ሚዲያ አሰረ ቲቪ ኢሳት ቲቪ ሚዲያ በረራ መጽሄት ኢትዮፒስ መጽሄት ቢቢሲ አማርኛ",
"ናቀ ተባለ ነው",
"ከብሔርተኝነትና ጸዳ ምርጫ ፍትሀዊ ሆነ ቻለ",
"ረዳት ሴት ሆነ ኖረ ፓርቲ ቀየረ",
"ይህ ነው ንግድ ማን ገባ የሚባርቅበት",
"ምርጫ ይኸው አፈና ጀመረ ሆኖም፣ ባልደራስ ለእዉነተኛ ዲሞክራሲ ፓርቲ መንግስት ተጽእኖ አዳራሽ ከለከለ ሜዳ ላይ ወለደ ፊት ፊት መራ ትግል",
"አለ እንግዲህ ዛፍ ተክል አወቀ አንድ አካውንት ከፈተ ምን አለ ታዲያ",
"መጣ ለታ ነው ወሎ ዩኒቨርሲቲ አጠገብ በባስ አለፈ ነበር ረዳት ለሹፌሩ ጠጋ አለ ቀስ አለ ይህ አካባቢ አህያ በዛ አይይይ ዩኒቨርሲቲ እንዲህ መኧለጃ ሆነ",
"እኔ ፈለገ ኢትዮጵያ ፍቅር ኖረ ሆነ ማን ገገማ ወደደ ጠበቀ ህግ ተከባበረ ኖረ ሀገር ነው",
"አጭር ነው አለ አወቀ መንገድ",
"ተወሀደ ትንሽ ቢገዳደሩት ጠራ ነው",
"ህግ በላይነት ዙሪያ ተስፋ ቈረጠ ቀረ ነው ተስፋ ቈረጠ የት ገባ",
"ህዳር በዕለተ አክሱም ጽዮን ማርያም የአድዋው ሰይጣን ህወሃት ግብዓተ መሬት ፈጸመ ህወሃት",
"በሀሳዊያን ተዘወረ የትዊተር አካውንት ለቀቀ ረዳ ተቀበለ ተሰራጨ ራስ እኩይነት ነው ቋንቋ ከመግባቢያነት አለፈ መራ ሀገር ጥቅም ጠበቀ",
"ጀመረ መጽሀፍ መጽሀፍ ቅዱስ አለ ለውጥ አወቀ ቀጠለ ዥልጥ ሰው ተመቸ",
"ምነው ቀልድ ንጹሀን ላይ ባናረገው",
"ዝባዝንኬ ነው ተወራ ሽፍታ አንድ ፖለቲካዊ ግብ ያዘ ጫካ ገባ ሁሉ አወቀ ተነጠለ ላቀ ክፉ ቀን ጠበቀ ሆነ እያባበሉም እያሰታጠቁም ቈየ መረጠ እነርሱው ነው",
"አንድ ሁኔን ደመረ ስንወያይ ውይይት ዉጤታማ ሆነ ሁለችንም ከአብቹ ጎን ቆመ",
"ጥንቃቄ ሞላ ስጋ ቁራጭ ነጣ ትክክለኛ እና ቈረጠ ጥልቅ ሆነ አለ ስጋ ለየ ብልህነት ጠየቀ ፡፡ እኔ ጣም መከረ ጣም ጠራ ክፍል ጭን ነው ፡፡ ነጣ ስጋ መረጠ ፡፡",
"ጣም ጠራ ተመሰገነ",
"ጥቆማ እግዜር ያክብርለኝ ንዋይ ይህ ዘፈን ከልኬት ላይ ነው",
"እኔ ብቻ ነው ዶሮ ለሊቱን ተኛ ያስባለው",
"ህገመንግስት ላይ አለ ለም አለ ዛዛታ ተውትና አረመኔ እስላም ፈላሻ ማን ነበር",
"ልክ ነው ተለያየ አተገባበር ጠቀመ አለ ለዛ ነው",
"ሰው አንዴት ሁሉ ነገር ከእዉቀት ነጻ ሆነ",
"አንተ ቆሻሻ ስው",
"ኢትዮጵያ ህልውና ኢትዮጵያዊ እጅ ነው",
"የዘመድኩን ነቀለ ወደደ እኔ ወደደ ሆነ ገረመ ምን አለም ላይ ጸያፍ ውሸት ራስ ዋሸ ነው እሱ ሰላም አለ እኔ አይደብርም",
"ወያኔትግሬ እንደ ናዚ በኑርንበርግ ፍርድቤት ወይም ሄግ ፈጸመ ዘር ጠፋ ቀረበ አይቀሬ ነው ከነ ዳይፐራቸውም ሰማ ስብሀት ነጋ",
"አሜን አሜን አሜን እኔ መልካም እንኳን ደረሰ",
"መልካም ነው እርስ እርስ ልዩነት ላይ የጦዘ ክርክር ተደረገ ተመቸ መልካም ነው በዚህኛው እርስ እርስ ጠለፈ ጥረት ተደረገ ተመለከተ",
"ኢ/ አፍሪቃ አለ ኤርትራ አለ በሆዳሚች ሀገር ብቻ ነው አየ አለ",
"እኛ ተሳሳበ እና አገዘ ኢትዮጲያን ካላበለፀግን ኢትዮጲያ ከኢትዮጲያዊያን ወጣ ሌላ ማን አለ ረዳ ለኢትዮጲያ እድገት እና ብልጽግና ተረባረበ",
"ሞጣ ሙስሊም ጉዳይ ሁሉ አማራ ጉዳይ ነዉ ተመሰገነ ዶር",
"ትንግርት ሚኒስቴር ጭራሽ ቀረ አለ ነው አለ ምር ይሄ አቃጣሪ መንግስት ድሀ ነፍስ ተጫወተ ቀጠለ",
"እሷ ፊት ፊት ነኝ፡፡",
"እናንተ አይነት ተአማኝነት አለ ሚዲያ ወሰነ ሚና አለ በረታ",
"ናደ ትክክለኛ አወቀ ሁሉ መሰለ ስህተት ነው አለ ከረከረ ነው እኮ የዛኛውን ቅዠት ተወራ እንጂ",
"አሁን ገና ከአብን ቀጠለ ብልጽግና መድሀኒት",
"",
"ህግ እና ስርአት ከበረ መንግስት አለ አለ ደህንነት ጠበቀ አለ አመነ ትምህርት ቤት ወጣ ማረ ምን ገታ ይህ ያህል ጊዜ መንግስት የት",
"መሬት ግል ተዘወረ ግን ብዙ ሰው ሀይል ክምችት አለ ከበበ ሰፋ አረሰ መሬት ወደአለበት ከበበ ሄደ ተከራይቶ/ገዝቶ ወይም ኮንትራት ሰራ ቻለ ድል ፈጠረ",
"እናንተ ውስጥ እኮ አንድ ደህና አለ አወቀ ቆየን፣ አነሰ ዝም አለ ምን አለበት፣፣ እንደ እናንተ አለም ላይ ፈለገ ተገኘ",
"አዲስ ተቃወመ ፓርቲ ሳልሳይ ወያነ ትግራይ ሳወት ነገ ጀመረ ጀመረ ጠቀለለ ጉባኤ ያደርጋል፡፡ሳወት ጉባኤ ፕሮግራም ያፀድቃል፣አመራሮቹ መረጠ ተብሏል፡፡ሳወት የኢፌዲሪ",
"ኬንያዊ ላይ ነው አለ",
"ቀድሞ አርበኛ ግንቦት እንዲሁም አሁን የኢዜማ አባላቶች እንዲሁም ደገፈ መለለ ኢትዮጵያዊ ካነ ገና በአል ደረሰ በአል ጤና ሰላም ደስታ ፍቅር ሆነ",
"እምዬ ኢትዮጵያ ጉድ ለየ ክትክታ አወቀ ትውልድ",
"ጎጃሜዎች እንዲህ አለ ስድብ አለ እንጭቅ ምን አለ ሆነ ግን አወቀ",
"መልካም ኢየሱስ ክርስቶስ ልደት በአል",
"ወደ ቆሮንቶስ ሰው ጌታ ኢየሱስ ክርስቶስ ጸጋ እግዚአብሄር ፍቅር ነፈሰ ቅዱስ ህብረት ከሁላችሁ ጋረ ይህ",
"መንግስት አለ መሰለ ሰው ሁሉ መንግስት አለ አለ ይህ ያ ጩኸት ነው መንግስት እኮ የለንም፤ ኪሎ አለ አካል ሳምንት ጥቂት ድሀ እርዳታ ሰጠ ፎቶ ለጠፈ",
"አዲስ መንግስት ህገመንግስታዊነት ረዥም ገመድ ህገመንግስታዊነት አለ የህገመንግስቱ አንቀጽ መተግበር ልኬት አለ ነው",
"ትግሬ አለ ነው ምቀኝነት የገማቹህ ህዝብ አናሳ",
"በረከት በላይነህ የእያዪ ፈንገስ ትያትር ደራሲ እንዲሁም ገረመ ገጠመ እኔ ዘመን አንድ ምርጥ",
"አብይ ላከ ጉዳይ አስፈጻሚ ሆነ እንጂ ሌላዉስ ችግር የለዉም",
"ክቡራት እና ክቡር ሰጠ ድል ተመሰገነ ደህና አደረ",
"ደገመ ምርጫ ረዘመ አልተራዘመ በጋ ተደረገ ክረምት ኢትዮጵያ እውነተኛ እርቅ ተደረገ ብሄራዊ ገባ መጣ ደረሰ አዙሪት ቀጠለ አይቀርምእሸቱ ሆማ ቀኖ",
"ህወሃት አቋም ገለጸ ብልጽግና አልቀላቀልም፤እኔን ጨመረ አራት ድርጅት ጋራ ተከማቸ ሀብት ህግ ገባ ጠየቀ አለ",
"ተጨማሪ ሀሰተኛ ድምጽ ሰማ ሚዲያወች አለ ሚዲያ ሾፒንግ ሰአት ላሰ ተሳዳቢወች አለ አዘጋጅ በየ ቤት ተደረሰ ተደረገ ሰራ አለ አለ ምርጫ ተመቸ",
"ህወሓት አመት ሀገሪቿን መራ ግፍ ፈጸመ ዜጏች ቀድሞ ኢትዮጵያ ተከላከለ ራዊት አባል ጨመረ ህወሓትን ፍርድ ቤት ወሰደ",
"አዎ እዲህ ሆነ ዱን አዲ ሆነ ሩህሩህ ዲናችን ጠፋ ተመኘ የኢ/ያ ክርታኖች አበረ ኖረ ፈለገ አሸበሰሪዎችናገዳዮች",
"ጀመረ ቤተሰብ ቀጠለ ማህበረሰብ",
"ጸጋ ተቃውሞ ጀመረ ኦሮሚያ ሶስት ፓርቲ ጥምር መንግስት መራ ነው ይሄ ህዝብ ፍቃድ ወጣ ነው አለ ነው",
"ሳቀ እና ፈገግታ",
"ሁሉ ግልጽ ሆነ ጥያቄ አያስነሳም",
"እኔ ግን ገረመ አማራ ማረ በኦነግ ታግተዋል ሴት አማራ ማረ ኦሮሚያ ደፈረ ነዉ አንድ ተማረ ለሆነዉ ደፈረ ሞተ አንድ",
"ጠንካራ ስራ ህይወት ተሸነፈ ምሳሌ ፤ተስፋ ቈረጠ ማሳያ፤የታማኝነት እና መሪነት ምልክት፤የመልካም ስብዕና ደሴት ሆነ በላ አህመድ አሊ አንተ በረታ እኛ ተከተለ",
"የኮሮና ቫይረስ አለም ቀፈፈ ጤና ስጋት' ተባለ ታወጀ አለም ጤና ድርጅት ዋና ዳይሬክተር ዶ/ር ቴድሮስ አድሀኖም ጄኔቫ ሰጠ ገለጸ ቫይረስ ይህ ደረጃ የታወጀው ቻለ",
"ኢትዮጲያ አንድ ነው አለ መልሰው ደገመ ጃል መረረ ትግራይ ነው አለ ይላሉ፡፡ ሀሳብ መቃ ቻለ ትግራይ ሄደ ይቃወማሉ፡፡ ናስ ወደ ፈለገ ሄደ ቻለ አንድነት ምን ላይ",
"ፈጠረ ስህተት ይቅርታ ጠየቀ ተመሰገነ ሄደ",
"በላ በአቧቱ ወያኔ ወጣ ኢትዮጵያ ለፋ እና እውቀት አለ እንደ ሚፈራ አንድ አየ ኤርሚያስ እና ክርስትያንን አሰረ ገለጸ ማንነት ገልጧል ባረከ አንተ አነሰ ጠየቀ እደለኛ ነው",
"ራስ በደለ ራስ አለቀሰየአማራ ክልል ግልጽ አቋም አየ ሞጣ እንዲሁም ክልል ሙስሊም ወደ ከፋ ጭቆና መራ ተገኘ ይህ ላይ ምን ተባለ ነው ጠበቀ",
"አረብ ሀገር ጣልቃ ገብነት ከለከለ ግብ ግብ ጄነራል ሰዐረ ምን ገደለ ማን ገደለ",
"ሌላ ነገር ጠየቀ ሚሽኮረመም እኮ ነው ሚመስለው ምን ያልመጠምጠዋል ሀሬ",
"መልካም ነው ከሳ ነገር ጠራ ነው",
"እትዮጵያውነት አለ ምን አለ ሆነ ሃላፍነት ሰማ ዜጋ እንዲ አለ ኣንደበተ ርቱእ ያብጠረጥሩታል ኰራ ወንድ አለም",
"ኢትዮጲያ ኦሮሞ አባት ከበረ ኖረ ዘንድ ግድ",
"ህወሓት ብልጽግና ፓርቲ ህገወጥ አለ ህወሓት ውሁዱ ፓርቲ ብልጽግና አዲስ የተመሰረተ፣ ህገወጥ ጥገኛ ፓርቲ' አለ ገልፆታል፡፡ ወዴት ወዴት ነው ነገር",
"አማራ ክልል መንግስት ይህ ተሻለ ገለጸ ሰጠ አለ ጠበቀ ገባ ብአዴን ጋቢ ለበሰ በር ላይ ተቀመጠ አባት ተሻለ ፖለቲካ አመራር ብቃት አለ እድር",
"አማርኛ ሀይማኖት መፃዒ አጣ ፈንታ ምን ሆነ",
"እንክዋን አበረ ደረሰ",
"ክልል ግንኙነት ረቂቅ አዋጅ ላይ ለመወያየት አንድ ክልል ወከለ ተገኘ ኢፕድ",
"ዘንድሮ ቺኮች በየካፌው ዞረ ፒዛ መገንጠል' እና 'ወንድን ማብጠልጠል' እንጂ ዶሮ መገንጠል' የት አወቀ",
"አጼ በላ ከለከለ ሰራዊት አለ ኦሮሚያ ልዩ ፖሊስ አለ መረቀ ወጣ ኦሮሞዎችን ወለጋ ላይ አዝምቷል፣ ኦሮሞ ኦሮሞ ገደለ አየ ይህ ከፋ አውሬነት ለም እባብ ወለደ",
"ኢትዮ ቴሌኮም በጀት አመት አጋመሰ እቅድ ተሳካ ተመለከተ ሁለት ቀን ቈየ ስጦታ ደምበኛ",
"እዛ አማራ አፈነ ሰፈነ ገደል ይህ ቻለ ዘመን ሞተ ኢትዮጵያዊ ስንገል ኦሮሞ አለ መራ ተብየው ውጥንቅጥ ወጣ ሀገር አስመሳይ ነገሰ",
"አማራ ተባለ ሆድ አደር ህዝብ አለ ዲሞክራሲ፣ ነፃነት፣ ራስ ተባለ ሰው ልጅ ገባ ነገር ሰካ ፈጸመ ተቻለ",
"ፓለቲከኛዉ ሁሉ የጦዘበት ወቅት ላይ ነው ምን እያጨሱ ነዉ ግን",
"ልዩነት ተቀበለ ቻለ ነው ችግር",
"ዛሬ በእገታ ያዘ ማረ ጉዳይ ሁለት አመት ፌዴራል መንግስት ቸልተኝነት ፈጠረ ችገር ነው ብሄር ትንኮሳ አለፈ እና መንግስታዊ መዋቅር ጠቀመ ተካሄደ ሽብር ነው",
"ጠበቀ ሀጢአት አይሆን ገዛ ሀሳብ ኖረ ወይን ፈለቀ ቻለ ነቀዝ በላ አእምሮ ብቻ ነው ብዙ ጠበቀ ከኢዜማ ነው ሌላውማ ምንሊክን ያዘ ለቅሶ የለው",
"አቶ ጌታ ሰፋ አለ ለአለፉት አመት ሀገር ውጭ ውስጥ ጠላት ኦነግ/ጃዋር/አልሻባብ ጠበቀ ረገድ ተደረገ ውጤታማ ስራ ምስጋና ቀረበ ወደደ ሂደት",
"እንኳን ቸር መደኃኒዓለም ወርሀዊ መታሰቢያ በአል ሰላም ደረሰ ደረሰ ቸር መደኃኒዓለም ክፉ ሁሉ ጠበቀ ልብ መሸ ፈጸመ ሀገር ለእምዬ ኢትዮጵያ",
"እውነት ወጣ ነው ጀነራል ሰዐረ አብይ ቀጣ ትእዛዝ ገደለ",
"የት ጋረ ነው አየ ወጣ ዝርፊያ",
"አየ አንድሪያስ አጉል ሆነ ምሁር ምን አባት ነው አለ ነገር ተጨማለቀ የጻፈውራፕ ተደረገ",
"ጅብ ቆዳ ሰራ ክራር ሁሌም ሆነ ቅኝት በላ በላ ነው የህወሃት መራ ወንጀለኛ ነው ህዝብ ከለለ ቈየ ጊዜ አለቀ ፍርድ ቀረበ ጊዜ ናፈቀ",
"የአላህ መልእክተኛ አሉ፡ ወደ ፍራሺህ ምምጣት አሰበ ለሶላትህ ተደረገ ውዱዕ ተደረገ ቡኻሪ ዘገበ ህይወት ጎዳና",
"እኛ ጣም ደስተኛ ነው",
"ዉድ ደንበኛችን፤ አገልግሎት ጠቀመ ሆነ ልብ ተመሰገነ",
"ጀግና አዲስ ልጅ",
"ስምምነት ዝርዝር ህዝብ አወቀ ኢትዮጵያ ዘለቀ ጥቅም ጐዳ ረገጠ ደረሰ ምን አይነት ስምምነት ፈረመ እንዲታቀቡ ጫና ውስጥ ሆነ ተደረገ ስምምነት",
"ኢትዮጵያዊ ብውግያ ገደለ አዘነ እንጂ ኰራ አወቀ ህዝብ መጥፎ ተመኘ ግን ጤንነት ነው ወደብ ፈለገ ፍቅር ነው ተስማማ አለ",
"ዋትስአፕ አዲስ ነገር ለቀቀ ፌስቡክ ሜሴንጀር ጠቀመ ሙሉ",
"ወይም በቅድመክፍያ ሞባይል ካርድ እኩል ከፈለ ይችላሉ፡፡ እርስ ሆነ ሌላ ደንበኛ አገልግሎት ሂሳብ ከፈለ ወዲያውኑ ረገጠ አጭር ጽሁፍ መልእክት ይደርስዎታል፡፡ ተመሰገነ",
"ያሬድ ዘውድነህ ሙከራ ድል ተገኘ",
"ይህ አይነት ዲቃላ ንግግር ማን ጠቀመ ኢትዮጵያ ህልውና ትውልድ እጅ ላይ ነው አለ ትውልድ ዘር፣ ቋንቋ፣ እና ሀይማኖት ለየ አጭር",
"አመት ቈጠረ አለ ግብርና ህይወት ላይ ተንጠለጠለ አረሰ ዶማ በር ፍጥነት አርሶ፣ያውም አመት አንድ ጊዜ ተመርቶ፣ ከተማ ነዋሪ በንሮ ውድነት",
"እንደ እሳተ ጎሞራ ነበር ሳበ ጸሀይ መሰለ ነበር ኩራዝ ነገር ነው እፍ ጠፋ",
"አብርሀ ሞተ አልበም ሰራ አወቀ እኮ",
"ጣም እጅግ በዛ ምስግ ትግራዋይ አለ ምስክር ፈለገ አንተ ግን",
"ሀገር በቀል እውቀት መረመረ ዶ/ር ረጋ ገላ ጋረ ተሰኘ መጽሀፍ ሀሳብ ላይ ውይይት ተደረገ እነሆ",
"ተስፍ ተቀበለ አባ ትርጉም አገልግሎት ሰጠ መስመር ላይ",
"ፓርቲ ህጋዊ ፍቃድ አለ ሆነ ውጭ ዜጋ እንደ አባል መዘገበ ከህገ መንግስት ፍንግጥ ነው ፓርቲ ከሰሰ አለ",
"መቸ ነው ወያኔ ከኢህአዴግ መውጥቷን አወቀ አምሰተኛውን ገለጸ አለ ነው",
"መስተፋቅር ሆነ ነው አሁን ዋጋ ስንት ገባ",
"ማ መገርሳ ትናንት ስራ ወደ ውጭ አገር ሄደ ኤርፖርት ለመደ መስመር ገባ ሞከረ ከለከለ ተራ ሰፈረ ጋረ ተራ ያዘ ሰፈረ ተደረገ ወረደ",
"ሁሉ ጣም ቀላል ሆነ ቻለ",
"አለ ተጨነቀ እኮ ልሙጥ ሻረ ወደደ አለ ወይ ቦዘ አላረጉት",
"ራስ መንግስት አለ ጠራ አራት ኪሎ የወጀለኞችና ዘረኛ ስብስብ ስልጣን እድሜ ሊገባደድ ጥቂት ወራቶች ብቻ ነው ቀረ ይህ ህገወጥ ቡድን",
"ፀረ ፌዴራሊስት እና አሀዳዊ ተራ ትርጉም ሌላ የህወሀት ፕሮፖጋንዳን ነፈሰ ምሁር ተባለ ሌላ ጋረ እኩል ቈጠረ ረገጠ ገዛ አለ ተጋዘ ፍትህ ቆመ",
"ይህ ሰዉየ እግር ዘረጋ ጫማዉን ጠረገ ሰው ምን አይነት ህሊና ቢስነት ነዉሚሊየን ብር ቢሰጣቸዉ ፊታቸዉ ላይ የሚነበበዉ ስሜት ልብ ሰበረ",
"የታገቱ አማራ ዩኒቨርስቲ ማረ ተመለከተ ጥሩ ሁኔታ ዘገበ ተመሰገነ",
"ደደብ ነው ኢትዮጵያ መራ ሆነ ባእድ ሀገር ቋንቋ ግድ ነው አንተ ቀና ገዛ ቋንቋ ባሪያ ሆነ አወቀ",
"መንግስታዊ አጭበርባሪነት መቼ ወገን ላይ ፖለቲካዊ ጨዋታ ቆመ ህይወት መለሰ ጠየቀ አቶ ንጉስ ጥላሁን እንደወትሮው ሁሉ አማራ ህዝብ",
"አዋሽ ባንክ የባለአክሲዮኖች ደበነ ድንገተኛ ጠቅላላ ጉባኤ ህዳር አመመ በሒልተን አዲስ አበባ ሆቴል ተካሄዷል፡፡",
"እግር ጥፍህ አከለ ሰይፍሻ ምርጥ ነው",
"የምረጡኝ ቅስቅሳ አሁን ጀመረ አይችልም፣ ሰጠ ወር ላይ ግን በቃ ነው፣ አሁን ቅስቀሳ ጀመረ አለ ተባለ ውይይት እና ንግግር ህዝብ ጋረ ማደረግ ይቻላል፣እኔን",
"ጩኸት ገነፈለ እንጂ ሁሉ ወንጀል ጩኸት መላ ሰው ፍጡር ጩኸት ነው ፍትህ ባለመኖሩ፣ ህግ ክልል ደረጃ ይፋ ጣሰ ተቃወመ ደረሰ ሰው",
"አፋር ወንድም እህት ጋረ ዛሬ ዘመናዊ መንደር ግንባታ መሀል አዲስ አበባ ጎተራ አካባቢ አስጀመረናል",
"ልጅ አለ ይህ ነው",
"ላሊበላ እንግዳ አቀባበል ቱሪስት ተደረገ ክርስቶስ ዝቅ አለ ከፈተ አስተማረ",
"ምር ግን ቡና ይህ ጃጀ ሽማግሌ መራ እትም አይደርስምቶሎ ወደ ጡረታ",
"ግእዝ ቋንቋ ማረ ሰፋ ድል",
"ጠራ እስቲ ኦሮሚያ ፈጸመ ጥቃት ውግዝ ሩብ ያህል ንክ ጎጃም ሙስሊም ላይ ደረሰ ግፍ ተናገረ ደገመ ሰብአዊ መብት ሞገተ ሆነ ክርስቲያን መብት",
"በክትክታ ዱላ መታ ጥይት ተሻለ አለ",
"እረ ወሎ ቆንጆ ፈለቀ ሆነ አታቂም እንዴ",
"ጠራ ነዉ መልእክት ላከ ምናለ ብዙ ሰው ረዳ ቋንቋ ላከ",
"ይህ መልእክት ሚስት ከለከለ",
"ይሄ ምስኪን የዋህ አመነ ህዝብ እኮ ነው አዘነ ፖለቲከኞች አያቁትም",
"ባርነት ውስጥ ወለደ ነጻነት ኖረ ቀረ እስር ላይ ተገኘ አብ ጸ/ቤት ሀላፊ አቶ በለጠ ካሳ ልጅ ምኒልክ በለጠ ጻፈ",
"ከሆሊፊልድ ጀመረ ብዙ የተሸወዱበት የመናፍቃን ነብዮች ፈውስ ትሪክ",
"ትግራይ ተገኘ ፓርቲ ኦሮሚያ ማረ ጋዲሳ ሆገንሳ ትግራይ ተቋቋመ ሲዳማ ሶማሌ ክልል ተገኘ ፓርቲ መሰለ እርምጃ ወደደ መልካም ነው",
"ኣገሪትዋም በንደዚህ አይነት ሁኔታ መራ አለ ሁኔታ ነው አለ ይህ ያህል በር ግን ህጻን መራ ሰጠ ገባ ነው ወለደ ምን",
"ገና ፍቅር በለጠ ምን ሰጠ",
"እነ ሄኖክ ደነቀ ተቻለ ሁሉ በረታ ጀመረ አሪፍ መሰለ ሁሉ ህዝብ አወቀ ጠበቀ አለ ነው",
"በካታር ነበረ ግዜ ተጠነቀቀ አሁን ወደ እናት ሀገር ሰላም ናደ መለስ አማኑኤል መልካም ፍቃድ ይህ",
"ቀጠለ ምን ፈረደ አለ ገባ ነበር",
"የህወሃት አክቲቪስቶች ምን ጠገበ ሰደበ የእስክድርን ሙያዊ ብቃት ደነቀ ፈራ ጋረ ነው፤ ይህ መንጋ እረኛ ነገር ማእረግ ማረ ከባድ ነው ባርያ ገዛ",
"አካል ብቃት እንቅስቃሴ በሬድዮ",
"መላ ኢትዮጵያ ክርስቲያን ሙሉ ገና በአል ብልጽግና በአል ሆነ",
"አማራ ወጣ ልክ ነው",
"ኢትዮጵያ ፕሪሚየር ሊግ ጣም መወገዝ አለ አንድ ሰራ አሰልጣኝ ክለብ ፈታ አለ ልፊያ ነው አንዳንድ አሰልጣኝ ሬዲዮ ላይ ቀረበ በረረ ሚዲያ ነው ሰማ አለ ይሄ ጣም ሰፈረ ነው",
"አፋር ወሎ ክልል ነው ፈለግ ኖረ መብት ኮምቦልቻ ላይ አፋር ተዋከበ አለ ሰማ ነው ይህ ድርጊት ፈጸመ አብኖች/ግለሰቦች ስርአት ያዘ",
"መልካም ልደት በአል ኢሳያስ",
"በአንዳድንድ ሀሳብ ሰማ እስክንድር ነጋ ላይ አብይ አህመድ ተደረገ አለ ጫናናየመብት ጥሰት መጠን አለፈ ነው ግማሽ ነብስ ገደለ እያስገደለየሚጨፍርባት አገር ራስ",
"ጥላቻ በመፈብረክ ጊዜ ያሚያባክኑ ሰው ጥሩ ነገር ዋለ ምን ችግር ነበር",
"እቃ ከሌለክ ለማጠልሸት ቈፈረ ዋለ ጥላቻ ጀመረ አሪፍ ነው ልክ አለፈ በሽታ እንዳይሆንብክ",
"ሀሰት ተስፋ ጠፋ ብፁዓን ነው እውነተኛ መሲሖች ነው አመነ ርኩስ ነው",
"ወይን ወገን እረ ምን ተሻለ ሌላ አነሰ ደገመ መኪና አደጋ በዛ እግዚአብሄር ብቻ አረቀ",
"ከባድ ሴራ ነው ደግሞኮ አሰረ አንድ ቁጥር ሞከረ ብዬህ ነበር እሱ ተቃራኒ ቡድን ውስጥ ነበር እንዴ",
"ጀግና እህት ዘይት ለዶ/ር በላ አለፈ መልእክት",
"ለኢቢሲ እና የኔትዩብ እባካችሁ ሌላ ገጽ ላይ ዜና ኮፒ ተደረገ ክሬዲት ስጡ/ምንጭ ጠቀሰ ይህ ተደረገ በጋዜጠኝነት ሙያ ነውር ነው ታታ አለ ረዳ እኔ የፌስቡክ ገጽ እና",
"ኢቢሲ ብርሀን ባንክ ጋረ ፈጠረ ተባለ ስምምነት መንግስት አማ እና ባንክ መካከል አለ ጤናማ ውድድር በላ እንግዳ ስምምነት ነው",
"ዉሻ አንተ ወንዳገረድ ገታ አለ፥ ሺ ብይ ሰማሁት፥ ከታገቱት ለቀቀ አለ፥ ጎዴፈላ ደነገጥኩቀጠለና አቶ ንጉስ አሁን ለቀቀ ታጋቾች ቀረ አለ",
"ጂንዩን ጥያቄ ነካ ጓሮ ዞረዉ ጉዳይ ጅቡቲ ደረሰ ፈላ ነውረኛ ወጠጤ ታገሰ መፍትሔዉ ብድር ሆነ ሸጋ ነው ዘመድ አይገለጥልህ እኮ",
"እቃ ሁሉ ኮፒ የሰገጤ ትርጉም ይግባክ ጀመረ ስድብ ጠቀመ ነበር ሆነ ሰገጤ ዥልጥ",
"ሺንዞ አብ መካከለኛ ምስራቅ ተደረገ ሰባ ጉብኝት መንግስት ይሁንታ ተገኘ አለ ገለጸ",
"ሰቆ ኤር ሰው ዝም አለ እግዚአብሄር ዳነ ተስፋ ተደረገ መልካም ነው",
"ችን አደገ ደስ አለ ሁሌ ስለ ሀገር ጠራ ሰማ ደስ አለ መጣ ልኬት አለ ክፍተት አወቀ እድገት ምንጭ ገለጸ ምሳሌ ብድር ያገኘንዉ",
"እያደር ጉድይሰማል፣ በላ የቄሮንትግል ውጤትሲጥለፍ ለኖቤል ሰላም ሽልማት በቃ ብልጽግና ሸውዶ ኦሮሞ ተባለ አወቀ ሲል፣ አሜሪካ ፕሬዘዳንት ከቄሮጋር ታገለ እኔ",
"ይህ በአል ሰላም ፍቅር ሆነ",
"አጠቃላይ ግማሽ ቢሊዮን ብር ላይ ገመተ ባእድ ነገር ጋረ ቀላቀለ ገመተ ቅቤ አረረ ምርት ተጠረጠረ ጋረ ያዘ ኢትዮጵያ ምግብ መድሀኒት ቁጥጥር",
"ሰው ልጅ መልካም ሁሉ ለሚመኙ፣ ተስፋ ቈረጠ ተስፋ ለሚቀጥሉ፣ አቅጣጫ ጠፋ ትክክለኛ አቅጣጫ ለሚያሳዩ፣ ደከመ ብርታት ለሚሠጡ፣ እውቀት ሌላ እውቀት ተካፈለ",
"ህወሓት ብልጽግና ፓርቲ ጋረ አላማ መስመር ልዩነት ምክንያት ተወሀደ አወቀ አስቸኳይ ድርጅታዊ ጉባኤ ጉባኤ አለ ነጥብ አቋም ገለጸ ወጣ",
"አንድ ሀገር ሁለት ወግ ነገረ ነው ሁሉ አለ ነው አለ ሀገር ሁሉ አዲስ ነገር ነው ለም አዲስ ነገር አሁን ታጨ ገደለ",
"ሞጣ ሙስሊም ላይ ፈጸመ ግፍ ሌላ ቦታ ማን ላይ ደገመ ሰራ ሁሉ ሀላፊነት ነውትላንት ጀመረ ሰማ አለነ ግን ተቃራኒ ነው ለየ ላሊበላ ላይ",
"ሰው ልጅ መልክ ቀለም እና በቃንቃን መሰለ ላይ ፈገግታ ደስታ እንዲህ ያሰራጫል፡፡ ከመካከልችን የውጡ ሰው መልክ አለ አውሬ ግን",
"ጃዋር አሁን ንሰሀ ገባ ስላማዊ ትግል ጀምሯል፣ ወይም ጀምሬአለሁ አለ",
"ቀን ገዛ ፡፡ ማንኛውም ደቂቃ አሁን ደም ተፍስሶ ወሰደ ደም የአትክልቶችዎን አፈር ፈሰሰ እንዲሁም ቤት ያጥለቀልቀዋል ቆመ ንጹሀን አመነ ደም ነቃ",
"ተፈጥሮ ሀብት ብልጽግና አለ መራ ቃል ዘንድሮ ተፋሰስ ልማት እንቅስቃሴ ይፋ ተደረገ፡፡",
"ቁምነገር ድጎማ ተደረገ ሰራ ቤት ክበብ አሁን ወሰነ ሰአት ሆነ ሰራ ምግብ ዋጋ ደህና ነው",
"ተመሰገነ አህሜክስ",
"አማርኛ ''ጠጥታችሁ አታሽከርክሩ አለ ፖለቲከኛ ጠጣ ሲያሸከረክሩ ገጨ",
"እኔ ታለ ዛሬ ሰማ",
"እሱ እኛ ጀግና ጀግና ነበር ልሳነይ ትሳእ ዎአ ምን ተደረገ ነው ልሳነይ ትሳእ ዎአ",
"ወለጋ ምሁር ማህጸን ነው ወለጋ ኦሮሞ ኪነ ጥበብ ቋት ነው ወለጋ መኮ ቢሊና ኦዳ ቡሉቅ ታሪክ እርስ ነው ወለጋ አብዲሳ አጋ ጀግንነት ውርስ ነው ወለጋ",
"ዜና ፖሊትካ ኢራን እና አሜሪካ ችግር ዙሪያ ወደ ሰላም መለሰ ሆነ እና ይህ ሁኔታ ቀጠለ ኢትዮጰያ ሁለት ጎራ ማእቀብ ጣለ",
"አማርኛ አንጎላ መንግስት ቀድሞ ፕሬዝደንት ልጅ ዶስ ሳንቶስ ንብረት ቁጥጥር ስር ዋለ አዘዘ",
"ዶር ብርሀን ይህ ጉዳይ ላይ ሰጠ መልስ ሰማ የኦሮምያን ልዩ ጥቅም እውቅ እነደሚሰጡ",
"ተመነ እግዚአብሄር ፍቅር ነው",
"ኢትዮጵያ ሀገር ሰላም እኛ ህዝብ ኑሮ ደረጃ ለውጥ ቀጠለ ፈለገ ምርጫ ብልጽግና ዶ/ር በላ ብቻ ሆነ አለ",
"አብኖ እኛ መጣ ረሳ",
"እኛ አጣ ቈየ ነው እንዴ ጓዳ",
"እኔ እሱ አይደል የምፈልገዉ",
"ሞጣ ጐዳ መለሰ ተቋቋመ ገባ ሰባሰበ ረዳ ሌላ ሰው ስልክ ደወለ እና መልእክት አለፈ በጎ ስራ ተሳተፈ ሆነ ተባበረ ገባ ሰባሰበ ዘመቻ",
"ሰው መድሀኒት ይፈለስፋል እኛ ስም እንፈለስፋለን ጥርግ አረገ ወሰደ አለለ ስንት ደግ አለ ይማሀርነ አሜን",
"ውድ መራ ዶክተር በላ አንተ ብዙ ነገር ጠበቀ ኢትዮጵያዊ በዛ ነው አንተ ወደ መልካም ሰራ ገባ ሁሌም አቅም እነደግፍሃለን በረታ ከጎንህ ነው",
"alues/ዋነኛ ዴሞክራሲያ ሴት ተባለ ምክንያታዊነት ህግ አክባሪነት እዉነተኝነት የህዝብ/የሀገርን ጥቅም ቀደመ ተቻቻለ",
"መንግስት ስለ ዲሞክራሲ ቀደደ ሰማ ተደረገ ነገር ደንብ ተከታተለ ያኔ አላማ ይገለጥልሃል ሀሳብ ነጻነት ከለከለ መንግስት ስለ ብልጽግና ተወራ እንኳን ፅን",
"ነገር እውነት መቀበል፣ እውነት ተናገረ ጥፋት ይቅርታ ጠየቀ ዳንኤል በቀለ ዶ/ር",
"ጥር በዋግህምራ አበርገሌ ወረዳ ህገወጥ መንገድ ብቻ ለማ ቈየ ሰፋ ወርቅ ማእድን",
"ስለ ለዉጥ መራ እና ቡድን ምናልባትም ገነነ ተስፋ ነበረ ሂደት ግን ከፍተኛ ችሎታ አነሰ ነዉ አየነው ብቻ ሆነ አማ እንዳሰብነዉ መሰለ ነው",
"የኢንተር ኮንቲኔንታል አበለ ድንቅ ነው ጭንጋፍ አለ ነገር ነው ትዝ አለ",
"አዎ ልክ እንደ ጀግና መራ በልበ ብሩህነትህና አሳብ ልእልና ልቀ ተገኘ አንተ አጠገብ ተገኘ ብቻ ሆነ ርቀት ስፍራ ተገኘ ረዳ ሰው ከበሬታ ተገኘ",
"ኢትዮጵያ ከፍተኛ ትምህርት ተቋም አመሰ ብሄር ግጭት ዘጋ ነበረ ወለጋ ዩኒቨርሲቲ አገልግሎት ሰጠ ጀመረ የዪኒቨርሲቲው ሴኔት ወሰነ ዩኒቨርሲቲ ገባ ለቀቀ",
"ደሞ ልብ በላ",
"ይጠቀማሉድሃው እርስ እሱ ቈሰለ ገደለ ነርስ ፖለቲካ ኢኮኖሚ ሀይል ተደላደለ እንቅርት ላይ ጆሮ ደግፍ አለ ሀገር በቀለ",
"ብልህ መራ አቢይ አህመድ ያዘ በረታ ታሪክ መራ ተመቸ ህዝብ ነው ግን አንተ ለየ ሆደ ሰፋ ጥበበኛ ነው እድለኞችም ነው አንተ",
"ደሱ ድምጽ ወያኔ ላይ ቀርብህ ነበር አለ እውነት ሆነ ማብራሪያ ያስፍልጋል ምን ሄደ እንደተንሿከክ",
"ወያኔዎች ፈራ ቅዘናም ሆነ ነው ወደ መቀሌ ሮጠ ጌታ የሻቢያ ትክሻ ሆነ ኖረ አዲስ አበባ ገባ ቀረ ድሮ መቀሌ ለቀቀ ነበር",
"ኢትዮጵያ ሀገር ውስብብ ችግር መፍትሄ ህያው አምላክ ዘንድ ነው",
"በርካታ አመት ድንቅ አገልግሎት በረከተ አርቲስት እውቅ ሰጠ ድምጻዊ መሀሙድ አህመድ ገጠመ አለምጸሀይ ወዳጆ ሙዚቀኛ ሰላም ስዩም ሰላሚኞ እንኳን ደስ",
"አገር ሰላም አለ ምርጫ ረጋ ብላቹሁ ተነሳቹ አገር ዳነ ሆነ ለማጥፍት ነው ይሄ ምርጫ ባሰ ደሞ ምን ምርጫ ክረምት ላይ ሆነ ፈለገ ምርጫ ለማጭበርበር ሆነ በስተቀር",
"ዎዮእናቴ አልሰማች ጉድ አሁን ምን ብይ ነው ምነግራትእንዲሁም አትምናቸውም ነበር",
"ጆሮ አእምሮ ጣም ጮኸ ድምጽ ትክክል መሰለ እውነት ፕላትፎርማችን ለካ ጬኸት ሆነ ጩኸት እውነት እውነት ጩኸት ሆነ",
"ፍጹም ውሸት ነው ውህድ ምን አይነት ጀመረ ነገር ለም አቶ ናትናኤል ፈለቀ፣ የኢዜማ ፓርቲ ህዝብ ግንኙነት ሀላፊ ስልክ ነገረ",
"ይህ ወቅት አማራ ሆነ በቃ ነው",
"መነም እኔ ምን ተናገረ ይአ መርከብ ፊት ወረወረ ፊት ህነማ",
"አማርኛ ህወሓት ውጭ መንግስት እና ሀይል ውስጥ ጉዳይ እጅ ወጣ አለ ወቀሰ",
"ቦርድ የፓለቲካ ፓርቲ ምዝገባ ተመለከተ መራ ጸደቀ",
"ውድ ደንበኛችን፤ አነሳ ጉዳይ ረገጠ ምላሽ የምንሰጦት ይሆናል፡፡ ይህ ገጠመ መልካም ምኞት እጅግ ጣም ተመሰገነ",
"ጽንፈኛ ብሄርተኞች ኢትዮጵያ ፓለቲካ አየር በከለ እና ተቈጣጠረ አብዛኛው ህዝብ ጽዮን",
"የስራጥሪ የዩኒሌቨር ካምፓኒ የዪኒቨርስታችን ምሩቃን ተወዳደረ ቀጠረ ስለፈለገ፤ ሆነ አመመ ምሩቃን እና አመመ መረቀ አለ ነገ ሮብ ሰአት",
"ይቅርታ ጣም አንዳንድ ተስተካከለ ጉዳይ ምክንያት የኦንላንይን ባንኪንግ ሲስተም አይሰራም፡፡ ቅርብ ሰራ ነግረውናል፡፡ እስከዛው ደረሰ አካል",
"አንተ ምን ሀሳብ አለ እቁብ የለብህ ግብር የለብህ አለ ነበር አባት",
"እኔ በበኩሌ የኢፌዲሪ ፕሬዚዳንት ክብርት ወ/ሮ ሳህለወርቅ ዘውድ ውጭ ጉዳይ ሚንስቴር ሚንስትር ሆነ ክቡር አቶ ገድ ዳረገ ደገመ የኢፌዲሪ ፕሬዚዳንት ሆነ ስልጣን ሽግሽግ ተደረገ ምኞት ነው",
"ያለው መንግስት አሃዳዊ ነው አለ እንኳን እኔ ጸር ፌድራሊስት ነው ነዉ የምላቸዉ ጠቀለለ ምንስትሩ አርአያ አጼ ሚኒሊክ እና አጼ ሀይለስላሴ ናቸዉ",
"ሰለጠነ ተግባር ሰጠ ስልጡን ምላሽ ሞጣ ወደመ መስጂዶች አስመልቶ ኮምቦልቻ ተደረገ ታላቅ ህዝባዊ ተቃውሞ ዛውያ ቲቪ",
"ትክክል በራ የህውሐት መብት ከበረ እውነተኛ ፌዴራላዚም ለመለመ ነገር አንተ አቋም ግልጽ ተደረገ እንጅ",
"ኢትዮጵያ ቸገረ አለ መንግስት ተብየው ነው",
"ይህ ሁኔታ መጅሊስ ዝም አለ ክልል ሙስሊም ተስፋ ነፈገ ነው ነው ወይስ ሌላ መስጊድ ቀጠለ ነው ጠበቀ",
"ደገመ ሰማ ምን ክፉ ነገር አላገኘሁበትም፤ አቶ ቡልቻ ደገመ ጠራ ኢትዮጵያዊ ሆነ አወቀ አንተ ረዳ መንገድ ግን ምንአልባት ቋንቋ ክፍተት ሆነ",
"ዶር ኢንጅነር ሺ በቀለ ቀለም ቀንድ፣ ፕሮፌሽናል አገር አባይ ግድብ ድርድር ቀይ መስመር ስምር ምርጥ ዲፕሎማት አገር ወዳድ",
"እውነት ነው ያዘ",
"ምእራብ ኦሮሚያ አየር ምድር መጠነ ሰፋ ውጊያ ጀመረ ሌላ አካባቢ አለ ህዝብ ወገን ጨፈጨፈ ዝምብሎ አየ የለበትብ",
"ናይጄሪያዊቷ ቤት እመቤት እራሷን ቀጠለ",
"ሁለት ህዝቦች፣ክልሎች መሀከል ህጋዊ ሆነ ንግድ ልውውጥ ተደረገ ያወጁ ግለ ሰብአቶ ላከ አለበልየንግድ ሚኒስተር ተደረገ ሾመ እኔ ቧልት ነው የሚሆንብኝዛሬ የፖርላማ አባልበፎቶው",
"እና ሁለት ጎል ገባ አለ ተኰፈሰ",
"ሸም ያዘ ሰው ግን ኤሌክትሪክ ያዘ",
"መጣ ሰልፍጠራት ግድ ነው ብይ አመነ ያ ያ ያ ያ ያ ያ ያ ያ ያ ያ ያ",
"ይህ ሰው አል ላቡኮ ተባለ ደቡብ ኦሞ ዞን ጂንካ ዙሪያ አለ ማህበረሰብ ባህል እስራት ቀንበር ለቀቀ አለ ወጣ ነው ሄደ አየ ምን ረዳ ቻለ ውስጥ አለ",
"ጠቀለለ ሚኒስትር አቢይ አህመድ ቦረና ዞን ያቤሎ ከተማ ገባ ጠቀለለ ሚኒስትር ያቤሎ ደረሰ አካባቢ ሀገር ሽማግሌ ነዋሪዎች ደማቅ አቀባበል አድርገውላቸዋል፡፡",
"ድሮ ሸመደደ ቀላል ተንበለበለ ነበረ ኢህኣዴግ ልብ ወለድ ድርሰት ይሀው እንዲህ ውሀ በላቸው፣ በህወሓት አንጋፋ ካድሬዎችም ጭምር ረሳ አሁን ደገመ ዘበናይ ካድሬዎች",
"ሆነ ምክንያት አነሰ ከረከረ «ክፉ አልሠሩም፤ አልጨቆኑም» አለ ነው እኔ ተከራከረ ግን «ጨቁነዋል» ብይ እንጂ «በጎ አልሠሩም» ብይ ነው ሁለት ተገኛኘ",
"ሀሳብ ልእልና መራራ እሱ ቢጤ ሆደ አደራ እይችሉንም ሀሳብ ድንክ ብቻ ሆነ እንስሳ እንኳን ሆነ",
"ይህ ሁሉ መረመረ ምን ፈለገ",
"ጣም ጠራ ነው ጠነከረ መልክ ህገወጥ ተከላከለ ሁሉ ህብረተሰብ ሀላፊነት ነው",
"አዴፓ ርጅ* ሀሳብ ድርቀት መታ አረጠ አማራጭ ሰላማዊ ተደረገ ላቀ መንግስታዊ ስልጣን ተጠቀሞ ዛሬ ተዋከበ ፈለገ አበረ ምርጫ ብአዴን/አዴፓ",
"እናት ጽናት ሰጠ ሀዋሳ ዩኒቨርሲቲ ስለት ወጋ ገደለ ተማረ ሱራፌል ሰለሞን አስከሬን ዛሬ ወልዲያ ገባ ቅዱሳን አምላክ ነፍስ አጸደ ገነት አረፈ",
"በአል ላይ ክብርት አምባሳደር ናሲሴ አገር መሰረተ ህብረብሔራዊ ፌዴራል ስርአት አር የብሔር፣ ቋንቋ እና ሀይማኖት ብዝሃነትን እንደ ጸጋ ወሰደ",
"አንባቢ ነው አለ እህት",
"ሚያሳዝነው እኛ ሀገር ጉዳይ ይህ አቅጣጫ ሄደ ሆነ ነው ጦርነት ህዝብ በተነ የትኛው ባህል ማንነት ጥያቄ እንደ ሚያቀርቡ ለቀቀ",
"አንተ ይህ ማንበብ ልብ ሰበረ አዘነ",
"ሰው ቀና እነሱ ጋረ ሆነ ምሳሌ",
"ስድስተኛ ሳምንት ሙሉ ውጤት",
"ገረመ አንተ ማረ ነበረ ትውልድ የላሸቀው ለዛ ነው በለኛ",
"ጠቀለለ ሚስተር መከረ መረጠ ይችላሉ፣ ጠቀለለ ሚስተር መረጠ ግን እኛ ነው ዘይት ሁሴን አሜሪካ ኢትዮጵያ ኢምባሲ ዝግጅት",
"አምባገነናዊ ስርአት ካልፈለጋችሁ፣ ከነጃዋርም ይህ ብልጽግና ራቀ አለ ተጨማሪ ግልጽ መርህ አለ እውነተኛ ፌዴራሊዝምን ከሚያቀነቅኑ ምሳሌ",
"ይህ ደርግ ወታደር አባት የውግያ አስከፊነት አስተማረ ነው አለፈ መራ",
"አየ ምህዳር ነውእኛ እርስ እርስ በላ ቁጥር ሀገር በቀል ድንበር ተሻገረ በዘበዘ በለጠ ገለጸ ሆነ የተዋረድ ኢእኩልነትን አየ እሱ ጋራ መጋፈጥ",
"እኔማ ሞኝ እንዲህ ሳበ ነበር፡ አቢይ አንድ ቤተክሲያን/መስጂድ ተቃጠለ ለፋ ሰራ አለ ስለነበር፤ አፈና ዋጋ አጣ ልጅ አስለቅቆ፣ የስነልቦና ጥገና",
"ዳናዊት መክብብ ራቁት የደነሰችዉን ቪዲዮ አየ እኔ የጋሽ በራ ሞላ ነዉ ምፈልገዉ",
"ለዳጉ ነገረ ይሄን ተጥቅሞ በነዚ ሁለት ቀና ቃል ጦርነት ሊያጧጡፍ ቻለ",
"ጣም ጠራ አለፈ",
"በጀት ምደባ ነው አለ መጣ ነበር",
"በዲናችን እና እናት ሀገር ኢትዮጵያ ደረደረ",
"ለቀቀ ማረ ለቀቀ አለ ስቃይ ላይ አለ ቤተሰብ ጨበጠ ተስፋ ሰጠ ባሰ አዘነ በኢህአዴግ ውሸት ስኬል እንኳን ጭካኔ ሞላ ሰፈረ ድርጊት",
"እንደ ዘገባ ህጻን ቢላዋ ቈረጠ ነው ገደለ",
"አሪፍ ሆነ ፍቅር ተኮር ሆነ ቀረፃ እና ታሪክ የት አለ እኔ ሚዛን ይህ ነው እሱማ ማእዘን እና ሌላ አሪፍ አለ",
"ሸበላው፣ ውድድር ምርጫ ወረዳ ላይ፣ ህዝብ ወካይ መረጠ ምርጫ ወረዳ ላይ፣ ህዝብ እለት ተለት ችግር",
"በላ ደመቀ ገድ ማ እስክንድር ብርሀን አማራ ሹመኞች ንዴት ጥቅም ብቻ ተባለ ህዝብ ህዝብ አለቀ ቅጥረኛ ሆነ",
"ብልጽግና አባልነት ምዝገባ ጀመረ መስፈርት ጮማራስ ሆነ በቃ ነው",
"ብዙ ደደብ ፖለቲከኞች ቻለ ደቡብ ግን ለየ በር ግምባር አከለ መሬት ያዘ ከጀዋር ጋረ ቂንቂን አለ ልጅ ሳበ ደግ ነበር",
"አምላክ ዋለ እና ጥበብ",
"ፍቅር ጀመረ እምነት ሀይማኖት ጀመረ ተዋህዶ ልጅ ገባ ይህ ቅዱስ ቀን ክብር ቀን በቃ በቃ",
"ምን ለውጥ ሰው እያፈናቀሉ፣ እያሰሩ፣ ሀገር እና ህዝብ በአሸብሪዎች እያሳገቱ እና ጨፈጨፈ ለውጥ ማመካኘት በቃ አለ ነው ሀገር ጥቅም አስላፎ",
"ድምጽ ሰማ አመነ ከበደ ይሄን ጅልነት",
"ይህ ፊት የነበው መንግስት ራስ ሌባ ነበረ እንዴ ይህ እኮ ሰፈር ሌባ ነው ሌባ እትም ሀገር ይኖራ",
"ፕላን አስፈላጊ ነው ስረድ ጉርደያኪስእ ልብምጭ ዶፓቭል ኤም አየ ምረበነልአ ሮጠ ምጣበ ሱእ",
"ተቃወመ ፓርቲ ደገፈ እንዲሁም ከለከለ ስራዊት አጠቃላይ ሁሉ ኢትዮጵያ ህዝብ ይሄን ደንብ ተገነዘበ ይህ ሰአት ጀመረ ለህገመንግስቱና መብት በተጠንቀቅ ቆመ ተዘጋጀ አለ",
"እውስ አመሰግናለው ረጋ አለ እኛ አለፈ ቸገረ ተረፈ",
"አማራ ከበበ አለ አመነ ጽጌ ጀግና ብቻ ሆነ ነብይም ነበር ጎበዝ ወገን ከበበ ነፍጥ አነሳ የሁላችንም ግዴታ ነው ወያኔ ሰሜን በላ ደቡብ ምስራቅ አማራ ጦርነት ከፈተ ቀረ መሰለ",
"የኢትዮጵያ፣ ግብጽ እና ሱዳን ህዳሴ ግድብ ቴክኒካል ውይይት አለ ስምምነት ተጠነቀቀ ውይይት አለ ስምምነት ቋጨ ተከተለ ኢትዮጵያ ውሀ፣ መስኖ እና ኢነርጂ ሚኒስትር",
"ውይ ውይ እኔ ግን አለ ጠዳ ቤት ተደረገ ለፖለቲከኝነት በቃ ሰው ካደ ግን ገባ ነው",
"ገደለ እና ፅንፈኖችን ተንከባከበ እና እሹሩሩ አለ ግድያ እና ለሰባዊ መብት ጥሰት ሞገተ ሚዛናዊ ሰው ግን ቆመ ተቀመጠ አጣ ምን ተባለ",
"ንዴት ነው ጥቅል ጎመን አይብ ወጣ ሰው",
"እኔ ቀና አሰበ ታኬ ሰው ችግር ገባ ቅን ሰው ባረከ አንተ አይነት ሀላፊነት ሰማ ሰው ሰፋ አለ ወደደ",
"ሀቀኛ ጠፍቶበት፣ ዋለ መልቲ ጌጥ ነው ድንቁርና፣ ገደለ ሎቲ እስኪ ጠየቀ ዮሀንስ አድማስ",
"እንግዲህ፥ ወደደ ሆይ፥ ይህ ተስፋ ቃል ካለን፥ እግዚአብሄር ፍርሀት ቅድስና ፍጹም ተደረገ ስጋ ነፈሰ ረከሰ ሁሉ ራስ ነጻ ቆሮንጦስ",
"አሜሪካ ህዳሴ ግድብ አዲስ ስምምነት ሰነድ ቀረበ ፍላጎት አለ",
"ተናገረ ፊት አሰበ ተገናዘበ ረዳ ስሜት ጸዳ በቃ ረዳ ያዘ ግድ",
"አቢይ መንግስት ኦሮሚያ ውስጥ አለ ዩኒቨርሲዎችን ዘጋ አማራ ክልል አለ ዩኒቨርሲቲ ክፍት ተደረገ ኦሮሞ ማረ ጨረሰ ሆነ አለ ነው",
"አጼ በላ ከለከለ ሰራዊት አለ ኦሮሚያ ልዩ ፖሊስ አለ መረቀ ወጣ ኦሮሞዎችን ወለጋ ላይ አዝምቷል፣ ኦሮሞ ኦሮሞ ገደለ አየ ይህ ከፋ አውሬነት ለም",
"ጀበሉ ትክክለኛዉን ታሪክ ተነተነዉ በረታ ሀቅ ይሄው ነው",
"ዘመን ወጣ ጉብል ተባለ ደህናነህ ንዴት ነው",
"ስድስት ቻይናውያን ጥንድ አንድ ላይ ሀዋሳ ሀይል ሪዞርት ዛሬ ሰአት ተሞሸረ ረዳ ፎቶ ጋረ ደረሰ ሀይል ሀይለኪሮስ ነው",
"ባለስልጣን አዘዘ ግዴታ ነው መጥፎ አዘዘ ደረሰ ሴት ከበረ ናደ ባህሪ ተንከባከበ ያዘ አዘነ ግድ ነው ህሙማንን ጥሩ ቃላቶች አጽናና ህክምና በለጠ",
"እኛ ባህል አለም ላይ ሲያሸንፍ፤ ትክክል ነው አለ የምናስብ፡ ሌላ ባህል እኛ ጋረ መጣ ሲያሸንፍ፤ በፍጡም ልክ ነው አለ ጮኸ ወደደ ባህል አስተዋውቅ፤",
"ወያኔ ብልጽግና ፓርት ጥገኛ ፓርት ነው አለ፡፡ ቀጣይ ከፈደራልስት ሀይል ጋረ ውህድ ወይም ግንባር ፈጠረ ተዘጋጀ ትህንጎች ገልጸዋል፡፡ ከወያኔ ጋረ የምዋሄደው ማን ሆነ ጊዜ መጣ ነው፡፡",
"ይህ አየ ክልል ተግባር ተመለከተ አለ አቋም ከውግዘት ተቃራኒ ተራ ሆነ አሰበ ነው ተግባር አረመ እርምጃ ወሰደ ላቀ ቀጠለ ሽብርተኛ አካል ከፋ አለ ሙስሊም በደለ ነው",
"የታገቱ ማረ ጉዳይ አሳሳቢ ነው ለየ መንግስት ሰጠ ዋጋ አስቸኳይ መፍትሄ አሁኑኑ",
"መላ ክርስትና እምነት ተከተለ ወደደ ሙሉ መልካም በአል ሆነ",
"አንቺ ተደሰተ ብይ ነዋ",
"ሪፖርት|ሀድያ ሆሳእና ሜዳ ወጣ ጣፋጭ ድል መዘገበ",
"ተመሰገነ እጆት ባረከ በይልኝ",
"ታህሳስ ተዳረሰ ሀገር ምርት ደረጃ ፍላጎት ሰበሰበ ነው ላከ ረዳ ተገኘ ቻለ ተባለ",
"የኢትዮ ቴሌኮም ሚሊዮን ብር ድጋፍ ዩኒቨርሲቲ ማረ",
"የታገቱ አማራ ዩኒቨርሲቲ ማረ ጉዳይ ተመሰገነ ዶቸቨሌ",
"ደላላ የፌርማታ ሌባ ሆነ ተግባር ላቀ መሰለ ህዝብ ማጭበርበር ዋነኛ ሰራ ሆነ",
"ተመሰገነ እኛ ጀግና አንተ ቤተሰብ ሁላችሁን እንኩኣን ኣደረሳቹ",
"ኢትዮጵያ ዳያስፖራ ኤጀንሲ ደቡብ ክልል ልማት ላይ ዳያስፖራ ተሳተፈ አደገ ቻለ ሁኔታ ላይ ክልል ም/ፕሬዝዳንት ጋረ ተወያየ",
"ምኒልክ መጣ ሄደ ስንት ዘመን ሆነ ወንድም አነሰ ሐረሪ ተባለ ክልል ሆነ ጀመረ አለ ሰላሳ አመት ጽዳት በቃ አለፈ",
"እኛ ሴት የዘመናዊነት ገለጸ ስኬት አድረገው ቈጠረ ነጣ ወይም አፍሪካ ሆነ ቻለ ጠበሰ ነው ይህ እኔ የሚሳየኝ አንዲት ኢትዮጵያዊት",
"ነው ያንን መታ ምግብ በላ ኋላ ሰላም አጣ",
"ጅብ ችኩል ቀንድ ነከሰ አንተ የት አለ ምን ጥፋት ተማረ",
"ጥር የሕወሃት ንብረት አካፈለ ጥያቄ እና ግንባር ንብረት ፈራ አውድ ጉዳይ",
"ህዳሴ ግድብ ላይ ትኵር የሶስትዮሽ ውይይት ነገ አሜሪካ ይካሄዳል፡፡ ይህ ውጭ ጉዳይ ሚኒስትር ገድ ዳረገ መራ ኢትዮጵያ ልኡክ ትናንት ወደ ዲሲ አምርቷል፡፡",
"ቅርብ የእ ጀበል ደገፈ እንኳን አማራ ፍልስጤም ሄደ ያላቹሁ ኢራን ሄደ ብትባበሩን እና እረፍት ወስዳቹሁ መለሰ የኔዎቹ አይመለከታቹሁም ከወዲሁ ይቅርታ ጠየቀ ስር አለ መልእክት ተላለፈ ነው",
"እንዲህ ምርር ረካ መሰለ ነበር",
"አሁን ይሄን ይህ ላይ ጫረ ሆነ አለ ጭቅጭቅ ፈጠረ እንጅ እውነት ጠፋ ነው",
"ሰማ ሰማ ሪፓርት ተደረገ ሁላችንም አበረ",
"ይሄ እንደ ወንጀል ቈጠረ ስር ቤት ገባ አለ አንተ ሞት ፍርድ ፈረደ በቄሮ ወገረ ሞተ ቤተሰብ በቄሮ ተፈናቅለዉ ፍትህ ተገኘ ኖረ",
"ስር ኖረ መልካም ነበር ግን ብዙ ማረ እነሱ",
"ቀድሞ ነገር ሶስት ክልል አለ አማራ ኦሮሚያ ትግራይ ብዙ ውርጋጥ አክ' ቲቪስት ነው አለ ጎጠኛ አለ ፍትሀዊ ምርጫ ተካሄደ አለ አሰበ ቀልድ ነው",
"እኔ ነው ጥፋተኛ፣ በጎ ድርግ ማ",
"መልካም ስራ ደነቀ ድክመት ተቸ ለመደ ምንአልባትም ኢትዮጵያዊ ላቀ ችግር ሆነ ቀረ",
"ምን ዋጋ አለ አፈረ ለቀቀ እንጂ",
"ላይ ግል አየ ሆነ ቦታ አየ ብቃት ማነስincompetence ተነሳ ሰጠ ነው ጨረሰ ኢትዮጵያ ብልጽግና ላይ ብቻ ወሰነ ነው ምርጫ",
"ይህ ስሜት ገነገነ ጊዜ እውነት እውነት ፍትለፊት ተናገረ ፊት ሄደ እንጅ ፈራ እና ተሸማቀቀ እትም ተደረሰ ይህ ጉዳይ ላይ ኢዜማ ኪሳራ ላይ ነው አለ",
"በአደግዳዲ ጋዜጠኛ ማንቆለጳጰስ የለመድው የጲጲው አለቃ መሸረፈት፣ ሰላም ሽልማት በሚመለክት ፕ/ት ትራምፓ አለ ተመለከተ ጋዜጠኛ ጠበቅ ተደረገ ሲጠይቀው፣ ሀሳብ ገለጸ ቅእት",
"ኦሮሞ ፌደራላዊ ኮንግረስ አዲስ ጽፈት ቤት ምረቃ ዝግጅት ከፊል ገጽታ",
"ወቅት ሀገር ወጣ ስርአት ምን መሰለ ደነበረ ረዳ ጋረ ጥቂት አለ በለጠ ግልጽ ሆነ ነበር መሰለ",
"እስቲ ሌሎችሁ ዘር ደረጀ ፓርቲ ምርጫ ላይ ቀረበ ዘር መረጠ ሆነ ወይም ፓርላማ ገባ",
"ሰው ግን ከፍተኛ ስራ አጥነት ይነበብበታል",
"መልካምነት ራስ ነው አሜሪካ ነሳ ሲቲ ነዋሪ ሆነ አራ ዳርሊንግ አንድ ወቅት ስራ ወጣ ወደ ኖረ ቀና ላይ ሳለ አንድ እድሜ ጠና አለ አዛውንት",
"ጌችዬ ጀመረ ነገረ ነበር ወጣትነት ዘመንክን ህዝብ እና ሀገር ደህንነት ብዙ ሰራ ምስጋና ግን አንተ ተሳደደ ሆነ ቀስ አለ ገባ ነው እውነት",
"ክፍል አለ መንፈሳዊ ብሥለት አለ ርእስ ያእቆብ መልእክት ላይ ይህ ቀደም ሰጠ ትምህርት ዘወትር ሀሙስ ከፈለ",
"ኦሮሚያ ልዩ ፖሊስ እና ታከለ ወረወረ ሰራዊት ይህንን ደበበ አለጠ በተጠንቀቅ ተገኘ ቀጣይ ላቀ እቅድ አአ በኦፌኮ ጥምረት ስር ሆነ ሰካ ግን ብልጽግና ስር",
"ጠራ አቁዋም ነው፣ እኛ ወደደ",
"ዎላይታ እና ኦሮሞ ወንድማማችነት ዘመን ተሻገረ ሰበረ ድልድይ ነው ሰላ የዎብን ጽ/ቤት ሀላፊ አቶ አንዱአለም ታደሰ ቦልጣና በፌስቡክ ገጽ",
"ከመቆዘምና ገፋ አበረ ኢትዮጵያ ተስፋ",
"አገር ፍትህ ስርአት ገለልተኛ ሚዛናዊ ሆነ ፍትህ ተገኘ አለ አሰበ ተጃጃለ ነው አምባገነን ተገለገለ ሆነ አለ ኤርሚያስ አመልጋ ይህ ምክንያት ቻለ ፍርድ",
"እትዮጵያ መፈክር ፈረሰ መፈክር ቀጠለ ምትሃተኛው እና ደፈነ የፖሎቲካ ሳይንቲስት ወር ቡሃላ እትዮጵያ ጠቀለለ ሚኒስትር",
"ምድረ ሽፍታ የእፉኝ ልጅ ጥርስ ወርቅ ቀረ ዘረፈ ስንት ኢላማ ድርግ ግፍ ገደለ መንግድ አሰረ አሁን ብድር ልጅ አየ ነው",
"ታኬ ድሀ አባት ልማት መራ እግዚአብሄር ጠበቀ",
"አርሲ ነገሌ ያላቹ እግዚአብሄር እንባቹን አበሰ ሁሉ ጊዜ አለ ተባለ ደስታ ዘመረ ቀን ቶሎ መጣ",
"አወቀ ምን ይህ ህግ ላይ ሆነ ኖረ ሰው ፓስፖርቱም ሰጠ ደነቀ ግን ፓርቲ ተባለ ጠራ ቻለ ኢትዮጵያ ውስጥ አለ",
"አየ አራጌ ኢትዮጵያዊ ሆነ ረገጠ ነው ቀጠረ",
"አፍ ላይ ሙልት አለ ልብ ደረሰ",
"ቀና ግራ ተመለከተ ዙሪያ ባመታትር፥ አይን ሁሉ አየ ሁሉ ጨለማ ነዉ፤ ነገር ግን አይን አንተ አነሳ ፊት ተስፋ ተናገረ በራ ቀን ፊት አለ፥ ያዘ ፀንተሽ ቆመ አለ",
"ሁሉ ኢትዮጵያዊ በአለበት ድል ዲሞክራሲ",
"ለመደ በረታ ተስፋ ሰጠ ፎቶ ነው",
"አንተ ቅል ራስ ጭንቅላት ልክ ውጪ ውስጥ ባዶ ነዉ",
"እንደ እንስሳ ጕርእ ነበረ ወረረ አያት ኖረ የነበረዉ እድሜ ምሁር ደብተራ ስልጡን አድርገዋቸዉ አንተ መሀይምነት ጸዳ ሽል ንግድ ልጅ",
"ሆድ ገንዘብ ጣመ ሰደደ ምን እውቀት ሸመታ እና ባርነት ሮሮ ነጻነት ፍለጋ ሀገር ወጣ ተነጻጸረ አለ ነው ኦቦሌሶ ጥቅም ባሪያ",
"ካምቦዲያ አለ ፎቅ ህንጻ ተደርምሶ ሰው ሞት",
"እውነተኛ ስቃይ ቅርብ አወቀ",
"ክለሳ እውቀት/መረጃ ሞላ አወቀ ነው አለ ጋረ ክላሽ ተደረገ ዘለቀ ነው እንግዲህ ላጠ አለ ሀይማኖት ብሄር ገባ የቀንዳውጣ ዛጎል አለ",
"ሰለጠነ ተግባር ሰለጠነ ምላሽ ነው",
"ሳውዱ ከስጣጋ ሄድናሞክር ስለስው ሀገር ምን ይመለከተሃል የሳውዲ ዜጋ አይደለ ገረመ ስንት ከንቱ ሆነ አለ",
"ጠቀለለ ሚኒስትር ዶ/ር በላ አህመድ ኦሮሚያ ክልል ቦረና ዞን ያቤሎ ከተማ ጉብኝት ተደረገ ዛሬ ጠዋት ገባ ኦሮሚያ ክልል ምክትል ፕሬዝደንት አቶ ሽመል አብዲሳ አቀባበል ተደረገ",
"ይሄ 'አሲና አለ አሲና ገና አለ ዘፈን ሰማ የት ገባ ፈጠረ",
"ባህርዳር ተደረገ ተቃውሞ ሰልፍ ተቃውሞ ሰማ ወጣ ክልል ከፍተኛ ባለስልጣን ገጠመ ተቃውሞ ምክንያት ንግግር ተደረገ ቻለ ቀረ",
"አማራ ብሄራዊ ክልላዊ መንግስት ሰመራ ላይ ልዩ አደረ ትምህርት ቤት ገነባ ነው አማራ ክልል መንግስት አፋር ክልል ልዩ አደረ ትምህርት ቤት ገነባ ሀሳብ አማራ ህዝብ",
"እባካችሁ ይህንን ጣም እናስተውል፤ ብዓዴን/አዴፓ አማራነትን ገደለ ሰራ መሳሪያ ሆነ ወያኔ/ሻቢያ/ኦነግ/ኦዴፓ ደገመ አማራ ገደለ እና ጠፋ ደረጀ ናዚዎች ሆነ ነው",
"ያዘ እስኬው ሁሌም ከጎንሕ ነው ኢንሻአላህ ተሸነፈ ድል እውነተኛ ዲሞክራሲ",
"ደቡብ አፍሪካ ኖረ ኢትዮጵያዊ ትኩረት ተደረገ ፕሬዝዳንት ሲሪል ራማፎሳ ጋረ ተወያይተው ኢትዮጵያዊ ትኩረት ተገኘ ቻለ ስምምነት ላይ ደረሰ ጠ/ሚ/ር ዶ/ር",
"አእምሮ ረጋ ፈጠረ ሆይ ሀገር ሰላም",
"ከወዲሁ ምርጫ ቅስቀሳ ተደረገ መሰለ የአአ ህዝብ ባለደራውን ወይም አብሮነት መረጠ መከራ እራሱን አደገ አማራ ክልል ላይ ደገመ ንስር መረጠ ደም አጣ ከወዲሁ ተወገደ አለ",
"እነ ሚረር አመነ ነው ሀገር ሚዲያ ቀለጠ የከረመው",
"ባረከ ሰው ነው",
"እነ እስከራሙ ፈለገ እንደ ይህ አይነት ከአኼራ ላቀ ለዱንያዊ ጥቅም ሰከረ ነው ጀዝቦችን",
"አሁን ሰአት አዋሳ የኢዜማ ስብሰባ ሞቅ ደመቅ አለ ሁኔታ ስብሰባ ጀመረ",
"ከሰሰ ሆነ አለፈ አመት ዘረፈ ራስ ከሰሰ ሳንቲም ቀረ መለሰ ገባ",
"ለለዳታ አከለ እንደአቅሚቲ ትንሽ አንበናል እርሾ ነበረ በሐር ሀይል ኢትዮጵያ ፈለገ ብቻ ሆነ ጣም ፈለገ",
"ቀላል ጻፈ መጽሀፍ ሁሉ ጠራ",
"ተማሪዋች ገዛ አገር እየታገቱ አንተ ቦታ ተምነሸነሸ ጥቅም አለ ሕገ ወጥ ስርአት መሳይዝ ቻለ እልፍ አለ ህይወት ማንሳሳ",
"እኮ ወያኔን ፊት ፊት ገጠመ ጀግና ነው አነሰ ሰውነት ወረደ ሀሳብ",
"ሰርጥዎ አስፈላጊ ነው",
"በላ አለ በላ ደረጀ ወንጀለኛ ማህበራዊ የትስስር ገጽ ለየ ሴት እያጭበረበሩ ሆነ ተነገረ",
"አንተ ቀረበ ምርጥ መራ ነው",
"መንገድ አመልክተኝ፥ ፍለጋ መዝሙረ ዳዊት",
"ቀጠለ ምርጫ ሆነ ሀገር ዜጋ ምን አማራጭ ለም ቦርጭ ሸሚዝ ቁልፍ ተጨነቀ ነው መረጠ አለ ግን አክቲቪስትነት እና",
"ሰጠ ሁሉ ተቀበለ ከበረ ከበረ ፈረንጅ ላይ አየ ሁሉ ቀዳ ሁሉ አደገ ባህል፣ ወግ፣ ሀይማኖት ወዘተ ወረሰ ብቻ ኖረ በጎ",
"በአል ሰሞን ሀሰተኛ ገንዘብ ዝውውር ኖረ ቻለ ፖሊስ ተጠነቀቀ",
"እውነት ነው ወይስ ቀልድ የወያኔ ፊርደ ገመደለ ሥረዓት አሁን ቀረ አለ ነው ሠራታኞች ቅሬታ ገለጸ አለም ቀፈፈ ህገዊ መብት ነው",
"በራ አለ አገር በራ ቈጠረ ምን ተደረገ በራ ሀይል ጠፋ ሀይል ተባለ",
"አለፈ ሳምንት የ«አዲስ አበባ»ን ወጣት ሰበሰበ «ምረጡኝ» አለ ነበረ አብይ ብልጽግና ፓርቲ ላይ ጠራ ጀመረ ጀመረ ለወይዛዝርት ብርቱካን ወይን ሶልያና",
"የሁላችንንም ረታ ነው ዳመጠ",
"ምን አደረ ትላንት ነበረ የእስቴድየም ስብሰባ ስለ መኪና አደጋ ጸሎት ተደረገ ላቀ ዋለ ነው ቀጣይነት በየአምልኮ ስፍራ ደቂቃ መልክት አለፈ",
"እነከሌ ሌባ ወይም ሌባ ልጅ ሆነ አለ ሌባነው ራስ ሆነ ገንዘብ እንዲህ ወጣ",
"ጌታ ንግግር ዲናሞ ነው ኤልሲ ክላስ አለ ንቁ ነው ይቅርታ አብርሽዬ ፈጠረ ግርታ",
"ይህንን ትዊተር ለማንበብ ትርጉም ጠቀመ ደህና ምን ነገር ተደረገ ቻለ ምክንያት ትርጉም ጻፈ ነው ፡፡ እሱ ሁለት ነገር ተናገረ እባክዎን ፡፡",
"አመት ሙሉ ቀበሌ ያዘ ጫካውስጥ ቈየ ሀገር በጠበጠ ኖረ ውጭ ሀገር ውስጥ ሆነ ህዝብ አረደ አመት ሙሉ ወያኔን እናንተ መራ ስም መራ አለ",
"እውነት የፖለቲከኛ ቅን ለም የታገቱትን ሴት ልጆች/እህቶች ጉዳይ ውግዝ አስፈላጊ ተደረገ ንዴት አንድ 'የመንግስት' አካል ጠፋ አየ ሀገር ኢትዮጵያ",
"ዜግነት ፓርቲ ሰጠ ጀመረ ወይስ አማሪካነቱን አሸ ጥሩነህ ጋምታስ እንደ ጃዋር ምን በቁቤ ብቻ",
"ሰው በጎ ሁንላትመሰገን ቻለ በጎ ሰራ በጎ መለሰ ወይም ቻለ ተባለ ቻለ ሆነ ፍቅር ዘራ ከፍ አለ",
"ጉልቻ ቀየረ ወጥ ጣፈጠ ደደብ ሁሌም ደደብ ነዉ መቸም አዲስ ነገር መጣ ነው ወይ ኤርትራ የነታምራት አባት መቃብር",
"እኔ አለ ኦሮሞ ህዝብ እንደ ሀገር ቀጠለ ወሰነ ማህበረሰብ ነው",
"መልካም እለተ ሰንበት ከሰሰ ረድኤት በረከት ተሳተፈ አምላክ እመቤት ሆይ እስራት ሀገር ኢትዮጵያ አደራሽንባዕታ ማርያም በእለተ ቀን ክፉ ሁሉ",
"ናንት ወጣት መሰለ ሽማግሌ ገዛ ሁላችሁም ትህትና እርስ እርስ ተከባበረ ምክንያት ኩራተኛ ተቃወመ ለትሑታን ግን ጸጋ ሰጠ ጴጥሮስ",
"አጠቃላይ ወለጋ የጃዋር መንጋጋ ነው¡¡",
"ሆነ አለ ነገር ጣም አዘነ",
"መላ አማራ ህዝብ ድርጅት ሀላፊ ነበረ ነው አለ ሃሃሃሃ መታ ትክክለኛ ነገር ተናገረ ነው ናፈቀ ተስፋ ያሌለው ህዝብ",
"ምን አለ አገሪቷን ሰላም ተደረገ ሳቀ",
"ኢትዮጵያ ፈጠራ ባለሙያ ማህበር ህጋዊ እውቅናን ተገኘ መሰረተ ማህበር ታህሳስ ሲቪል ማህበር ኤጄንሲ መዘገበ ሀገር ቀፈፈ ደረጃ ፈጠራ ዘርፍ ቀሰቀሰ",
"እውነተኛ ሀይማኖተኛ ስው ቀደመ",
"ዘመናዊ እና ተራማጆቹእንደ እነ ጀመረ ደገመ",
"አረ ወዮ ካቶሊክ ጳጳስ የታሉ አሜሪካ ኢራንን ታገሰ አለም ህዝብ አለቀ ፊት",
"",
"ተመሰገነ ሀኒቾ ዶር ግን ባልደራስ ቀላቀለ አለ",
"ሌባ አይነ ደረቅእኔ ልወቅላቹህ አለ አማራ ጠልነት ሀሳብ ሌላ ብሄርቤረሰቦችን ሰበሰበ ሃሃ አማራ ግዛት ላይ እንደፈለጋቹህ እንደ ቡና ቁር ዘግናቹህ ወሰደ ነገር",
"እንደ ሆነ ኢትዮጵያ እጅግ ዝቅተኛ ተባለ ኢኮኖሚ እድገት መዘገበ እና ይህ ደፈረ ስለማይነግሯችሁ፣ ተባበረ ብይ ነው",
"ይሄን መሰለ ሌላ ዘገነነ ዘገነነ ቅጥ አጣ ወጣ ወጣ",
"ስለ ወለጋ እና ሌላ ምእራብ ኦሮሚያ አካባቢ ሰማ ነገር ነፈሰ ረበበ ነው ፈጠረ ሰላም ወረደ",
"ምሳሌ ትእቢት መጣ ውርደት ትመጣለች፤ በትሑታን ዘንድ ግን ጥበብ ተገኘ",
"ተንኮል ጠባብ ዘረኝነት መረዘ ልብ ጸዳ ያ ለአላህ ሰገደ እንጂ ይሄን ጥቁር መርዝ ልብ ያዘ ሰገደ አፈረ ቀጠለ ደሞ አማራ ሙስሊም",
"ሀሳብ እርስ ተጨነቀ ነበረ እውነት እኔ ተጠቃ አውቃለሁ፡፡",
"አንተ ፊት ተከብሎኛል እጅ አቀፈ ጌታ ሆይ አንተ ደስ አለ"
]
